Repository: jwulf/publican
Catalog: Users_Guide/*/Building_a_Book.po
Languages: fr_fr

source: Building a document
fr_fr: Construction d'un document

source: Note — Customizing output
fr_fr: Note — Personnalisation de la sortie

source: If you maintain multiple versions of a document, you can create a configuration file for each version. When building the document, you can use the <option>--config</option> to specify which configuration file (and therefore which set of parameters) to use in a particular build, for example:
fr_fr: Si vous entretenez plusieurs versions d'un document, vous pouvez créer un fichier de configuration pour chaque version. À la construction du document, vous pouvez utiliser l'option <option>--config</option> pour préciser le fichier de configuration (et donc le jeu de paramètres associés) à utiliser dans une construction donnée, par exemple :

source: <prompt>$</prompt> <command>publican build --formats html,pdf --langs en-US,de-DE,hu-HU --config community.cfg</command>
fr_fr: <command>publican build --formats html,pdf --langs en-US,de-DE,hu-HU --config community.cfg</command>

source: To build a document:
fr_fr: Pour construire un document :

source: Change into the root directory of the document. For example, if the document is named <literal>Test_Book</literal> and is located in the <filename>~/books/</filename> directory, run the following command:
fr_fr: se placer dans le répertoire racine du document. Par exemple, si le document s'intitule <literal>Livre_test</literal> et est situé dans le répertoire <filename>~/livres/</filename>, exécutez la commande :

source: <prompt>$</prompt> <command>cd ~/books/Test_Book</command>
fr_fr: <command>cd ~/livres/Livre_test</command>

source: Run a test for any errors that would stop the book from building in your chosen language, for example:
fr_fr: lancez un test pour détecter une éventuelle anomalie qui empêcherait la construction de l'ouvrage dans la langue choisie, par exemple :

source: <prompt>$</prompt> <command>publican build --formats=test --langs=en-US</command>
fr_fr: <command>publican build --formats=test --langs=en-US</command>

source: Run the following command to build the book:
fr_fr: pour construire l'ouvrage, lancez :

source: <prompt>$</prompt> <command>publican build --formats=<replaceable>formats</replaceable> --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=<replaceable>formats</replaceable> --langs=<replaceable>langues</replaceable></command>

source: Replace <replaceable>formats</replaceable> with a comma-separated list of the formats that you want to build; for example, <literal>html,html-single,pdf</literal>. Replace <replaceable>langs</replaceable> with a comma-separated list of the languages that you want to build; for example, <literal>en-US,sv-SE,uk-UA,ko-KR</literal>.
fr_fr: Remplacez <replaceable>formats</replaceable> par la liste des formats, séparés par des virgules, que vous souhaitez construire ; par exemple, <literal>html,html-single,pdf</literal>. Remplacez <replaceable>langues</replaceable> par la liste des langues, séparées par des virgules, pour lesquelles vous voulez construire le document ; par exemple, <literal>en-US,sv-SE,uk-UA,ko-KR</literal>.

source: Formats for the <command>build</command> action
fr_fr: Formats pour l'action <command>build</command>

source: <application>Publican</application> outputs the document as in multiple HTML pages, with each chapter and major section on a separate page. <application>Publican</application> places an index at the start of the document, and places navigational elements on each page.
fr_fr: <application>Publican</application> crée une sortie du document au format HTML sur plusieurs pages, avec chaque chapitre et paragraphe majeur sur une page distincte. <application>Publican</application> met un index en tête du document, et place des éléments permettant la navigation sur chaque page.

source: Use the <parameter>chunk_first</parameter> and <parameter>chunk_section depth</parameter> parameters in the <filename>publican.cfg</filename> file to control how <application>Publican</application> chunks sections in this format.
fr_fr: Utilisez les paramètres <parameter>chunk_first</parameter> et <parameter>chunk_section depth</parameter> dans le fichier <filename>publican.cfg</filename> pour contrôler la façon dont <application>Publican</application> découpera les chapitres dans ce format.

source: <application>Publican</application> outputs the document as a single HTML page with the table of contents near the top of the page.
fr_fr: <application>Publican</application> crée la sortie sur une page HTML unique avec la table des matières en tête de page.

source: <application>Publican</application> outputs the document as a single HTML page with the table of contents located in a separate pane on the left side of the document.
fr_fr: <application>Publican</application> crée une sortie du document sur une seule page HTML avec la table des matières dans un panneau séparé à gauche du document.

source: <application>Publican</application> outputs the document as a manual page ("man page") for use with Linux, UNIX, and similar operating systems.
fr_fr: <application>Publican</application> prépare une sortie du document sous forme d'une page de manuel (« man page ») à utiliser avec Linux, UNIX ou les systèmes d'exploitation semblables.

source: <application>Publican</application> outputs the document as a PDF file.
fr_fr: <application>Publican</application> fait une sortie du document sous forme d'un fichier PDF.

source: <application>Publican</application> validates the XML structure of the book, but does not transform the XML into another format.
fr_fr: <application>Publican</application> valide la structure XML de l'ouvrage, mais ne transpose pas le XML dans un autre format.

source: <application>Publican</application> outputs the document as a single text file.
fr_fr: <application>Publican</application> prépare une sortie du document sous forme d'un fichier texte unique.

source: <application>Publican</application> outputs the document as an e-book in EPUB format.
fr_fr: <application>Publican</application> prépare une sortie du document sous forme d'un livre électronique au format EPUB.

source: The following examples demonstrate commonly used <prompt>$</prompt> <command>publican build</command> commands:
fr_fr: Voici des exemples montrant des commandes courantes avec <command>publican build</command> :

source: <prompt>$</prompt> <command>publican build --help</command>
fr_fr: <command>publican build --help</command>

source: List available <prompt>$</prompt> <command>publican build</command> options for building a book.
fr_fr: liste les options disponibles de <command>publican build</command> pour construire un ouvrage.

source: <prompt>$</prompt> <command>publican build --formats=test --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=test --langs=<replaceable>langues</replaceable></command>

source: Check that the book can be built correctly. Build <command>--formats=test</command> before running any other <prompt>$</prompt> <command>publican build</command> command, and before checking a book back into a version-controlled repository from which other contributors might download it.
fr_fr: vérifie que l'ouvrage peut être correctement construit. Lancez la commande <command>--formats=test</command> avant d'exécuter tout autre commande de <command>publican build</command> et avant de téléverser un ouvrage dans un dépôt à version contrôlée à partir duquel d'autres contributeurs pourraient le télécharger.

source: <prompt>$</prompt> <command>publican build --formats=html --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=html --langs=<replaceable>langues</replaceable></command>

source: <prompt>$</prompt> <command>publican build --formats=html-single --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=html-single --langs=<replaceable>langues</replaceable></command>

source: Build the book in single-page HTML format. The output will be a single HTML file located in the <filename><replaceable>Doc_Name</replaceable>/tmp/<replaceable>language</replaceable>/html-single/</filename> directory.
fr_fr: Construit l'ouvrage au format HTML sur une seule page. La sortie sera un fichier HTML unique situé dans le répertoire <filename><replaceable>Nom_document</replaceable>/tmp/<replaceable>langue</replaceable>/html-single/</filename>.

source: <prompt>$</prompt> <command>publican build --formats=pdf --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=pdf --langs=<replaceable>langues</replaceable></command>

source: Build the book as a PDF file. <application>Publican</application> relies on an external application, <application>FOP</application> to render PDF. Therefore, building PDF might not be available on all systems, depending on the availability of <application>FOP</application>. The output will be a single PDF file located in the <filename><replaceable>Doc_Name</replaceable>/tmp/<replaceable>language</replaceable>/pdf/</filename> directory.
fr_fr: Construit l'ouvrage sous forme d'un fichier PDF. <application>Publican</application> s'appuie sur une application externe, <application>FOP</application>, pour le rendu en PDF. En conséquence, la construction de PDF peut ne pas être possible sur tous les systèmes ; elle dépend de la disponibilité de <application>FOP</application>. La sortie sera un fichier PDF unique situé dans le répertoire <filename><replaceable>Nom_document</replaceable>/tmp/<replaceable>langue</replaceable>/pdf/</filename>.

source: <prompt>$</prompt> <command>publican build --formats=html,html-single,pdf --langs=<replaceable>languages</replaceable></command>
fr_fr: <command>publican build --formats=html,html-single,pdf --langs=<replaceable>langues</replaceable></command>

source: Build the book in multi-page HTML, single-page HTML, and PDF formats.
fr_fr: Construit l'ouvrage dans les formats HTML multi-pages, HTML page unique et PDF.

source: Building a document without validation
fr_fr: Construction d'un document sans validation

source: Because the document has not been validated against the DTD, the quality of the output produced when you build with the <option>--novalid</option> option is highly suspect. Do not publish documentation that you have built with the <option>--novalid</option> option.
fr_fr: Comme le document n'a pas été validé vis à vis du DTD, la qualité de la sortie produite avec l'option <option>--novalid</option> est fortement suspecte. Ne publiez pas de documentation construite avec l'option <option>--novalid</option>.
