Repository: jwulf/publican
Catalog: Users_Guide/*/Command_summary.po
Languages: fr_fr

source: Command summary
fr_fr: Résumé des commandes

source: Command options
fr_fr: Options des commandes

source: displays help
fr_fr: affiche une aide

source: displays the manual page
fr_fr: affiche la page du manuel

source: <prompt>$</prompt> <command>publican --help_actions</command>
fr_fr: <command>publican --help_actions</command>

source: displays a list of <firstterm>actions</firstterm>
fr_fr: affiche la liste des <firstterm>actions</firstterm>

source: displays the <application>Publican</application> version number.
fr_fr: affiche le numéro de version de <application>Publican</application>

source: <option>--config <replaceable>file</replaceable></option>
fr_fr: <option>--config <replaceable>fichier</replaceable></option>

source: specifies a config file for a document, in place of the default <filename>publican.cfg</filename>.
fr_fr: définit un fichier de configuration pour un document, à la place de <filename>publican.cfg</filename> par défaut.

source: disables ANSI colors in <application>Publican</application> logging.
fr_fr: désactive les couleurs ANSI dans la journalisation de <application>Publican</application>.

source: disables all logging.
fr_fr: désactive toute journalisation.

source: <prompt>$</prompt> <command>publican add_revision</command>
fr_fr: <command>publican add_revision</command>

source: adds an entry in <filename>Revision_History.xml</filename>. Options:
fr_fr: ajoute une entrée dans <filename>Revision_History.xml</filename>. Options :

source: --lang=<replaceable>LANG</replaceable>
fr_fr: --lang=<replaceable>LANGUE</replaceable>

source: the language the XML will be written in.
fr_fr: la langue dans laquelle est écrit le XML.

source: --revnumber=<replaceable>REVNUMBER</replaceable>
fr_fr: --revnumber=<replaceable>NUMÉRO_RÉVISION</replaceable>

source: revision number to use for a revision.
fr_fr: numéro de révision à utiliser pour une révision.

source: date to use for a revision.
fr_fr: date à utiliser pour une révision.

source: --member=<replaceable>MEMBER</replaceable>
fr_fr: --member=<replaceable>MEMBRE</replaceable>

source: an entry to be added to the revision. Can be specified multiple times.
fr_fr: une entrée à ajouter à la révision. Peut être précisée plusieurs fois.

source: --firstname=<replaceable>FIRSTNAME</replaceable>
fr_fr: --firstname=<replaceable>PRÉNOM</replaceable>

source: firstname to use for a revision.
fr_fr: prénom à utiliser pour une révision

source: --surname=<replaceable>SURNAME</replaceable>
fr_fr: --surname=<replaceable>NOM_FAMILLE</replaceable>

source: surname to use for a revision.
fr_fr: nom de famille à utiliser pour la révision.

source: email to use for a revision.
fr_fr: adresse électronique à utiliser pour la révision.

source: transforms XML into a document. Options:
fr_fr: transforme un XML en document. Options :

source: display help message.
fr_fr: affiche un message d'aide.

source: use a nonstandard config file.
fr_fr: utilise un fichier de configuration non standard.

source: override path to Common_Config directory.
fr_fr: chemin se substituant à celui vers le répertoire Common_Config.

source: override path to Common_Content directory.
fr_fr: chemin se substituant à celui vers le répertoire Common_Config.

source: disable ANSI colorization of logging.
fr_fr: désactive les couleurs ANSI de la journalisation.

source: disable all logging.
fr_fr: désactive toute journalisation.

source: directory to source brand files from.
fr_fr: répertoire où rechercher les fichiers de la marque.

source: comma-separated list of formats to build. For example: html,pdf,html-single,html-desktop,txt,epub (mandatory).
fr_fr: liste, avec une virgule comme séparateur, des formats à construire. Par exemple : html,pdf,html-single,html-desktop,txt,epub (obligatoire).

source: --langs=<replaceable>LANGS</replaceable>
fr_fr: --langs=<replaceable>LANGUES</replaceable>

source: comma-separated list of languages to build. For example: en-US,de-DE,all (mandatory).
fr_fr: liste, avec une virgule comme séparateur, des langues à construire. Par exemple : en-US,de-DE,all (obligatoire).

source: sets up built content for publishing.
fr_fr: définit le type de construction d'un contenu de publication.

source: embeds a table of contents into HTML output.
fr_fr: intègre une table des matières dans la sortie HTML.

source: skips DTD validation when building a document.
fr_fr: n'effectue pas la validation par rapport au DTD lors de la construction du document.

source: --src_dir=<replaceable>SRC_DIR</replaceable>
fr_fr: --src_dir=<replaceable>RÉPERTOIRE_SOURCE</replaceable>

source: specifies the directory to source <application>Publican</application> files from.
fr_fr: définit le répertoire dans lequel retrouver les fichiers sources pour <application>Publican</application>.

source: removes the temporary directories from a document directory.
fr_fr: supprime les répertoires temporaires dans un répertoire de document.

source: <prompt>$</prompt> <command>publican clean_ids</command>
fr_fr: <command>publican clean_ids</command>

source: indents XML files neatly, and rebuilds element IDs.
fr_fr: indente les fichiers XML proprement et reconstruit les identifiants des éléments.

source: <prompt>$</prompt> <command>publican clean_set</command>
fr_fr: <command>publican clean_set</command>

source: removes local copies of remote books that are part of a set.
fr_fr: supprime les copies locales des ouvrages distants faisant partie d'un ensemble.

source: creates a new book, article, or set. Options:
fr_fr: crée des nouveaux ouvrage, article ou ensemble. Options :

source: the name of the document (mandatory).
fr_fr: le nom du document (obligatoire).

source: the documented product.
fr_fr: le produit documenté.

source: the version of the documented product.
fr_fr: la version du produit documenté.

source: the edition of the document.
fr_fr: l'édition du document.

source: the brand for the document.
fr_fr: la charte graphique du document (marque de fabrique).

source: the language in which the XML will be authored.
fr_fr: la langue dans laquelle le XML a été écrit.

source: the type of document — article, book, or set.
fr_fr: le type de document — article, livre ou ensemble.

source: <prompt>$</prompt> <command>publican create_brand</command>
fr_fr: <command>publican create_brand</command>

source: creates a new brand. Options:
fr_fr: crée une nouvelle marque de fabrique. Options :

source: creates a documentation website. Options:
fr_fr: crée un site Web de documentation. Options :

source: name of the site configuration file to create (mandatory).
fr_fr: nom du fichier de configuration du site à créer (obligatoire).

source: name of the site database file to create (mandatory).
fr_fr: nom du fichier de base de données du site à créer (obligatoire).

source: path to the directory in which to create the top-level <filename>toc.html</filename> file (mandatory).
fr_fr: chemin vers le répertoire où créer le fichier <filename>toc.html</filename> de haut niveau (obligatoire).

source: path to the template directory (by default, <filename>/usr/share/publican/templates</filename>).
fr_fr: chemin vers le répertoire du modèle (par défaut, <filename>/usr/share/publican/templates</filename>).

source: <prompt>$</prompt> <command>publican help_config</command>
fr_fr: <command>publican help_config</command>

source: displays a list of parameters for the <filename>publican.cfg</filename> file.
fr_fr: affiche la liste des paramètres pour le fichier <filename>publican.cfg</filename>.

source: installs a document on a documentation website.
fr_fr: installe un document sur un site Web de documentation.

source: name of the site configuration file (mandatory).
fr_fr: nom du fichier de configuration du site (obligatoire).

source: the language of the document to install (mandatory).
fr_fr: la langue du document à installer (obligatoire).

source: <prompt>$</prompt> <command>publican install_brand</command>
fr_fr: <command>publican install_brand</command>

source: configures a brand for installation. Option:
fr_fr: configure une marque en vue de son installation. Option :

source: path to the <application>Publican</application> Common Content files. By default, <filename>/usr/share/publican/Common_Content</filename> on Linux operating systems and at <filename>%SystemDrive%/%ProgramFiles%/Publican/Common_Content</filename> on Windows operating systems — typically, <filename>C:/Program Files/Publican/Common_Content</filename>
fr_fr: chemin vers les fichiers « Common Content » de <application>Publican</application>. Par défaut, <filename>/usr/share/publican/Common_Content</filename> sur les systèmes d'exploitation Linux et <filename>%SystemDrive%/%ProgramFiles%/Publican/Common_Content</filename> sur Windows — généralement, <filename>C:/Program Files/Publican/Common_Content</filename>

source: <prompt>$</prompt> <command>publican lang_stats</command>
fr_fr: <command>publican lang_stats</command>

source: generates a translation report for a language.
fr_fr: génère un rapport sur la traduction pour une langue.

source: a comma-separated list of languages for which the report will be generated.
fr_fr: une liste, avec une virgule comme séparateur, des langues pour lesquelles le rapport doit être créé.

source: <prompt>$</prompt> <command>publican migrate_site</command>
fr_fr: <command>publican migrate_site</command>

source: migrates a website database from <application>Publican</application> 2.x to <application>Publican</application> 3. Options:
fr_fr: opère la migration d'une base de données d'un site Web de <application>Publican</application> 2.x vers <application>Publican</application> 3. Options :

source: website configuration file to use or create.
fr_fr: fichier de configuration du site Web à utiliser ou créer.

source: packages a document or brand for distribution. Options:
fr_fr: empaquette un document ou une marque en vue de sa distribution. Options :

source: the language to package (mandatory for documents, meaningless for brands).
fr_fr: la langue à empaqueter (obligatoire pour les documents, sans signification pour les marques).

source: specifies that a document RPM package should be built for desktop use (meaningless for brands).
fr_fr: précise que le paquet RPM du document doit être construit en vue d'une utilisation de bureau (sans signification pour les marques).

source: pushes a package to the <application>Brew</application> build system (meaningless outside Red Hat).
fr_fr: place le paquet dans le système de construction <application>Brew</application> (sans signification en dehors de Red Hat).

source: used in conjunction with <option>--brew</option> to specify a <firstterm>scratch build</firstterm> (meaningless outside Red Hat).
fr_fr: utilisé conjointement avec <option>--brew</option> pour demander une <firstterm>construction à partir de zéro</firstterm> (sans signification en dehors de Red Hat).

source: builds the package without the product version number in the package name.
fr_fr: construit le paquet sans numéro de version du produit dans le nom du paquet.

source: builds the package as a binary RPM package rather than a source RPM package.
fr_fr: construit le paquet en tant que paquet RPM binaire au lieu de paquet source RPM.

source: prints a list of DocBook tags banned by <application>Publican</application>.
fr_fr: affiche une liste des balises DocBook refusées par <application>Publican</application>.

source: prints a list of DocBook tags supported by <application>Publican</application>.
fr_fr: affiche une liste des balises DocBook prises en charge par <application>Publican</application>.

source: <prompt>$</prompt> <command>publican print_tree</command>
fr_fr: <command>publican print_tree</command>

source: displays a tree of the XML files included in a document.
fr_fr: affiche l'arborescence des fichiers XML faisant partie d'un document.

source: prints a list of the XML files <emphasis>not</emphasis> included with the <sgmltag>&lt;xi:include&gt;</sgmltag> tag in a book, article, or set.
fr_fr: affiche une liste des fichiers XML <emphasis>non</emphasis> inclus avec la balise <sgmltag>&lt;xi:include&gt;</sgmltag> dans un ouvrage, un article ou un ensemble.

source: prints a list of the image files <emphasis>not</emphasis> referenced by an <sgmltag>&lt;imagedata&gt;</sgmltag> tag in a book, article, or set.
fr_fr: affiche une liste des fichiers d'images <emphasis>non</emphasis> référencés par la balise <sgmltag>&lt;imagedata&gt;</sgmltag> dans un ouvrage, un article ou un ensemble.

source: removes a document from a documentation website.
fr_fr: supprime un document d'un site Web de documentation.

source: the language of the document to remove (mandatory).
fr_fr: la langue du document à supprimer (obligatoire).

source: renames a document. Options:
fr_fr: renomme un document. Options :

source: the new title for the document.
fr_fr: le nouveau titre du document.

source: the new product to which the document applies.
fr_fr: le nouveau produit sur lequel le document porte.

source: the new product version to which the document applies.
fr_fr: la nouvelle version du produit sur lequel le document porte.

source: publican site_stats --site_config=<replaceable>name_of_site_config_file</replaceable>
fr_fr: publican site_stats --site_config=<replaceable>nom_fichier_configuration_du_site</replaceable>

source: generates a site report for a documentation website. Option:
fr_fr: crée un rapport de site pour un site Web de documentation. Option :

source: <prompt>$</prompt> <command>publican update_pot</command>
fr_fr: <command>publican update_pot</command>

source: updates the POT files in a document.
fr_fr: met à jour les fichiers POT d'un document.

source: <prompt>$</prompt> <command>publican update_po</command>
fr_fr: <command>publican update_po</command>

source: updates the PO files in a document.
fr_fr: met à jour les fichiers PO d'un document.

source: comma-separated list of languages to update, or &lsquo;all&rsquo; to update all (mandatory).
fr_fr: liste, avec virgule comme séparateur, des langues à mettre à jour, ou bien, &lsquo;all&rsquo; pour toutes (obligatoire).

source: use gettext's msgmerge for POT/PO merging.
fr_fr: utilise msgmerge de gettext pour fusionner POT/PO.

source: publican update_site --site_config=<replaceable>name_of_site_config_file</replaceable>.cfg
fr_fr: publican update_site --site_config=<replaceable>nom_fichier_configuration_du_site</replaceable>.cfg

source: regenerates the templated content of a documentation website. Option:
fr_fr: régénère le contenu modélisé d'un site Web de documentation. Option :

source: Internal commands
fr_fr: Commandes internes

source: <application>Publican</application> uses the commands documented in this section internally. There is normally no need to run them manually.
fr_fr: <application>Publican</application> utilise en interne les commandes documentées dans ce paragraphe. Normalement, il n'est pas nécessaire de les exécuter manuellement.

source: Adds entries to the database of a <application>Publican</application>-generated website, with the following options:
fr_fr: ajoute des entrées dans la base de données du site Web créé par <application>Publican</application>, avec les options :

source: name of the site configuration file.
fr_fr: nom du fichier de configuration du site.

source: the language in which the document is published.
fr_fr: la langue de publication du document.

source: a comma-separated list of the formats in which the document is published, for example, <literal>pdf,html-single</literal>
fr_fr: une liste, avec la virgule comme séparateur, des formats dans lesquels le document est publié, par exemple, <literal>pdf,html-single</literal>

source: the title of the document.
fr_fr: l'intitulé du document.

source: the title of the document, as it should appear in the site's tables of contents.
fr_fr: le titre du document, tel qu'il apparaît dans les tables des matières du site.

source: the product that the document describes.
fr_fr: le produit que le document décrit.

source: the product that the document describes, as it should appear in the site's tables of contents.
fr_fr: le produit que le document décrit, tel qu'il apparaît dans la table des matières du site.

source: the version of the product that the document describes.
fr_fr: la version du produit que le document décrit.

source: the version of the product that the document describes, as it should appear in the site's tables of contents.
fr_fr: la version du produit que le document décrit, tel qu'il apparaît dans la table des matières du site.

source: the subtitle of the document.
fr_fr: le sous-titre du document.

source: the abstract of the document.
fr_fr: le résumé du document.

source: For example:
fr_fr: Par exemple :

source: removes entries from the database of a <application>Publican</application>-generated website, with the following options:
fr_fr: supprime des entrées de la base de données du site Web créé par <application>Publican</application>, avec les options :
