Repository: jwulf/publican
Catalog: Users_Guide/*/Conditionaltagging.po
Languages: cs_cz, fr_fr

source: Conditional tagging
cs_cz: Podmíněné tagování
fr_fr: Balisage conditionnel

source: In some cases you may need to maintain multiple versions of a book; for example, a HOWTO guide for product FOO can have an upstream version and an enterprise version, with very subtle differences between them.
cs_cz: Někdy můžete chtít udržovat několik verzí knihy; na příklad příručka JAK NA TO pro produkt TOTO může mít dodavatelskou (upstream) verzi a prodejní (enterprise) verzi, s velmi nepatrnými rozdíly mezi sebou.
fr_fr: En certaines circonstances, vous pouvez avoir besoin de maintenir plusieurs versions d'un ouvrage ; par exemple, un guide HOWTO pour le produit FOO peut avoir une version amont et une version entreprise, avec de très subtiles différences entre elles.

source: <application>Publican</application> makes it easy to manage differences between multiple versions of a book by allowing you to use a single source for all versions. <firstterm>Conditional tagging</firstterm> allows you to make sure that version-specific content only appears in the correct version; that is, you <firstterm>conditionalize</firstterm> the content.
cs_cz: <application>Publican</application> vám jednoduše umožní řídit rozdíly mezi několika verzemi knihy s využitím jediného zdroje pro všechny verze. <firstterm>Podmíněné tagování</firstterm> vám pomůže zajistit, aby se obsah, který se týká pouze jedné verze, objevil pouze v té správné verzi; to znamená, že obsah <firstterm>zapodmínkujete</firstterm>.
fr_fr: <application>Publican</application>facilite la gestion des différences entre plusieurs versions d'un ouvrage en vous permettant d'utiliser une source unique pour toutes les versions. Le <firstterm>balisage conditionnel</firstterm> vous permet de vous assurer qu'un contenu propre à une version n'apparaît que dans la dite version ; autrement dit, le contenu est <firstterm>conditionnel</firstterm>.

source: To conditionalize content in a book, use the tag attribute <command>condition</command>. For example, let's say the book <citetitle>How To Use Product Foo</citetitle> has an "upstream", "enterprise", and "beta" version:
cs_cz: Abyste zapodmínkovali obsah v knize, použijte u tagu atribut <command>condition</command>. Na příklad řekněme, že kniha <citetitle>Jak používat produkt Toto</citetitle> má "dodavatelskou", "prodejní" a "beta" verzi:
fr_fr: Pour soumettre un contenu à une condition dans un ouvrage, servez-vous de l'attribut de balise <prompt>$</prompt> <command>condition</command>. Par exemple, disons que le manuel <citetitle>Comment utiliser le produit Foo</citetitle> a une version « amont », une version « entreprise » et une version « bêta » :

source: To build a specific version (and thereby capture all content conditionalized for that version), add the <command>condition: <replaceable>version</replaceable></command> parameter to the <filename>publican.cfg</filename> file and run the <prompt>$</prompt> <command>publican build</command> command as normal. For example, if you add <literal>condition: upstream</literal> to the <filename>publican.cfg</filename> file of <citetitle>How To Use Product Foo</citetitle> and run:
cs_cz: Příslušnou verzi sestavíte (a proto zachytíte všechen obsah, který je opatřen podmínkou této verze) přidáním parametru <command>condition: <replaceable>verze</replaceable></command> do souboru <filename>publican.cfg</filename> a spuštěním běžného příkazu <prompt>$</prompt> <command>publican build</command>. Na příklad přidáte-li do souboru <filename>publican.cfg</filename> knihy <citetitle>Jak používat produkt Něco</citetitle> <literal>condition: dodavatelska</literal> a spustíte:
fr_fr: Pour construire une version donnée (et de la sorte intégrer tout contenu conditionnel propre à la version), ajouter le paramètre <command>condition: <replaceable>version</replaceable></command> dans le fichier <filename>publican.cfg</filename> et exécuter normalement la commande <prompt>$</prompt> <command>publican build</command>. Par exemple, si <literal>condition: upstream</literal> est défini dans le fichier <filename>publican.cfg</filename> pour <citetitle>Comment utiliser le produit Foo</citetitle>, exécuter :

source: <application>Publican</application> filters out all tags with condition attributes other than <literal>condition="upstream"</literal> and builds <citetitle>How To Use Product Foo</citetitle> in as a PDF file in American English.
cs_cz: <application>Publican</application> odfiltruje všechny tagy s jiným podmíněným atributem než <literal>condition="dodavatelska"</literal> a sestaví soubor PDF knihy <citetitle>Jak používat produkt Něco</citetitle> v americké angličtině.
fr_fr: <application>Publican</application> écarte toutes les balises avec des attributs autres que <literal>condition="upstream"</literal> et construit <citetitle>Comment utiliser le produit Foo</citetitle> au format PDF en langue anglaise (américain).

source: Conditional tagging and translation
cs_cz: Podmíněné tagování a překlady
fr_fr: Balisage conditionnel et traduction

source: Use conditional tagging with great caution
cs_cz: Podmíněné tagování používejte velmi opatrně
fr_fr: N'utiliser le balisage conditionnel qu'avec de grandes précautions

source: Use conditional tagging only with great caution in books that you expect to be translated, as conditional tagging creates extra difficulties for translators.
cs_cz: Podmíněné tagování používejte v knihách, které budou překládány, pouze s velkou opatrností, neboť podmíněné tagování vytváří pro překladatele další překážky.
fr_fr: N'utilisez les balises conditionnelles qu'avec grande précaution dans les ouvrages prévus pour être traduits ; cette fonctionnalité crée des difficultés supplémentaires pour les traducteurs.

source: Conditional tagging creates difficulty for translators in two ways: it obscures context in the <firstterm>portable object</firstterm> (PO) files through which translators work, and it makes proofreading more difficult for translators who are not deeply familiar with your book and all the conditions that you have set.
cs_cz: Podmíněné tagování vytváří nesnáze pro překladatele dvěma způsoby: činí obsah v souborech <firstterm>portable object</firstterm> (PO), se kterými pracují překladatelé, nejasný a kontrolu správnosti překladu činí obtížnější pro překladatele, kteří nejsou příliš seznámeni s knihou a všemi vámi nastavenými podmínkami.
fr_fr: Les balises conditionnelles créent des difficultés de deux sortes pour les traducteurs : elles obscurcissent le contexte dans les fichiers <firstterm>« portable object »</firstterm> (PO) sur lesquels le traducteur travaille et rendent la relecture plus délicate pour les traducteurs n'ayant pas une connaissance précise de l'ouvrage et des conditions imposées.

source: The PO files for the document contain the full set of tags from the XML files, regardless of any conditions set. When translators open the PO file for the example from <citetitle>How To Use Product Foo</citetitle> in <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" />, they see:
cs_cz: Soubory PO dokumentu obsahují úplnou sadu tagů ze souborů XML, bez ohledu na nastavené podmínky. Otevřou-li překladatelé soubor PO na příklad z ukázky <citetitle>Jak používat produkt Něco</citetitle> v <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" />, uvidí:
fr_fr: Le fichier PO du document contient l'ensemble complet des balises provenant des fichiers XML, quelles que soient les conditions définies. Quand un traducteur ouvre un fichier PO, par exemple celui de <citetitle>Comment utiliser le produit Foo</citetitle> dans <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" />, il voit :

source: #. Tag: para #, no-c-format msgid "&lt;application&gt;Foo&lt;/application&gt; starts automatically when you boot the system." msgstr "" #. Tag: para #, no-c-format msgid "&lt;application&gt;Foo&lt;/application&gt; only starts automatically when you boot the system when installed together with &lt;application&gt;Bar&lt;/application&gt;." msgstr "" #. Tag: para #, no-c-format msgid "&lt;application&gt;Foo&lt;/application&gt; does not start automatically when you boot the system." msgstr "" #. Tag: para #, no-c-format msgid "To make &lt;application&gt;Foo&lt;/application&gt; start automatically at boot time, edit the &lt;filename&gt;/etc/init.d/foo&lt;/filename&gt; file." msgstr ""
cs_cz: #. Tag: para #, no-c-format msgid "&lt;application&gt;Toto&lt;/application&gt; se při spuštění systému spustí automaticky." msgstr "" #. Tag: para #, no-c-format msgid "&lt;application&gt;Toto&lt;/application&gt; se spustí při spuštění systému automaticky pouze, pokud je také nainstalováno &lt;application&gt;Tamto&lt;/application&gt;." msgstr "" #. Tag: para #, no-c-format msgid "&lt;application&gt;Toto&lt;/application&gt; se při spuštění systému automaticky nespustí." msgstr "" #. Tag: para #, no-c-format msgid "Chcete-li, aby se &lt;application&gt;Toto&lt;/application&gt; spustilo při spuštění systému automaticky, upravte soubor &lt;filename&gt;/etc/init.d/toto&lt;/filename&gt;." msgstr ""

source: Because PO files include do not include attributes from tags, there is nothing obvious here to show translators that these paragraphs are alternatives to each other and that the writer does not intend that meaning should flow from one paragraph to the next.
cs_cz: Protože vkládání (include) souborů PO nezahrnuje do sebe atributy tagů, není zde nic patrného, co by naznačovalo překladatelům, že tyto odstavce jsou si vzájemnými alternativami a že autor nezamýšlí, aby text postupně po odstavcích dával smysl.
fr_fr: Comme les fichiers PO n'incluent pas les attributs de balise, il n'y a ici rien de bien évident pour indiquer au traducteur que ces paragraphes sont des alternatives s'excluant mutuellement et que l'auteur n'entendait pas introduire une continuité de signification d'une phrase à l'autre.

source: In this example, the only paragraphs where the meaning flows logically from one to the next is between paragraphs three and four. Because both of these paragraphs appear in the book for the beta version of the product, they (hopefully) make sense together. Beyond that, the use of conditionals here requires translators to translate individual small chunks of content without the ability to follow the context from one paragraph to the next. When translators must work under these conditions, the quality of the translation will suffer, or the time required — and therefore the cost of translation — will increase.
cs_cz: V této ukázce dává posloupnost textu logický smysl pouze mezi odstavcem tři a čtyři. Neboť oba tyto odstavce patří do knihy v beta verzi produktu, dávají (doufejme) dohromady smysl. Navíc použití podmínek v tomto místě vyžaduje, aby překladatelé překládali jednotlivé malé úryvky obsahu bez schopnosti sledovat kontext od jednoho odstavce k dalšímu. Pokud musí překladatelé pracovat za těchto podmínek, kvalita překladu trpí, nebo potřebný čas — a tedy náklady na překlad — rostou.
fr_fr: Dans cet exemple, les seuls paragraphes avec une continuité logique de signification sont les paragraphes trois et quatre. Et comme ce deux paragraphes n'apparaissent dans l'ouvrage qu'au titre de la version bêta du produit, il prennent (heureusement) du sens dans la continuité. Ainsi, l'utilisation de conditions demande ici au traducteur d'opérer sur le contenu de façon parcellaire sans possibilité de suivre une continuité contextuelle d'un paragraphe l'autre. Quand les traducteurs travaillent dans ces conditions, la qualité de la traduction en souffre, ou bien, cela demande plus de temps — et donc le coût de la traduction en est accru.

source: Furthermore, unless the translators who work on your book know how to configure <application>Publican</application>'s <filename>publican.cfg</filename> file and are aware of the valid conditions for your book, they cannot proofread their work. Without that knowledge, when translators proofread a document, they will wonder why they cannot find text that they know they translated and can find easily in the PO file. If you must use conditionals in your book, you must be prepared to provide a greater degree of support to your translators than you would otherwise provide.
cs_cz: Dále pokud překladatelé, kteří pracují na knize, netuší jak nastavovat soubor <filename>publican.cfg</filename> <application>Publicanu</application> a nemají ponětí o platných podmínkách pro knihu, nemohou zpětně kontrolovat svou práci. Bez těchto znalostí se budou při své kontrole dokumentu tázat, proč nemohou v dokumentu nalézt text, o kterém vědí, že ho přeložili, přitom ho lze snadno nalézt v souboru PO. Musíte-li v knize používat podmínky, buďte připraveni poskytovat překladatelům podporu v mnohem větším rozsahu, než běžně poskytujete.
fr_fr: Plus encore, excepté si les traducteurs travaillant sur l'ouvrage savent comment configurer le fichier <filename>publican.cfg</filename> de <application>Publican</application> et sont avertis des conditions de validation, il ne peuvent pas relire leur traduction. Dans l'ignorance, à la relecture, il vont s'étonner de ne pas retrouver des phrases trouvées dans le fichier PO qu'ils savent avoir traduites. Si vous utilisez des balises conditionnelles dans vos ouvrages, prévoyez de fournir une prise en charge plus poussée des traducteurs, comparée à celle habituellement consentie.

source: As an alternative to conditionals, consider maintaining separate versions of your book in separate branches of a version-controlled repository. You can still share XML files and even PO files between the various branches as necessary, and some version control systems allow you to share changes readily among branches.
cs_cz: Jako náhradu za podmínky zvažte, zda nebude vhodnější udržovat různé verze knihy v různých větvích v repozitáři se správou verzí. Stále budete moci sdílet soubory XML a dokonce i soubory PO mezi různými větvemi, jak bude nezbytné, a některé systémy se správou verzi vám umožní sdílet změny přímo mezi větvemi.
fr_fr: Comme alternative aux balises conditionelles, envisagez l'entretien de versions séparées de l'ouvrage dans des branches séparées d'un dépôt à versions contrôlées. Vous pourrez encore partager les fichiers XML et même les fichiers PO entre les diverses branches si nécessaire ; tout système de contrôle des versions vous permettra de partager rapidement les modifications selon les branches.

source: If you maintain two versions of a book in the same repository, we recommend using a separate config file for each version. For example, the <filename>upstream.cfg</filename> file might contain the condition <literal>condition: upstream</literal> and the <filename>enterprise.cfg</filename> file might contain the condition <literal>condition: enterprise</literal>. You could then specify the version of the document to build or package with the <option>--config</option>; for example, <prompt>$</prompt> <command>publican package --lang en-US --config upstream.cfg</command>. Using two separate config files saves you from having to edit the one config file each time you build or package a document.
cs_cz: Udržujete-li dvě verze knihy ve stejném repozitáři, doporučujeme používat pro každou verzi samostatný konfigurační soubor. Na příklad soubor <filename>dodavatel.cfg</filename> může obsahovat podmínku <literal>condition: dodavatelska</literal> a <filename>prodejni.cfg</filename> podmínku <literal>condition: prodejni</literal>. Uvést verzi dokumentu, která se má sestavit nebo sbalit, lze volbou <option>--config</option>; na příklad <prompt>$</prompt> <command>publican package --lang en-US --config prodejni.cfg</command>. Použití dvou samostatných konfiguračních souborů vás chrání před nutností upravovat jeden konfigurační soubor pokaždé, kdy sestavujete nebo balíte dokument.
fr_fr: Si vous entretenez deux versions d'un ouvrage dans le même dépôt, nous recommandons l'utilisation d'un fichier de configuration distinct pour chaque version. Par exemple, le fichier <filename>upstream.cfg</filename> peut contenir la condition <literal>condition: upstream</literal> et le fichier <filename>enterprise.cfg</filename> <literal>condition: enterprise</literal>. Puis vous préciserez la version du document à construire ou à empaqueter avec l'option <option>--config</option> ; par exemple, <prompt>$</prompt> <command>publican package --lang en-US --config upstream.cfg</command>. L'utilisation de deux fichiers de configuration distincts économise la modification d'un fichier de configuration unique chaque fois que vous construisez ou empaquetez un document.
