Repository: jwulf/publican
Catalog: Users_Guide/*/Disallowed_tags_and_attributes.po
Languages: fr_fr

source: Discouraged elements and attributes
fr_fr: Éléments et attributs rejetés

source: Supported, unsupported, and discouraged
fr_fr: Pris en charge, non pris en charge et rejetés

source: Not every <firstterm>element</firstterm> (tag) and attribute that works with <application>Publican</application> is <firstterm>supported</firstterm>. Specifically, not every tag has been tested with regards its effect on the presentation of a document once it has been built in HTML or PDF.
fr_fr: Tout <firstterm>élément</firstterm> (balise) ou attribut régulier n'est pas automatiquement <firstterm>pris en charge</firstterm> dans le fonctionnement de <application>Publican</application>. En particulier, toutes les balises n'ont pas été testées quant à leurs effets sur la présentation d'un document une fois celui-ci construit en HTML ou PDF.

source: <application>Publican</application> works with almost all DocBook elements and their attributes, and most of these elements are <firstterm>supported</firstterm>. Supported elements and attributes are those whose presentation in <application>Publican</application> HTML and PDF output has been tested and is of an acceptable quality.
fr_fr: <application>Publican</application> fonctionne avec pratiquement tous les éléments DocBook 4.5 et leurs attributs, et la plupart de ces éléments sont <firstterm>pris en charge</firstterm>. Les éléments et attributs pris en charge sont ceux dont le rendu dans les sorties HTML ou PDF de <application>Publican</application> a été testé et est d'une qualité acceptable.

source: Other elements and attributes that are not known to be harmful or redundant but which have not been tested for quality are <firstterm>unsupported</firstterm>. If material within a particular DocBook tag does not look correct when you build a document in HTML or PDF, the problem could be that the transformation logic for that tag has not yet been tested. Build the document again and examine <application>Publican</application>'s output as the document builds. <application>Publican</application> presents warnings about unsupported tags that it encounters in your XML files.
fr_fr: D'autres éléments ou attributs non connus pour être mauvais ou redondants, mais qui n'ont pas été testés au plan de la qualité sont réputés <firstterm>non pris en charge</firstterm>. Si un matériau dans une balise DocBook donnée ne paraît pas correct quand vous construisez un document en HTML ou PDF, le problème peut résulter du fait que la logique de transformation de cette balise n'a pas encore été testée. Construisez le document à nouveau et examinez les sorties de <application>Publican</application> au cours de la construction. <application>Publican</application> affiche des avertissements concernant les balises non prises en charge rencontrées dans les fichiers XML.

source: Finally, a small group of elements and attributes are <firstterm>discouraged</firstterm>. These elements and attributes are set out below, each accompanied by rationale explaining why it is discouraged.
fr_fr: Enfin, un petit groupe d'éléments et d'attributs sont <firstterm>rejetés</firstterm>. Ces éléments et attributs sont précisés plus bas, chacun étant accompagné d'une explication rationnelle des raisons de son rejet.

source: Use the command <prompt>$</prompt> <command>publican print_known</command> to print a list of tags that <application>Publican</application> supports, and the command <command>publican print_banned</command> to print a list of tags that are banned in <application>Publican</application>.
fr_fr: Utilisez la commande <prompt>$</prompt> <command>publican print_known</command> pour afficher une liste des balises que <application>Publican</application> prend en charge et la commande <prompt>$</prompt> <command>publican print_banned</command> pour afficher les balises rejetées.

source: <tag>&lt;glossdiv&gt;</tag>
fr_fr: <sgmltag>&lt;glossdiv&gt;</sgmltag>

source: This tag set presents terms in glossaries in alphabetical order; however, the terms are sorted according to the original language of the XML, regardless of how these terms are translated into any other language. For example, a glossary produced with <tag>&lt;glossdiv&gt;</tag>s that looks like this in English:
fr_fr: Ce groupe de balises présente des termes dans l'ordre alphabétique sous forme de glossaire ; toutefois, les termes sont triés selon la langue d'origine du XML, sans prendre en considération la façon dont les termes sont traduits dans une autre langue. Par exemple, un glossaire construit avec <sgmltag>&lt;glossdiv&gt;</sgmltag> qui ressemblerait à ce qui suit en anglais :

source: <literal>Apple</literal> — an <firstterm>apple</firstterm> is…
fr_fr: <literal>Apple</literal> — an <firstterm>apple</firstterm> is&hellip;

source: <literal>Grapes</literal> — <firstterm>grapes</firstterm> are…
fr_fr: <literal>Grapes</literal> — <firstterm>grapes</firstterm> are&hellip;

source: <literal>Orange</literal> — an <firstterm>orange</firstterm> is…
fr_fr: <literal>Orange</literal> — an <firstterm>orange</firstterm> is&hellip;

source: <literal>Peach</literal> — a <firstterm>peach</firstterm> is…
fr_fr: <literal>Peach</literal> — a <firstterm>peach</firstterm> is&hellip;

source: looks like this in Spanish:
fr_fr: se présente ainsi en espagnol :

source: <literal>Manzana</literal> — la <firstterm>manzana</firstterm> es…
fr_fr: <literal>Manzana</literal> — la <firstterm>manzana</firstterm> es&hellip;

source: <literal>Uva</literal> — la <firstterm>uva</firstterm> es…
fr_fr: <literal>Uva</literal> — la <firstterm>uva</firstterm> es&hellip;

source: <literal>Naranja</literal> — la <firstterm>naranja</firstterm> es…
fr_fr: <literal>Naranja</literal> — la <firstterm>naranja</firstterm> es&hellip;

source: <literal>Melocotonero</literal> — el <firstterm>melocotonero</firstterm> es…
fr_fr: <literal>Melocotón</literal> — el <firstterm>melocotón</firstterm> es&hellip;

source: In a translated language that does not share the same writing system with the original language in which the XML was written, the result is even more nonsensical.
fr_fr: Traduit dans une langue qui ne partage pas le même système d'écriture que la langue d'origine du XML, le résultat est encore plus dépourvu de signification.

source: <tag>&lt;inlinegraphic&gt;</tag>
fr_fr: <sgmltag>&lt;inlinegraphic&gt;</sgmltag>

source: This element presents information as a graphic rather than as text and does not provide an option to present a text alternative to the graphic. This tag therefore hides information from people with visual impairments. In jurisdictions that have legal requirements for electronic content to be accessible to people with visual impairments, documents that use this tag will not satisfy those requirements. Section 508 of the <citetitle>Rehabilitation Act of 1973</citetitle><footnote> <para> Refer to <link xlink:href="http://www.section508.gov/" xmlns:xlink="http://www.w3.org/1999/xlink">http://www.section508.gov/</link> </para> </footnote> is an example of such a requirement for federal agencies in the United States.
fr_fr: Cet élément présente l'information sous forme d'un graphique au lieu d'un texte et ne fournit pas d'option pour offrir une alternative textuelle au graphique. Cette balise cache donc une information aux personnes avec des déficiences visuelles. Dans les sites officiels, qui ont obligation légale de présenter des contenus accessibles aux mal-voyants, des documents qui utiliseraient cette balise ne satisfont pas cette prescription. La section 508 de <citetitle>Rehabilitation Act of 1973</citetitle><footnote> <para> Voyez la page <ulink url="http://www.section508.gov/">http://www.section508.gov/</ulink> </para> </footnote> est un exemple de telles obligations pour des agences fédérales aux États-Unis.

source: Note that <tag>&lt;inlinegraphic&gt;</tag> is not valid in DocBook version 5.
fr_fr: Notez que <sgmltag>&lt;inlinegraphic&gt;</sgmltag> n'est plus une balise valide dans DocBook version 5.

source: <tag>&lt;olink&gt;</tag>
fr_fr: <sgmltag>&lt;olink&gt;</sgmltag>

source: Discouraged attributes
fr_fr: Attributs rejetés

source: <tag>&lt;[element] xreflabel="[any_string_here]"&gt;</tag>
fr_fr: <sgmltag>&lt;[element] xreflabel="[chaîne_quelconque_ici]"&gt;</sgmltag>

source: The presence of an <tag>&lt;xreflabel&gt;</tag> attribute reduces the usability of printed versions of a book. As well, attribute values are not seen by translators and, consequently, cannot be translated.
fr_fr: La présence d'un attribut <sgmltag>&lt;xreflabel&gt;</sgmltag> n'a pas d'utilité dans la version imprimée d'un ouvrage. De même, les valeurs de l'attribut ne sont pas vues par les traducteurs et, en conséquence, ne peuvent pas être traduites.

source: For example, if you have the following:
fr_fr: Par exemple, si vous avez :

source: &lt;chapter id="ch03" xreflabel="Chapter Three"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is…&lt;/para&gt; &lt;/chapter&gt; [more deathless prose here] …see &lt;xref linkend="ch03"&gt; for details.
fr_fr: &lt;chapter id="ch03" xreflabel="Chapter Three"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is&hellip;&lt;/para&gt; &lt;/chapter&gt; [autre prose pour l'éternité ici] &hellip;see &lt;xref linkend="ch03"&gt; for details.

source: when your XML is built to HTML, the <tag>&lt;xref&gt;</tag> tag becomes an HTML anchor tag as follows:
fr_fr: quand le XML est construit en HTML, la balise <sgmltag>&lt;xref&gt;</sgmltag> devient une balise d'ancre HTML comme suit :

source: …see &lt;a href="#ch03"&gt;Chapter Three&lt;/a&gt; for details.
fr_fr: &hellip;see &lt;a href="#ch03"&gt;Chapter Three&lt;/a&gt; for details.

source: The text contained by the anchor tag is the same as the data in the <tag>&lt;xreflabel&gt;</tag> attribute. In this case, it means that readers of printed copies have less information available to them.
fr_fr: Le texte contenu dans la balise d'ancrage est le même que celui contenu dans l'attribut <sgmltag>&lt;xreflabel&gt;</sgmltag>. Dans ce cas, cela signifie que les lecteurs des copies imprimées disposent de moins d'informations à ce propos.

source: You could work around this if you make the value of the <tag>&lt;xreflabel&gt;</tag> attribute the same as the text within the <tag>&lt;title&gt;</tag><tag>&lt;/title&gt;</tag> element tags. However, this duplication increases the risk of typo-level errors and otherwise offers no underlying improvement. And it still reduces the amount of information presented to readers of printed copies.
fr_fr: Vous pouvez contourner ce problème si vous faites en sorte que la valeur de l'attribut <sgmltag>&lt;xreflabel&gt;</sgmltag> soit le même que celui entre les balises de l'élément <sgmltag>&lt;title&gt;</sgmltag><sgmltag>&lt;/title&gt;</sgmltag>. Toutefois, cette duplication augmente les risques d'erreurs typographiques et n'apporte aucune amélioration sous-jacente. Et, encore une fois, la quantité d'information présentée aux lecteurs des copies imprimées en est réduite.

source: The following XML:
fr_fr: Le XML :

source: &lt;chapter id="ch03" xreflabel="The Secret to Eternal Life"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is…&lt;/para&gt; &lt;/chapter&gt; [more deathless prose here] …see &gt;xref linkend="ch03"&gt; for details.
fr_fr: &lt;chapter id="ch03" xreflabel="The Secret to Eternal Life"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is&hellip;&lt;/para&gt; &lt;/chapter&gt; [autre prose pour l'éternité ici] &hellip;see &gt;xref linkend="ch03"&gt; for details.

source: Will result in an HTML anchor tag as follows:
fr_fr: donnera une balise d'ancrage HTML comme suit :

source: …see &lt;a href="#ch03"&gt;The Secret to Eternal Life&lt;/a&gt; for details.
fr_fr: &hellip;see &lt;a href="#ch03"&gt;The Secret to Eternal Life&lt;/a&gt; for details.

source: This isn't as informative as the text presented to a reader if you do not use an <tag>&lt;xreflabel&gt;</tag> attribute. The following:
fr_fr: Ce n'est pas autant porteur d'information que le texte présenté au lecteur si vous n'utilisez pas l'attribut <sgmltag>&lt;xreflabel&gt;</sgmltag>. Ainsi :

source: &lt;chapter id="ch03"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is…&lt;/para&gt; &lt;/chapter&gt; [more deathless prose here] …see &lt;xref linkend="ch03"&gt; for details.
fr_fr: &lt;chapter id="ch03"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is&hellip;&lt;/para&gt; &lt;/chapter&gt; [autre prose pour l'éternité ici] &hellip;see &lt;xref linkend="ch03"&gt; for details.

source: transforms the <tag>&lt;xref&gt;</tag> element as follows when built to HTML:
fr_fr: transforme l'élément <sgmltag>&lt;xref&gt;</sgmltag> comme suit lors de la construction du HTML :

source: …see &lt;a href="#ch03"&gt;Chapter 3: The Secret to Eternal Life&lt;/a&gt; for details.
fr_fr: &hellip;see &lt;a href="#ch03"&gt;Chapter 3: The Secret to Eternal Life&lt;/a&gt; for details.

source: More important, however, are the translation problems that <tag>&lt;xreflabel&gt;</tag> tags cause. Attribute values are not seen by translators. Consequently, they are not translated. Consider the second example above again:
fr_fr: Mais, les problèmes posés par <sgmltag>&lt;xreflabel&gt;</sgmltag> lors de la traduction sont encore plus importants. Les valeurs des attributs en sont pas vues par les traducteurs. Donc, ils ne sont pas traduits. Reprenons le deuxième exemple ci-dessus :

source: &lt;chapter id="ch03" xreflabel="The Secret to Eternal Life"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is…&lt;/para&gt; &lt;/chapter&gt; [more deathless prose here] …see &lt;xref linkend="ch03"&gt; for details.
fr_fr: &lt;chapter id="ch03" xreflabel="The Secret to Eternal Life"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;para&gt;The secret to eternal life is&hellip;&lt;/para&gt; &lt;/chapter&gt; [autre prose pour l'éternité ici] &hellip;see &lt;xref linkend="ch03"&gt; for details.

source: In English, the <tag>&lt;xref&gt;</tag> is still transformed into an anchor tag as follows:
fr_fr: En anglais, <sgmltag>&lt;xref&gt;</sgmltag> est toujours transformé en une balise d'ancrage ainsi :

source: Someone reading the German version, however, will have this as their underlying HTML:
fr_fr: Mais, quelqu'un lisant la version en allemand, verra ceci comme HTML sous-jacent :

source: …Sehen Sie &lt;a href="#ch03"&gt;The Secret to Eternal Life&lt;/a&gt; für Details.
fr_fr: &hellip;Sehen Sie &lt;a href="#ch03"&gt;The Secret to Eternal Life&lt;/a&gt; für Details.

source: If the <tag>&lt;xreflabel&gt;</tag> attribute is not used, the title and chapter indicator, both properly translated, appear to the reader. That is, the following:
fr_fr: Si l'attribut <sgmltag>&lt;xreflabel&gt;</sgmltag> n'est pas utilisé, l'indication du titre et du chapitre, tous deux correctement traduits, sont visibles au lecteur. Ainsi :

source: will, after translation, present thus to a German-speaking reader:
fr_fr: se présentera, après traduction, à un locuteur allemand :

source: …Sehen Sie &lt;a href="#ch03"&gt;Kapitel 3: Das Geheimnis des ewigen Lebens&lt;/a&gt; für Details.
fr_fr: &hellip;Sehen Sie &lt;a href="#ch03"&gt;Kapitel 3: Das Geheimnis des ewigen Lebens&lt;/a&gt; für Details.

source: This is, not surprisingly, what we want.
fr_fr: Qui est, sans surprise, ce que nous souhaitons.

source: The <parameter>xreflabel</parameter> attribute is therefore discouraged.
fr_fr: Pour ces motifs, l'attribut <parameter>xreflabel</parameter> est rejeté.

source: <tag>&lt;[element] endterm="[any_string_here]"&gt;</tag>
fr_fr: <sgmltag>&lt;[element] endterm="[chaîne_quelconque_ici]"&gt;</sgmltag>

source: The <parameter>endterm</parameter> attribute allows you to present hyperlinked text other than the name of the section or chapter to which the hyperlink points. As such, it decreases the usability of printed versions of documents, and causes difficulty for translators.
fr_fr: L'attribut <parameter>endterm</parameter> vous permet de présenter un texte d'hyperlien autre que le nom du paragraphe ou du chapitre sur lequel le lien pointe. Donc, son utilité dans les versions imprimées est restreinte, et elle pose des problèmes aux traducteurs.

source: The text presented in an element (such as an <tag>&lt;xref&gt;</tag>) that contains the <parameter>endterm</parameter> attribute is taken from a <tag>&lt;titleabbrev&gt;</tag> tag in the target chapter or section. Although the content of the <tag>&lt;titleabbrev&gt;</tag> tag is available to translators in the document's PO files, it is removed from the context of the <tag>&lt;xref&gt;</tag>. The absence of this context makes reliable translation impossible in languages that mark prepositions or articles for grammatical number and grammatical gender.
fr_fr: Le texte, présenté dans un élément (comme une balise <sgmltag>&lt;xref&gt;</sgmltag>) contenant l'attribut <parameter>endterm</parameter>, est pris d'une balise <sgmltag>&lt;titleabbrev&gt;</sgmltag> du chapitre ou du paragraphe cible. Même si le contenu de la balise <sgmltag>&lt;titleabbrev&gt;</sgmltag> est à disposition des traducteurs dans les fichiers PO du document, ce contenu est sorti du contexte de <sgmltag>&lt;xref&gt;</sgmltag>. Cette absence de contexte peut rendre une traduction fiable impossible dans des langues qui marquent grammaticalement les prépositions ou les articles en nombre et en genre.

source: &lt;chapter id="The_Secret"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;titleabbrev id="final"&gt;the final chapter&lt;/titleabbrev&gt; &lt;para&gt;The secret to eternal life is…&lt;/para&gt; &lt;/chapter&gt; [more deathless prose here] The solution is in &lt;xref linkend="The_Secret" endterm="final"/&gt;.
fr_fr: &lt;chapter id="The_Secret"&gt; &lt;title&gt;The Secret to Eternal Life&lt;/title&gt; &lt;titleabbrev id="final"&gt;the final chapter&lt;/titleabbrev&gt; &lt;para&gt;The secret to eternal life is&hellip;&lt;/para&gt; &lt;/chapter&gt; [autre prose pour l'éternité ici] The solution is in &lt;xref linkend="The_Secret" endterm="final"/&gt;.

source: The text surrounding the <tag>&lt;xref&gt;</tag> presents in the English version of the document as:
fr_fr: Le texte autour de <sgmltag>&lt;xref&gt;</sgmltag> se présente ainsi dans la version anglaise :

source: A translator sees the <tag>&lt;titleabbrev&gt;</tag> in a PO file as:
fr_fr: Un traducteur voit <sgmltag>&lt;titleabbrev&gt;</sgmltag> dans un fichier PO ainsi :

source: and sees the text that contains the <tag>&lt;xref&gt;</tag> elsewhere in the PO file (or, more likely, in a completely different PO file) as:
fr_fr: et voit le texte contenant la balise <sgmltag>&lt;xref&gt;</sgmltag> ailleurs dans le fichier PO (ou, plus vraisemblablement, dans un fichier PO différent) sous la forme :

source: The translator has no way of telling what will be substituted for <tag>&lt;xref linkend="The_Secret" endterm="final"/&gt;</tag> when the document builds, so a translation in Italian might read:
fr_fr: Le traducteur n'a pas le moyen de savoir ce qui sera substitué à <sgmltag>&lt;xref linkend="The_Secret" endterm="final"/&gt;</sgmltag> lors de la construction du document ; ainsi, une traduction en italien pourra s'écrire :

source: Note the preposition <literal>in</literal>.
fr_fr: Notez la préposition <literal>in</literal>.

source: If the translator rendered <literal>the final chapter</literal> in Italian as <literal>l'ultimo capitolo</literal>, the result when the document builds will read:
fr_fr: Si le traducteur a rendu en italien <literal>the final chapter</literal> par <literal>l'ultimo capitolo</literal>, le résultat à la construction du document sera :

source: This result is comprehensible, but inelegant, because Italian combines some of its prepositions with its definite articles. More elegant Italian would be:
fr_fr: Ce résultat reste compréhensible, mais est inélégant, parce que l'italien combine certaines de ses prépositions avec l'article défini. Un italien plus élégant formulerait :

source: Without knowing what text will appear in place of &lt;xref linkend="The_Secret" endterm="final"/&gt;, the translator into Italian cannot know whether to leave the preposition <literal>in</literal> to stand by itself, or which of seven different possible combinations with the definite article to use: <literal>nel</literal>, <literal>nei</literal>, <literal>nello</literal>, <literal>nell'</literal>, <literal>negli</literal>, <literal>nella</literal>, or <literal>nelle</literal>.
fr_fr: Sans connaître le texte qui apparaît à la place de &lt;xref linkend="The_Secret" endterm="final"/&gt;, le traducteur en italien ne peut pas savoir s'il doit laisser la préposition <literal>in</literal> en l'état ou laquelle des sept combinaisons possibles avec l'article défini utiliser : <literal>nel</literal>, <literal>nei</literal>, <literal>nello</literal>, <literal>nell'</literal>, <literal>negli</literal>, <literal>nella</literal> ou <literal>nelle</literal>.

source: Furthermore, note that the combined preposition and article also poses a problem with regard to whether this word should be placed in the text surrounding the <tag>&lt;xref&gt;</tag>, or in the <tag>&lt;titleabbrev&gt;</tag>. Whichever of these two solutions the translator selects will cause problems when the <parameter>endterm</parameter> appears in other grammatical contexts, because not all Italian prepositions can combine with the definite article in this way.
fr_fr: En plus, notez que la préposition combinée et l'article pose aussi le problème de savoir si le mot doit être placé dans le texte autour de <sgmltag>&lt;xref&gt;</sgmltag> ou dans le <sgmltag>&lt;titleabbrev&gt;</sgmltag>. Quelle que soit la solution retenue, elle posera des problèmes quand <parameter>endterm</parameter> apparaîtra dans un contexte grammatical différent, car toutes les propositions de la langue italienne ne se combinent pas avec l'article défini de cette façon.

source: Due to the problems that <parameter>endterm</parameter> presents for translation, <application>Publican</application> discourages this attribute.
fr_fr: Compte tenu des problèmes que <parameter>endterm</parameter> présente pour la traduction, <application>Publican</application> rejette cet attribut.
