Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: The document ID is used internally and is not displayed to readers when the book is built. If you run the <prompt>$</prompt> <command>publican clean_ids</command> command, any manually entered ID, including this one, changes to a <replaceable>Doc_Name-Title</replaceable> format, where <replaceable>Title</replaceable> is the title of the associated book, article, section, or chapter.
cs_cz: ID dokumentu se využívá interně a čtenářům zůstává skryto při sestavování knihy. Spustíte-li příkaz <prompt>$</prompt> <command>publican clean_ids</command>, kterékoliv ručně vložené ID, včetně tohoto jednoho, se změní na formát <replaceable>Nazev_Dok-Title</replaceable>, kde <replaceable>Title</replaceable> je název související knihy, článku, oddílu nebo kapitoly.
fr_fr: L'identifiant du document est utilisé en interne et n'apparaît pas au lecteur une fois l'ouvrage construit. Si vous lancez la commande <prompt>$</prompt> <command>publican clean_ids</command>, tout identifiant entré manuellement, y compris celui-ci, modifie le format en <replaceable>Document_Nom-Titre</replaceable>, où <replaceable>Titre</replaceable> est le titre du l'ouvrage, de l'article, de la partie ou du chapitre associé.

source: <tag>&lt;productname&gt;<replaceable>productname</replaceable>&lt;/productname&gt;</tag>
cs_cz: <sgmltag>&lt;productname&gt;<replaceable>nazevproduktu</replaceable>&lt;/productname&gt;</sgmltag>
fr_fr: <sgmltag>&lt;productname&gt;<replaceable>nom_produit</replaceable>&lt;/productname&gt;</sgmltag>

source: The name of the product or product stream to which the book, article, or set applies, for example: <literal>Red Hat Enterprise Linux</literal> or <literal>JBoss Enterprise Application Platform</literal>. When building a book as an RPM package, data in the <tag>&lt;productname&gt;</tag> tag is used as part of the file name of the package.
cs_cz: Název produktu nebo produktové řady, ke kterému se kniha, článek nebo sada vztahuje, na příklad: <literal>Red Hat Enterprise Linux</literal> nebo <literal>JBoss Enterprise Application Platform</literal>. Při sestavování knihy do balíčku RPM je údaj v tagu <sgmltag>&lt;productname&gt;</sgmltag> použit jako součást názvu soboru balíčku.
fr_fr: le nom du produit ou de l'ensemble de produits auquel l'ouvrage, l'article ou l'ensemble s'applique ; par exemple : <literal>Red Hat Enterprise Linux</literal> ou <literal>JBoss Enterprise Application Platform</literal>. Lors de la construction d'un ouvrage sous forme de paquet RPM, les données de la balise <sgmltag>&lt;productname&gt;</sgmltag> sont partiellement utilisées pour former le nom du paquet.

source: Override this tag with the <parameter>product</parameter> variable in the <filename>publican.cfg</filename> file if the name of your product contains non-Latin characters, accented Latin characters, or punctuation marks other than the underscore.
cs_cz: Obsahuje-li váš produkt nelatinské znaky, latinské znaky s diakritikou nebo interpunkční znaménka jiná než podtržítko, potlačte tento tag proměnnou <parameter>product</parameter> v souboru <filename>publican.cfg</filename>.
fr_fr: Surchargez la valeur de cette balise avec la variable <parameter>product</parameter> du fichier <filename>publican.cfg</filename> si le nom du produit contient des caractères non latins, des caractères latins accentués ou des signes de ponctuation autres que le souligné.

source: <tag>&lt;title&gt;<replaceable>title</replaceable>&lt;/title&gt;</tag>
cs_cz: <sgmltag>&lt;title&gt;<replaceable>nazev</replaceable>&lt;/title&gt;</sgmltag>
fr_fr: <sgmltag>&lt;title&gt;<replaceable>titre</replaceable>&lt;/title&gt;</sgmltag>

source: The title of the document (for example, <tag>&lt;title&gt;Server Configuration Guide&lt;/title&gt;</tag>). The title appears under the product name in both HTML and PDF editions. A title is required to build an RPM package. When building a book as an RPM package the title is used as the part of the file name of the package.
cs_cz: Název dokumentu (na příklad <sgmltag>&lt;title&gt;Server Configuration Guide&lt;/title&gt;</sgmltag>). Název se zobrazuje pod názvem produktu jak ve vydáních HTML, tak PDF. Název se vyžaduje, jinak nelze sestavit balíček RPM. Název je při sestavování knihy do balíčku RPM použit jako část názvu souboru balíčku.
fr_fr: le titre du document (par exemple, <sgmltag>&lt;title&gt;Server Configuration Guide&lt;/title&gt;</sgmltag>). Le titre apparaît sous le nom du produit tant dans les éditions HTML que PDF. La définition du titre est obligatoire pour construire un paquet RPM, car, en construisant un ouvrage sous forme de paquet RPM, le titre est partiellement utilisé dans le nom du paquet.

source: The names of RPM packages can only contain certain basic ASCII characters. If the title of your document contains non-Latin characters, accented Latin characters, or punctuation marks other than the underscore, use the <parameter>docname</parameter> parameter in the <filename>publican.cfg</filename> file to set a name for the document in ASCII characters. When you build the document, the title appears as you set it with the <tag>&lt;title&gt;</tag> tag, but when you package the document, the value that you used in the <parameter>docname</parameter> parameter is used in the file name of the RPM package.
cs_cz: Názvy balíčků RPM mohou obsahovat pouze určité základní znaky ASCII. Obsahuje-li název dokumentu nelatinské znaky, latinské znaky s diakritikou nebo interpunkční znaménka jiná než podtržítko, použijte parametr <parameter>docname</parameter> v souboru <filename>publican.cfg</filename> k nastavení názvu dokumentu ve znacích ASCII. Při sestavení dokumentu se název zobrazí tak, jak jste ho nastavili s tagem <sgmltag>&lt;title&gt;</sgmltag>, ale pokud dokument balíte, je pro název souboru balíčku RPM použita hodnota parametru <parameter>docname</parameter>.
fr_fr: Les noms des paquets RPM ne peuvent comporter que certains caractères ASCII de base. Si le titre du document contient des caractères non-latins, des caractères accentués ou des marques de ponctuation autres que le souligné, servez-vous du paramètre <parameter>docname</parameter> du fichier <filename>publican.cfg</filename> pour donner un nom au document en caractères ASCII. Quand vous construisez le document, le titre apparaît tel qu'indiqué avec la balise <sgmltag>&lt;title&gt;</sgmltag>, mais quand vous l'empaquetez, la valeur du paramètre <parameter>docname</parameter> est utilisée dans le nom de fichier du paquet RPM.

source: By default, <application>Publican</application> also uses the contents of the <tag>&lt;title&gt;</tag> tag to find the file that contains the root XML node: <tag>&lt;article&gt;</tag>, <tag>&lt;book&gt;</tag>, or <tag>&lt;set&gt;</tag>. For example, if you set the title to <tag>&lt;title&gt;Server Configuration Guide&lt;/title&gt;</tag>, <application>Publican</application> expects the root XML node to be in a file named <filename>Server_Configuration_Guide.xml</filename> and the document entities to be in a file named <filename>Server_Configuration_Guide.ent</filename>. To use a different name for these files, set the <parameter>mainfile</parameter> parameter in the document configuration file (by default, <filename>publican.cfg</filename>). Refer to <xref linkend="sect-Publican-Users_Guide-Files_in_the_book_directory-The_publican.cfg_file" />.
cs_cz: Ve výchozím nastavení používá <application>Publican</application> obsah z tagu <sgmltag>&lt;title&gt;</sgmltag> také k nalezení souboru, kde se nachází kořenový uzel XML: <sgmltag>&lt;article&gt;</sgmltag>, <sgmltag>&lt;book&gt;</sgmltag> nebo <sgmltag>&lt;set&gt;</sgmltag>. Na příklad nastavíte-li název na <sgmltag>&lt;title&gt;Server Configuration Guide&lt;/title&gt;</sgmltag>, <application>Publican</application> očekává kořenový uzel XML v souboru nazvaném <filename>Server_Configuration_Guide.xml</filename> a entity dokumentu v souboru <filename>Server_Configuration_Guide.ent</filename>. Chcete-li použít jiný název těchto souborů, nastavte v konfiguračním souboru dokumentu parametr <parameter>mainfile</parameter> (ve výchozím nastavení se jedná o <filename>publican.cfg</filename>). Viz <xref linkend="sect-Publican-Users_Guide-Files_in_the_book_directory-The_publican.cfg_file" />.
fr_fr: Par défaut, <application>Publican</application> utilise également le contenu de la balise <sgmltag>&lt;title&gt;</sgmltag> pour retrouver le fichier qui contient le nœud racine XML : <sgmltag>&lt;article&gt;</sgmltag>, <sgmltag>&lt;book&gt;</sgmltag> ou <sgmltag>&lt;set&gt;</sgmltag>. Par exemple, si vous avez donné comme titre <sgmltag>&lt;title&gt;Guide de configuration serveur&lt;/title&gt;</sgmltag>, <application>Publican</application> s'attend à ce que le nœud racine XML soit dans un fichier nommé <filename>Guide_de_configuration_serveur.xml</filename> et les entités du document dans <filename>Guide_de_configuration_serveur.ent</filename>. Si vous voulez utiliser un nom différent pour ces fichiers, définissez le paramètre <parameter>mainfile</parameter> dans le fichier de configuration du document (par défaut, <filename>publican.cfg</filename>). Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Files_in_the_book_directory-The_publican.cfg_file" />.

source: <tag>&lt;subtitle&gt;<replaceable>subtitle</replaceable>&lt;/subtitle&gt;</tag>
cs_cz: <sgmltag>&lt;subtitle&gt;<replaceable>podtitul</replaceable>&lt;/subtitle&gt;</sgmltag>
fr_fr: <sgmltag>&lt;subtitle&gt;<replaceable>sous-titre</replaceable>&lt;/subtitle&gt;</sgmltag>

source: The book's subtitle: an alternative, and commonly explanatory title for the book (for example: <emphasis>Server Configuration Guide: Preparing Red Hat Enterprise Linux for Production Use</emphasis>). The subtitle appears under the title in both HTML and PDF editions. A subtitle is also required to make a book available as an RPM package. When building a book as an RPM package, the subtitle is used as the <parameter>Summary</parameter> in the RPM spec file. The <command>rpm -qi</command> command returns the contents of several spec file fields, including the <computeroutput>Summary</computeroutput> field.
cs_cz: Podtitul knihy: alternativní a obecně popisný název knihy (na příklad: <emphasis>Server Configuration Guide: Preparing Red Hat Enterprise Linux for Production Use</emphasis>). Podtitul se zobrazuje pod názvem jak ve vydáních HTML, tak PDF. Podtitul se také vyžaduje pro vytvoření balíčku RPM z knihy. Při sestavování knihy do balíčku RPM se použije podtitul jako <parameter>Summary</parameter> v souboru spec RPM. Příkaz <command>rpm -qi</command> vrací obsah několika polí souboru spec, včetně pole <computeroutput>Summary</computeroutput>.
fr_fr: le sous-titre de l'ouvrage : un autre intitulé, généralement plus explicite quant au contenu de l'ouvrage (par exemple : <emphasis>Guide de configuration serveur : préparation pour une utilisation de Red Hat Enterprise Linux en production</emphasis>). Le sous-titre apparaît sous le titre tant dans l'édition HTML que PDF. Un sous-titre est également obligatoire pour qu'un ouvrage soit disponible sous forme de paquet RPM, le sous-titre est utilisé comme valeur de la directive <parameter>Summary</parameter> dans le fichier spec RPM. La commande <command>rpm -qi</command> renvoie le contenu de plusieurs champs du fichier spec, dont celui de <computeroutput>Summary</computeroutput>.

source: <tag>&lt;productnumber&gt;<replaceable>productnumber</replaceable>&lt;/productnumber&gt;</tag>
cs_cz: <sgmltag>&lt;productnumber&gt;<replaceable>cisloproduktu</replaceable>&lt;/productnumber&gt;</sgmltag>
fr_fr: <sgmltag>&lt;productnumber&gt;<replaceable>numéro_produit</replaceable>&lt;/productnumber&gt;</sgmltag>

source: The version number of the product the book covers, for example ‘5.2’ for Red Hat Enterprise Linux 5.2 and ‘4.3’ for JBoss EAP 4.3.
cs_cz: Číslo verze produktu, o němž pojednává kniha, na příklad &lsquo;5.2&rsquo; pro Red Hat Enterprise Linux 5.2 a &lsquo;4.3&rsquo; pro JBoss EAP 4.3.
fr_fr: le numéro de la version du produit traité par l'ouvrage, par exemple &lsquo;5.2&rsquo; pour Red Hat Enterprise Linux 5.2 et &lsquo;4.3&rsquo; pour JBoss EAP 4.3.

source: Running the <prompt>$</prompt> <command>publican create --name <replaceable>Doc_Name</replaceable> --version <replaceable>version</replaceable></command> command correctly configures the product number.
cs_cz: Spuštění příkazu <prompt>$</prompt> <command>publican create --name <replaceable>Nazev_Dok</replaceable> --version <replaceable>verze</replaceable></command> nastaví správné číslo produktu.
fr_fr: Le lancement de la commande <prompt>$</prompt> <command>publican create --name <replaceable>Nom_document</replaceable> --version <replaceable>version</replaceable></command> configure correctement le numéro du produit.

source: Override this tag with the <parameter>version</parameter> variable in the <filename>publican.cfg</filename> file if the product version is anything other than a number.
cs_cz: Potlačte tento tag proměnnou <parameter>version</parameter> v souboru <filename>publican.cfg</filename>, je-li verze produktu cokoliv jiného než číslo.
fr_fr: Si la version du produit est quelque chose d'autre qu'un nombre, surchargez la valeur de cette balise avec celle de la variable <parameter>version</parameter> dans le fichier <filename>publican.cfg</filename>.

source: <tag>&lt;edition&gt;<replaceable>edition</replaceable>&lt;/edition&gt;</tag>
cs_cz: <sgmltag>&lt;edition&gt;<replaceable>vydani</replaceable>&lt;/edition&gt;</sgmltag>
fr_fr: <sgmltag>&lt;edition&gt;<replaceable>édition</replaceable>&lt;/edition&gt;</sgmltag>

source: This is the edition number of the book. The first edition of the book should be 1.0 (unless you use 0.<replaceable>x</replaceable> for pre-release versions of a book). Subsequent editions should increment the 1.<replaceable>x</replaceable> to indicate to readers that the book is a new edition. The edition changes the version number in the file name when building a book with the <prompt>$</prompt> <command>publican package</command> command.
cs_cz: Číslo vydání knihy. První vydání knihy by mělo být očíslováno 1.0 (pokud nepoužíváte číslování 0.<replaceable>x</replaceable> pro účely verzí knihy před veřejným vydáním). Následující vydání by měla mít oproti 1.<replaceable>x</replaceable> číslo vyšší, aby měli čtenáři možnost zjistit, že se jedná o nové vydání knihy. Vydání změní číslo verze v názvu souboru, sestavujete-li knihu příkazem <prompt>$</prompt> <command>publican package</command>.
fr_fr: définit le rang d'édition de l'ouvrage. La première édition du l'ouvrage doit être 1.0 (sauf si vous utilisez 0.<replaceable>x</replaceable> comme numéro de version des éditions préparatoires). Les numéros des éditions suivantes s'obtiendront en incrémentant 1.<replaceable>x</replaceable>, numéro de la version précédente pour indiquer aux lecteurs qu'il s'agit d'une nouvelle édition de l'ouvrage. L'édition modifie le numéro de version dans le nom du fichier quand on construit un ouvrage avec la commande <prompt>$</prompt> <command>publican package</command>.

source: For example, setting the edition to <filename>1.2</filename> and building the book using the <prompt>$</prompt> <command>publican package --binary --lang=en-US</command> command creates an RPM file named <filename><replaceable>productname</replaceable>-<replaceable>title</replaceable>-<replaceable>productnumber</replaceable>-en-US-1.2-0.src.rpm</filename>.
cs_cz: Na příklad nastavení vydání na <filename>1.2</filename> a sestavení knihy pomocí příkazu <prompt>$</prompt> <command>publican package --binary --lang=en-US</command> vytvoří soubor RPM s názvem <filename><replaceable>nazevproduktu</replaceable>-<replaceable>nazev</replaceable>-<replaceable>cisloproduktu</replaceable>-en-US-1.2-0.src.rpm</filename>.
fr_fr: Par exemple, le fait de définir un numéro d'édition égal à <filename>1.2</filename> et de construire l'ouvrage avec la commande <prompt>$</prompt> <command>publican package --binary --lang=en-US</command> crée un fichier RPM nommé <filename><replaceable>nom_produit</replaceable>-<replaceable>titre</replaceable>-<replaceable>numéro_produit</replaceable>-en-US-1.2-0.src.rpm</filename>.

source: Running the <prompt>$</prompt> <command>publican create --name<replaceable> Doc_Name</replaceable> --edition <replaceable>x</replaceable>.<replaceable>y</replaceable></command> command correctly configures the edition.
cs_cz: Spuštění příkazu <prompt>$</prompt> <command>publican create --name<replaceable> Nazev_Dok</replaceable> --edition <replaceable>x</replaceable>.<replaceable>y</replaceable></command> správně nastaví vydání.
fr_fr: Lancer la commande <prompt>$</prompt> <command>publican create --name<replaceable> Nom_document</replaceable> --edition <replaceable>x</replaceable>.<replaceable>y</replaceable></command> configure correctement le numéro d'édition.

source: Override this tag with the <parameter>edition</parameter> variable in the <filename>publican.cfg</filename> file if the edition of your document is identified by anything other than a number.
cs_cz: Potlačte tento tag proměnnou <parameter>edition</parameter> v souboru <filename>publican.cfg</filename>, je-li vydání vašeho dokumentu identifikováno čímkoliv jiným než číslem.
fr_fr: Surchargez la valeur de cette balise par celle de la variable <parameter>edition</parameter> du fichier <filename>publican.cfg</filename> si la modification du document est désignée par autre chose qu'un nombre.

source: <tag>&lt;pubsnumber&gt;<replaceable>pubsnumber</replaceable>&lt;/pubsnumber&gt;</tag>
cs_cz: <sgmltag>&lt;pubsnumber&gt;<replaceable>pubsnumber</replaceable>&lt;/pubsnumber&gt;</sgmltag>
fr_fr: <sgmltag>&lt;pubsnumber&gt;<replaceable>pubsnumber</replaceable>&lt;/pubsnumber&gt;</sgmltag>

source: The pubsnumber sets the release number (the last digit in the file name) when building a book with the <prompt>$</prompt> <command>publican package</command> command. For example, setting the pubsnumber to <literal>1</literal> and building the book using the <command>publican package --binary --lang=en-US</command> command creates an RPM file named <filename><replaceable>productname</replaceable>-<replaceable>title</replaceable>-<replaceable>productnumber</replaceable>-en-US-<replaceable>edition</replaceable>-1.src.rpm</filename>.
cs_cz: pubsnumber nastaví číslo vydání (release) (poslední číslici v názvu souboru) při sestavení knihy příkazem <prompt>$</prompt> <command>publican package</command>. Na příklad nastavení pubsnumber na <literal>1</literal> a sestavení knihy použitím příkazu <command>publican package --binary --lang=en-US</command> vytvoří soubor RPM s názvem <filename><replaceable>nazevproduktu</replaceable>-<replaceable>nazev</replaceable>-<replaceable>cisloproduktu</replaceable>-en-US-<replaceable>vydani</replaceable>-1.src.rpm</filename>.
fr_fr: « numéro_publication » désigne le numéro d'ordre de la publication (le dernier chiffre dans le nom du fichier) lors de la construction d'un ouvrage avec <prompt>$</prompt> <command>publican package</command>. Par exemple, le fait de définir « numéro_publication » égal à <literal>1</literal> et de construire l'ouvrage avec la commande <command>publican package --binary --lang=en-US</command> crée un fichier RPM nommé <filename><replaceable>nom_produit</replaceable>-<replaceable>titre</replaceable>-<replaceable>numéro_produit</replaceable>-en-US-<replaceable>édition</replaceable>-1.src.rpm</filename>.

source: Override this tag with the <parameter>release</parameter> variable in the <filename>publican.cfg</filename> file if the release number of your document contains anything other than whole numbers.
cs_cz: Potlačte tento tag proměnnou <parameter>release</parameter> v souboru <filename>publican.cfg</filename>, obsahuje-li číslo vydání vašeho dokumentu cokoliv jiného než celá čísla.
fr_fr: Surchargez la valeur de cette balise par celle de la variable <parameter>release</parameter> du fichier <filename>publican.cfg</filename> si le numéro de parution du document n'est pas totalement défini à l'aide de chiffres.

source: <tag>&lt;abstract&gt;&lt;para&gt;<replaceable>abstract</replaceable>&lt;/para&gt;&lt;/abstract&gt;</tag>
cs_cz: <sgmltag>&lt;abstract&gt;&lt;para&gt;<replaceable>abstrakt</replaceable>&lt;/para&gt;&lt;/abstract&gt;</sgmltag>
fr_fr: <sgmltag>&lt;abstract&gt;&lt;para&gt;<replaceable>résumé</replaceable>&lt;/para&gt;&lt;/abstract&gt;</sgmltag>

source: A short overview and summary of the book's subject and purpose, traditionally no more than a paragraph long. The abstract appears before the table of contents in HTML editions and on the second page of PDF editions. When a book is built as an RPM package, the abstract sets the <parameter>Description</parameter> field of the RPM's spec file. This makes the abstract for a package available via the <command>rpm -qi</command> command.
cs_cz: Krátký přehled a shrnutí předmětu knihy a jejího účelu, tradičně ne delší než jeden odstavec. Abstrakt se zobrazí před obsahem ve vydáních HTML a na druhé stránce vydáních PDF. Je-li kniha sestavena jako balíček RPM, abstrakt nastaví pole <parameter>Description</parameter> v souboru spec RPM. To způsobí, že abstrakt je pro balíček dostupný pomocí příkazu <command>rpm -qi</command>.
fr_fr: un court aperçu, un résumé du propos de l'ouvrage et ses objectifs, ne dépassant pas en général un paragraphe. Le résumé est placé avant la table des matières dans les éditions HTML et en deuxième page dans le cas du PDF. Quand un ouvrage est construit sous forme de paquet RPM, ce résumé constitue le corps du champ <parameter>Description</parameter> du fichier spec RPM. Le résumé est donc affiché par l'intermédiaire de la commande <command>rpm -qi</command>.

source: You can add extra metadata to the <filename>Book_Info.xml</filename> file of a document, to support specific features in various output formats:
cs_cz: Do souboru <filename>Book_Info.xml</filename> dokumentu lze přidat další metadata, která podpoří zvláštní vlastnosti různých výstupních formátů:
fr_fr: Vous pouvez ajouter des métadonnées dans le fichier <filename>Book_Info.xml</filename> d'un document pour prendre en charge des fonctionnalités particulières dans divers formats de sortie :

source: <tag>&lt;keywordset&gt;</tag>
cs_cz: <sgmltag>&lt;keywordset&gt;</sgmltag>
fr_fr: <sgmltag>&lt;keywordset&gt;</sgmltag>

source: <tag>&lt;keyword&gt;</tag>
cs_cz: <sgmltag>&lt;keyword&gt;</sgmltag>
fr_fr: <sgmltag>&lt;keyword&gt;</sgmltag>

source: Terms tagged with <tag>&lt;keyword&gt;</tag> and placed within a <tag>&lt;keywordset&gt;</tag> are added to a <tag>&lt;meta name="keywords"&gt;</tag> entry in the head of HTML files and to the <literal>Keywords</literal> field of the properties of a PDF document.
cs_cz: Termíny označené tagem <sgmltag>&lt;keyword&gt;</sgmltag> a umístěné uvnitř <sgmltag>&lt;keywordset&gt;</sgmltag> jsou přidány do pole <sgmltag>&lt;meta name="keywords"&gt;</sgmltag> v hlavičce souborů HTML a pole <literal>Keywords</literal> vlastností dokumentu PDF.
fr_fr: Les termes à la suite de la balise <sgmltag>&lt;keyword&gt;</sgmltag>, placés dans un <sgmltag>&lt;keywordset&gt;</sgmltag>, sont ajoutés à une entrée <sgmltag>&lt;meta name="keywords"&gt;</sgmltag> dans l'en-tête des fichiers HTML et dans le champ <literal>Keywords</literal> des propriétés pour un document PDF.

source: <tag>&lt;subjectset&gt;</tag>
cs_cz: <sgmltag>&lt;subjectset&gt;</sgmltag>
fr_fr: <sgmltag>&lt;subjectset&gt;</sgmltag>

source: <tag>&lt;subject&gt;</tag>
cs_cz: <sgmltag>&lt;subject&gt;</sgmltag>
fr_fr: <sgmltag>&lt;subject&gt;</sgmltag>
