Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: allows a site to override the template used when building the embedded toc using in web_style=1 sites. The template must be in the same directory that <filename>toc.tmpl</filename> is in. The template name must be must be of the form <replaceable>toc_type+.tmpl</replaceable>
cs_cz: umožňuje stránce potlačit šablonu využívanou pro stránky web_style=1 použitou při sestavování vestavěného obsahu. Šablona se musí nacházet ve stejném adresáři jako se nachází <filename>toc.tmpl</filename>. Název šablony musí mít formát <replaceable>toc_typ+.tmpl</replaceable>
fr_fr: autorise un site à écraser le modèle utilisé lors de la construction de la table des matières incorporée en utilisant le style=1 dans les sites Web. Le modèle doit se trouver dans le même répertoire que <filename>toc.tmpl</filename>. Le nom du modèle doit être de la forme <replaceable>toc_type+.tmpl</replaceable>.

source: specifies the name of a custom TOC template. By default, <application>Publican</application> looks for <filename>toc-<replaceable>$toc_type</replaceable>.tmpl</filename> in <filename>/usr/share/publican/templates</filename>. You can override this by setting an alternative path with <filename>tmpl_path</filename>.
cs_cz: uvádí název vlastní šablony pro obsah. Ve výchozím nastavení hledá <application>Publican</application> <filename>toc-<replaceable>$toc_type</replaceable>.tmpl</filename> v <filename>/usr/share/publican/templates</filename>. Toto nastavení lze potlačit zadáním alternativní cesty v <filename>tmpl_path</filename>.
fr_fr: définit le nom d'un modèle personnalisé de table des matières. Par défaut, <application>Publican</application> recherche un fichier <filename>toc-<replaceable>$toc_type</replaceable>.tmpl</filename> dans <filename>/usr/share/publican/templates</filename>. Vous pouvez modifier ce réglage en indiquant un autre chemin avec <filename>tmpl_path</filename>.

source: controls the depth of sections that <application>Publican</application> includes in the main table of contents. By default, this value is set to <literal>2</literal>. With the default setting, sections 1.1 and 1.1.1 will appear in the main table of contents, but section 1.1.1.1 will not. (Note that the first digit in these examples represents a chapter, not a section).
cs_cz: řídí hloubku oddílů, kterou <application>Publican</application> zahrne do hlavního obsahu. Ve výchozím nastavení je hodnota nastavena na <literal>2</literal>. S tímto výchozím nastavením se oddíly 1.1 a 1.1.1 zobrazí v hlavním obsahu, ale oddíl 1.1.1.1 již ne. (Všimněte si, že první číslo v tomto příkladu představuje kapitolu nikoliv oddíl.)
fr_fr: contrôle la profondeur de subdivision employée par <application>Publican</application> dans la table des matières principale. Par défaut, cette valeur est fixée à <literal>2</literal>. Avec ce réglage par défaut, les sections 1.1 et 1.1.1 seront mentionnées dans la table des matières principale, mais la section 1.1.1.1 n'y sera pas (notez que le premier chiffre de cet exemple représente un chapitre, et non un paragraphe).

source: Controlling the depth of sections in the main table of contents
cs_cz: Řízení hloubky oddílů v hlavním obsahu
fr_fr: Contrôle de la profondeur des subdivisions dans la table des matières principale

source: <application>Publican</application> will generate a main table of contents only for chapters.
cs_cz: <application>Publican</application> vygeneruje hlavní obsah pouze z kapitol.
fr_fr: <application>Publican</application> crée une table des matières principale ne comportant que les chapitres.

source: <application>Publican</application> will generate a main table of contents only for chapters and "level 1" sections, such as 1, 1.1, 1.2, 1.3 … 9, 9.1, 9.2 … but not for sections 1.1.1, 1.1.2 …
cs_cz: <application>Publican</application> vygeneruje hlavní obsah pouze z kapitol a oddílů "úroveň 1", jako např. 1, 1.1, 1.2, 1.3 &hellip;, ale ne pro oddíly 1.1.1, 1.1.2 &hellip;
fr_fr: <application>Publican</application> crée une table des matières principale ne comportant que les chapitres et les sections de « niveau 1 », comme 1, 1.1, 1.2, 1.3 &hellip; 9, 9.1, 9.2 &hellip; sans mentionner les sections 1.1.1, 1.1.2 &hellip;

source: toc_section_depth: 2 (default)
cs_cz: toc_section_depth: 2 (výchozí)
fr_fr: toc_section_depth: 2 (défaut)

source: <application>Publican</application> will generate tables of contents for chapters and "level 1 and "level 2" sections, such as 1, 1.1, 1.1.1, … 1,2, 1.2.1, 1.2.2 … but not for deeper sections x.x.x.x .
cs_cz: <application>Publican</application> vygeneruje obsah z kapitol a oddílů "úroveň 1" a "úroveň 2", jako např. 1, 1.1, 1.1.1, &hellip; 1,2, 1.2.1, 1.2.2 &hellip;, nikoliv však pro oddíly umístěné hlouběji x.x.x.x.
fr_fr: <application>Publican</application> crée une table des matières principale contenant les chapitres et les sections de « niveau 1 » et de « niveau 2 », comme 1, 1.1, 1.1.1, &hellip; 1.2, 1.2.1, 1.2.2 &hellip; mais ne mentionne pas les sections de niveau supérieur.

source: specifies the version number of that product to which this document applies. If set, this value overrides the content of the <tag>&lt;productnumber&gt;</tag> tag in the <filename>Book_Info.xml</filename> file when you package a document. This value must include only digits and the period (‘0’–‘9’ and ‘.’).
cs_cz: uvádí číslo verze produktu, na který se vztahuje tento dokument. Je-li nastavena, hodnota při balení dokumentu potlačuje obsah tagu <sgmltag>&lt;productnumber&gt;</sgmltag> v souboru <filename>Book_Info.xml</filename>. Hodnota musí obsahovat pouze číslice a tečky (&lsquo;0&rsquo;&ndash;&lsquo;9&rsquo; and &lsquo;.&rsquo;).
fr_fr: définit le numéro de version du produit objet du document. Si indiquée, cette valeur prend le pas sur le contenu de la balise <sgmltag>&lt;productnumber&gt;</sgmltag> du fichier <filename>Book_Info.xml</filename> lors de l'empaquetage du document. Cette valeur ne doit comporter que des chiffres et le point (&lsquo;0&rsquo;&ndash;&lsquo;9&rsquo; et &lsquo;.&rsquo;).

source: specifies the <application>brew</application> build target to use for building the web RPM packages. <application>Brew</application> is the internal build system used by Red Hat. By default, this value is set to <literal>docs-5E</literal>, representing documentation packages for Red Hat Enterprise Linux 5. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
cs_cz: uvádí cíl sestavení <application>brew</application>, který se má použít pro sestavení webových balíčků RPM. <application>Brew</application> je interní sestavovací systém používaný společností Red Hat. Ve výchozím nastavení je tato hodnota nastavena na <literal>docs-5E</literal>, představuje dokumentační balíčky pro Red Hat Enterprise Linux 5.
fr_fr: indique d'utiliser <application>brew</application> comme cible de construction pour les paquets Web RPM. <application>Brew</application> est le système de construction utilisé en interne par Red Hat. Par défaut, cette valeur est <literal>docs-5E</literal>, représentant les paquets documentaires pour Red Hat Enterprise Linux 5. Voyez la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.

source: a comma-separated list of formats to include in the web RPM package. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" />.
cs_cz: čárkou oddělený seznam formátů, které se mají zahrnout do webového balíčku RPM. Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" />.
fr_fr: une liste, avec la virgule comme séparateur, des formats à inclure dans le paquet Web RPM. Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" />.

source: specifies that the document is the home page of a documentation website, not a standard document. Refer to <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
cs_cz: konkretizuje, že dokument je domovská stránka webové stránky dokumentace, nikoliv standardní dokument. Viz <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
fr_fr: indique que le document est la page d'accueil d'un site Web de documentation, et non un document standard. Voyez la <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.

source: Important — <literal>web_home</literal> is deprecated
cs_cz: Důležité — <literal>web_home</literal> je zastaralý
fr_fr: Important — Abandon de <literal>web_home</literal>

source: In <application>Publican</application> 2.2, <literal>web_home</literal> is replaced by <literal>web_type: home</literal>. Support for <literal>web_home</literal> will be removed in a future version of <application>Publican</application>.
cs_cz: V <application>Publicanu</application>&nbsp;2.2 je <literal>web_home</literal> nahrazen <literal>web_type: home</literal>. Podpora pro <literal>web_home</literal> bude v některé příští verzi <application>Publicanu</application> odstraněna.
fr_fr: Dans <application>Publican</application>&nbsp;2.2, <literal>web_home</literal> a été remplacé par <literal>web_type: home</literal>. La prise en charge de <literal>web_home</literal> sera supprimée dans une future version de <application>Publican</application>.

source: overrides the book name as it appears on the menu of a <application>Publican</application>-managed website. Refer to <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
cs_cz: potlačuje název knihy, který se zobrazuje v nabídce webové stránky řízené <application>Publicanem</application>. Viz <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
fr_fr: remplace le nom de l'ouvrage tel qu'il apparaît dans le menu d'un site web géré par <application>Publican</application>. Voyez la <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.

source: specifies packages that the web RPM obsoletes. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
cs_cz: uvádí balíčky, které webový RPM označí za zastaralé. Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
fr_fr: définit les paquets que le RPM Web a rendu obsolètes. Voyez la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.

source: overrides the product name as it appears on the menu of a <application>Publican</application>-managed website. Refer to <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
cs_cz: potlačuje název produktu, který se zobrazuje v nabídce webové stránky řízené <application>Publicanem</application>. Viz <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
fr_fr: remplace le nom du produit tel qu'il apparaît dans le menu d'un site Web géré par <application>Publican</application>. Voyez la <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.

source: <parameter>web_style</parameter>
fr_fr: <parameter>web_type</parameter>

source: sets the web style, which determines the layout and presentation of the website. Valid values are <literal>1</literal> and <literal>2</literal>. Style 1 features a navigation pane at the left side of the screen that provides access to all of the documents on the site. Style 2 offers a breadcrumb-like navigation system.
cs_cz: nastaví styl webu, který určuje rozvržení a prezentaci webové stránky. Platnými hodnotami jsou <literal>1</literal> a <literal>2</literal>. Styl 1 používá navigační okno po levé straně obrazovky, které poskytuje přístup ke všem dokumentům na webové stránce.
fr_fr: définit le style Web ; il détermine la disposition et la présentation du site. Les valeurs valides sont <literal>1</literal> et <literal>2</literal>. Le style 1 dispose un panneau de navigation sur le côté gauche de l'écran permettant un accès à la totalité des documents du site. Le style 2 offre un système de navigation avec des raccourcis.

source: specifies that the document is descriptive content for a <application>Publican</application>-managed website rather than product documentation. This content includes the home page of the website (<literal>web_type: home</literal>), product description pages (<literal>web_type: product</literal>), and version description pages (<literal>web_type: version</literal>). Refer to <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
cs_cz: konkretizuje, že dokument je pro webovou stránku řízenou <application>Publicanem</application> spíše popisným obsahem než dokumentací produktu. Tento obsah zahrnuje domovskou stránku webové stránky (<literal>web_type:&nbsp;home</literal>), stránky popisující produkt (<literal>web_type:&nbsp;product</literal>) a stránky popisující verzi (<literal>web_type:&nbsp;version</literal>). Viz <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
fr_fr: indique que le document est un descriptif du contenu d'un site Web géré par <application>Publican</application> et non une documentation du produit. Ce contenu comporte la page d'accueil du site (<literal>web_type:&nbsp;home</literal>), des pages décrivant le produit (<literal>web_type:&nbsp;product</literal>) et la version (<literal>web_type:&nbsp;version</literal>). Voyez la <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.

source: overrides the version number as it appears on the menu of a <application>Publican</application>-managed website. Set this value to <literal>UNUSED</literal> for general documentation that does not apply to any particular version of a product. Refer to <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
cs_cz: potlačuje číslo verze, které se zobrazuje v nabídce webové stránky řízené <application>Publicanem</application>. Pro obecnou dokumentaci, k níž se nevztahuje žádná konkrétní verze produktu, nastavte tuto hodnotu na <literal>UNUSED</literal>. Viz <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.
fr_fr: écrase le numéro de version tel qu'il apparaît sur le menu d'un site Web géré par <application>Publican</application>. Fixez cette valeur à <literal>UNUSED</literal> pour un documentation d'ordre général qui ne s'applique pas à une version donnée de produit. Reportez-vous à la <xref linkend="chap-Publican-Users_Guide-Building_a_website_with_Publican" />.

source: Extra options to pass to <application>wkhtmltopdf</application>. e.g. <literal>wkhtmltopdf_opts: "-O landscape -s A3"</literal>
cs_cz: Zvláštní volby předávané <application>wkhtmltopdf</application>. Např. <literal>wkhtmltopdf_opts:&nbsp;"-O&nbsp;landscape&nbsp;-s&nbsp;A3"</literal>
fr_fr: options supplémentaires à passer à l'application <application>wkhtmltopdf</application>. Par exemple, <literal>wkhtmltopdf_opts:&nbsp;"-O&nbsp;landscape&nbsp;-s&nbsp;A3"</literal>.

source: Help from the command line
cs_cz: Nápověda z příkazové řádky
fr_fr: Aide à partir de la ligne de commande

source: Run the <prompt>$</prompt> <command>publican help_config</command> command in the root directory of a book for a summary of these parameters.
cs_cz: Chcete-li získat shrnující informace k těmto parametrům, spusťte v kořenovém adresáři knihy příkaz <prompt>$</prompt> <command>publican help_config</command>.
fr_fr: Lancez la commande <prompt>$</prompt> <command>publican help_config</command> dans le répertoire racine d'un ouvrage pour un résumé à propos de ces paramètres.

source: <filename>Article_Info.xml</filename> and <filename>Set_Info.xml</filename>
cs_cz: <filename>Article_Info.xml</filename> a <filename>Set_Info.xml</filename>
fr_fr: <filename>Article_Info.xml</filename> et <filename>Set_Info.xml</filename>

source: This description of the <filename>Book_Info.xml</filename> file applies to <filename>Article_Info.xml</filename> and <filename>Set_Info.xml</filename> files too. However, for the sake of simplicity, the file is referred to as <filename>Book_Info.xml</filename> throughout this section.
cs_cz: Následující popis souboru <filename>Book_Info.xml</filename> se rovněž vztahuje na soubory <filename>Article_Info.xml</filename> a <filename>Set_Info.xml</filename>. Nicméně v tomto oddílu se z důvodu zjednodušení používá pouze soubor <filename>Book_Info.xml</filename>.
fr_fr: Cette description du fichier <filename>Book_Info.xml</filename> est également applicable aux fichiers <filename>Article_Info.xml</filename> et <filename>Set_Info.xml</filename>. Toutefois, pour simplifier, le fichier <filename>Book_Info.xml</filename> sera dans ce paragraphe l'unique référence pour les trois fichiers.

source: The <filename>Book_Info.xml</filename> file contains the key metadata concerning a book: the book's ID; title; subtitle; author and edition number. It also contains the name and version of the product that is documented, and an abstract.
cs_cz: Soubor <filename>Book_Info.xml</filename> obsahuje klíčová metadata, která se týkají knihy: ID knihy, název, podtitul, autor a číslo vydání. Obsahuje rovněž název a verzi produktu, který dokumentuje, a abstrakt.
fr_fr: Le fichier <filename>Book_Info.xml</filename> contient les méta-données clés relatives à l'ouvrage : l'identifiant, le titre, le sous-titre, l'auteur et le numéro de l'édition. Il contient également le nom et le numéro de version du produit documenté, ainsi qu'un résumé.

source: Aside from constituting much of a book's front matter, this metadata is also used when building books as RPM packages. Usually, if you distribute a book as an RPM package, several of the tags included by default in <filename>Book_Info.xml</filename> must have appropriate data within them, and that data must conform to the requirements of the RPM format. You can override the data in these tags by using equivalent fields in the <filename>publican.cfg</filename> file, as discussed in this section.
cs_cz: Vedle těchto "obálkových" záležitostí jsou metadata také využívána pro sestavování knih do balíčků RPM. Obvykle, pokud šíříte knihu jako balíček RPM, musí mít několik tagů standardně obsažených v <filename>Book_Info.xml</filename> v sobě uvedeny příslušné údaje a tyto údaje musí odpovídat požadavkům formátu RPM. Údaje v těchto tazích lze potlačit použitím rovnocenných polí v souboru <filename>publican.cfg</filename>, diskutovaných v tomto oddílu.
fr_fr: En plus de constituer la majeure partie de la préface de l'ouvrage, ces méta-données sont également utilisées pour le mettre sous forme de paquet RPM. Habituellement, si vous distribuez un ouvrage sous forme de RPM, plusieurs balises incorporées par défaut dans <filename>Book_Info.xml</filename> doivent être associées à des valeurs appropriées ; ces données doivent, en outre, satisfaire les exigences de format du RPM. Vous pouvez surcharger les données relatives à ces balises en utilisant les champs équivalents dans le fichier <filename>publican.cfg</filename>, comme indiqué dans ce paragraphe.

source: Unless overridden in the <filename>publican.cfg</filename> file, data from seven of the default tags in <filename>Book_Info.xml</filename> is required to build books as RPMs. Most immediately, the file name of a book built as an RPM package is constructed as follows:
cs_cz: Nejsou-li potlačeny v souboru <filename>publican.cfg</filename>, vyžadují se k sestavení knihy jako RPM údaje ze sedmi výchozích tagů v <filename>Book_Info.xml</filename>. Velmi stručně je název souboru knihy sestavené jako balíček RPM složen následovně:
fr_fr: Sauf si elles ont été surchargées dans le fichier <filename>publican.cfg</filename>, les données de sept balises de <filename>Book_Info.xml</filename> sont, par défaut, nécessaires pour la construction d'ouvrages sous forme de RPM. Pour commencer, le nom du fichier de construction de l'ouvrage sous forme de RPM est ainsi constitué :

source: <filename><replaceable>productname</replaceable>-<replaceable>title</replaceable>-<replaceable>productnumber</replaceable>-<replaceable>language</replaceable>-<replaceable>edition</replaceable>-<replaceable>pubsnumber</replaceable>.src.rpm</filename>
fr_fr: <filename><replaceable>nom_produit</replaceable>-<replaceable>titre</replaceable>-<replaceable>numéro_produit</replaceable>-<replaceable>langue</replaceable>-<replaceable>édition</replaceable>-<replaceable>numéro_publication</replaceable>.src.rpm</filename>

source: Everything but <replaceable>language</replaceable> above is pulled from <filename>Book_Info.xml</filename> — you specify <replaceable>language</replaceable> when you build the book. As well, the <tag>&lt;subtitle&gt;</tag> and <tag>&lt;abstract&gt;</tag> are used in the RPM spec file, to provide the <parameter>Summary:</parameter> field in the header and the <parameter>%description</parameter> field, respectively.
cs_cz: Vše výše kromě <replaceable>language</replaceable> se získává z <filename>Book_Info.xml</filename> — <replaceable>language</replaceable> uvádíte, když sestavujete knihu. A podobně <sgmltag>&lt;subtitle&gt;</sgmltag> a <sgmltag>&lt;abstract&gt;</sgmltag> se využívají v souboru spec RPM, poskytují pole <parameter>Summary:</parameter> v hlavičce, respektive <parameter>%description</parameter>.
fr_fr: Toutes les données ci-dessus, sauf <replaceable>language</replaceable> sont tirées de <filename>Book_Info.xml</filename> — <replaceable>language</replaceable> est défini dans la ligne de commande de construction de l'ouvrage. De même, <sgmltag>&lt;subtitle&gt;</sgmltag> et <sgmltag>&lt;abstract&gt;</sgmltag> sont utilisés dans le fichier spec du RPM, pour renseigner, respectivement, les champs <parameter>Summary:</parameter> et <parameter>%description</parameter> de l'en-tête.

source: An example <filename>Book_Info.xml</filename> file, for the <literal>Test_Book</literal> book, is presented below. Details regarding this file, and what the RPM format requirements are for each tag, follow.
cs_cz: Ukázkový příklad souboru <filename>Book_Info.xml</filename> pro knihu <literal>Kniha_Test</literal> lze shlédnout níže. Podrobnosti tohoto souboru a jaké požadavky na formát RPM jsou pro každý tag, následují.
fr_fr: Un exemple de fichier <filename>Book_Info.xml</filename>, pour l'ouvrage <literal>Test_Book</literal>, est présenté ci-dessous. Des détails à propos de ce fichier, ainsi que les exigences relatives au format RPM pour chaque balise, suivent.

source: <tag>&lt;bookinfo id="<replaceable>book_id</replaceable>"&gt;</tag>
cs_cz: <sgmltag>&lt;bookinfo id="<replaceable>kniha_id</replaceable>"&gt;</sgmltag>
fr_fr: <sgmltag>&lt;bookinfo id="<replaceable>identifiant_ouvrage</replaceable>"&gt;</sgmltag>

source: <tag>&lt;articleinfo id="<replaceable>article_id</replaceable>"&gt;</tag>
cs_cz: <sgmltag>&lt;articleinfo id="<replaceable>clanek_id</replaceable>"&gt;</sgmltag>
fr_fr: <sgmltag>&lt;articleinfo id="<replaceable>identifiant_article</replaceable>"&gt;</sgmltag>

source: <tag>&lt;setinfo id="<replaceable>set_id</replaceable>"&gt;</tag>
cs_cz: <sgmltag>&lt;setinfo id="<replaceable>sada_id</replaceable>"&gt;</sgmltag>
fr_fr: <sgmltag>&lt;setinfo id="<replaceable>identifiant_ensemble</replaceable>"&gt;</sgmltag>
