Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: The <filename><replaceable>Doc_Name</replaceable>.ent</filename> file is used to define local entities. The <parameter>YEAR</parameter> and <parameter>HOLDER</parameter> entities are used for copyright information. By default, <application>Publican</application> sets <parameter>YEAR</parameter> to the current year, and inserts a message into <parameter>HOLDER</parameter> to remind you to specify the copyright holder for the document. If the <parameter>YEAR</parameter> and <parameter>HOLDER</parameter> entities are missing altogether, the document will not build.
cs_cz: Soubor <filename><replaceable>Nazev_Doc</replaceable>.ent</filename> se využívá pro definici lokálních entit. Entity <parameter>YEAR</parameter> a <parameter>HOLDER</parameter> se využívají pro informace o autorských právech. Ve výchozím nastavení nastaví <application>Publican</application> <parameter>YEAR</parameter> na současný rok a do <parameter>HOLDER</parameter> vloží zprávu, která vám připomene, abyste nezapomněli pro dokument uvést držitele autorských práv. Chybí-li entity <parameter>YEAR</parameter> a <parameter>HOLDER</parameter>, dokument se nesestaví.
fr_fr: Le fichier <filename><replaceable>Nom_document</replaceable>.ent</filename> s'utilise pour définir les entités locales. Les entités <parameter>YEAR</parameter> et <parameter>HOLDER</parameter> sont employées pour les informations de copyright. Par défaut, <application>Publican</application> définit <parameter>YEAR</parameter> au millésime de l'année actuelle et insère un message dans <parameter>HOLDER</parameter> pour vous rappeler de définir le tenant des droits d'auteur du document. Si l'une ou l'autre des entités <parameter>YEAR</parameter> et <parameter>HOLDER</parameter> sont manquantes, le document ne se construit pas.

source: Other entities might be required by the <firstterm>brand</firstterm> applied to your document. For example, the <application>Publican</application> brand for Fedora documents uses the entity <computeroutput>BOOKID</computeroutput> to specify how readers should refer to a document when they submit feedback about it.
cs_cz: Další entity mohou být požadovány <firstterm>grafickou úpravou</firstterm> uplatňovanou na dokument. Na příklad grafická úprava <application>Publicanu</application> pro dokumenty Fedory používá entitu <computeroutput>BOOKID</computeroutput>, která předepisuje, jak by měli čtenáři odkazovat na dokument, když zasílají o něm zpětnou vazbu.
fr_fr: D'autres entités peuvent être nécessaires pour l'<firstterm>estampille</firstterm> du document. Par exemple, l'estampille de <application>Publican</application> pour des documents Fedora utilise l'entité <computeroutput>BOOKID</computeroutput> pour indiquer aux lecteurs comment ils doivent référencer le document s'ils souhaitent des retours à son propos.

source: <xi:include href="extras/Book_Name.ent" parse="text" xmlns:xi="http://www.w3.org/2001/XInclude" />
fr_fr: <xi:include href="extras/Book_Name.xmlt" parse="text" xmlns:xi="http://www.w3.org/2001/XInclude" />

source: The <prompt>$</prompt> <command>publican package</command> command searches for the first XML file in the document's XML directory containing a <literal>&lt;revhistory&gt;</literal> tag. <application>Publican</application> then uses that file to build the RPM revision history.
cs_cz: Příkaz <prompt>$</prompt> <command>publican package</command> vyhledá první soubor XML v adresáři XML dokumentu, který obsahuje tag <literal>&lt;revhistory&gt;</literal>. <application>Publican</application> poté použije tento soubor k sestavení historie revizí RPM.
fr_fr: La commande <prompt>$</prompt> <command>publican package</command> recherche dans le répertoire du document le premier fichier XML contenant une balise <literal>&lt;revhistory&gt;</literal>. Puis <application>Publican</application> utilise ce fichier pour construire l'historique de révision.

source: <filename>Test_Book.xml</filename>
cs_cz: <filename>Kniha_Test.xml</filename>

source: <filename>Test_Book.ent</filename>
cs_cz: <filename>Kniha_Test.ent</filename>

source: Note
cs_cz: Poznámka

source: Important
cs_cz: Důležité
