Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: Files in the book directory
cs_cz: Soubory v adresáři knihy
fr_fr: Fichiers dans le répertoire de l'ouvrage

source: If you run the command <prompt>$</prompt> <command>publican create --name Test_Book --lang en-US</command>, <application>Publican</application> creates a directory structure and required files, similar to the following:
cs_cz: Spustíte-li příkaz <prompt>$</prompt> <command>publican create --name Kniha_Test --lang en-US</command>, <application>Publican</application> vytvoří adresářovou strukturu a požadované soubory, podobné těmto:
fr_fr: Si vous exécutez la commande <prompt>$</prompt> <command>publican create --name Livre_test --lang en-US</command>, <application>Publican</application> crée une structure de répertoires avec les fichiers requis, semblable à la suivante :

source: <filename>en-US</filename> (directory)
cs_cz: <filename>en-US</filename> (adresář)
fr_fr: <filename>en-US</filename> (répertoire)

source: <filename>images</filename> (directory)
cs_cz: <filename>images</filename> (adresář)
fr_fr: <filename>images</filename> (répertoire)

source: The publican.cfg file
cs_cz: Soubor publican.cfg
fr_fr: Le fichier publican.cfg

source: Note — Customizing output
cs_cz: Poznámka - vlastní úprava výstupu
fr_fr: Note — Personnaliser une sortie

source: If you maintain multiple versions of a document, you can create a configuration file for each version. When building or packaging the document, you can use the <option>--config</option> to specify a configuration file other than the <filename>publican.cfg</filename> file and therefore a different set of parameters to use in a particular build. For example:
cs_cz: Udržujete-li několik verzí dokumentu, lze vytvořit konfigurační soubor pro každou z nich. Při sestavování nebo balení dokumentu lze pomocí <option>--config</option> zadat jiný konfigurační soubor než <filename>publican.cfg</filename>, a tak použít pro dané sestavení jinou sadu parametrů. Na příklad:
fr_fr: Si vous avez plusieurs versions d'un document en maintenance, vous pouvez créer un fichier de configuration pour chaque version. En construisant ou empaquetant un document, vous pouvez utiliser l'option <option>--config</option> pour désigner un fichier de configuration autre que <filename>publican.cfg</filename>, et, par conséquent, utiliser un jeu de paramètres différents pour cette une construction particulière. Par exemple :

source: The <filename>publican.cfg</filename> file configures build options, and is located in the root of the book directory. The following is an example <filename>publican.cfg</filename> file, with a description of <filename>publican.cfg</filename> parameters following afterwards:
cs_cz: Soubor <filename>publican.cfg</filename> nastavuje volby sestavení a nachází se v kořenovém adresáři knihy. Následuje příklad souboru <filename>publican.cfg</filename>, popis jeho parametrů je uveden pod ním:
fr_fr: Le fichier <filename>publican.cfg</filename> sert à configurer les options de construction ; il est situé à la racine du répertoire de l'ouvrage. Voici un exemple de fichier <filename>publican.cfg</filename>, suivi d'une description des paramètres possibles pour les fichiers du type <filename>publican.cfg</filename> :

source: Default parameters
cs_cz: Základní parametry
fr_fr: Paramètres par défaut

source: specifies the language of the source XML files, for example, <literal>en-US</literal>, as set by the <option>--lang</option> option for <prompt>$</prompt> <command>publican create</command>.
cs_cz: určuje jazyk zdrojových souborů XML, na příklad <literal>en-US</literal>, nastavený volbou <option>--lang</option> v <prompt>$</prompt> <command>publican create</command>.
fr_fr: définit la langue des fichiers sources du XML, par exemple, <literal>en-US</literal>, tel que précisé par l'option <option>--lang</option> de <prompt>$</prompt> <command>publican create</command>.

source: specifies the type of document — a DocBook <tag>&lt;article&gt;</tag>, DocBook <tag>&lt;book&gt;</tag>, or DocBook <tag>&lt;set&gt;</tag>, as set by the <option>--type</option> option for <prompt>$</prompt> <command>publican create</command>.
cs_cz: určuje typ dokumentu — <sgmltag>&lt;article&gt;</sgmltag>, <sgmltag>&lt;book&gt;</sgmltag> nebo <sgmltag>&lt;set&gt;</sgmltag> z DocBook, nastavený volbou <option>--type</option> v <prompt>$</prompt> <command>publican create</command>.
fr_fr: définit le type de document — un <sgmltag>&lt;article&gt;</sgmltag> DocBook, un <sgmltag>&lt;book&gt;</sgmltag> DocBook ou un <sgmltag>&lt;set&gt;</sgmltag> DocBook, tel que précisé avec l'option <option>--type</option> de <prompt>$</prompt> <command>publican create</command>.

source: sets the <firstterm>brand</firstterm> of the document, for example, <computeroutput>RedHat</computeroutput>, <computeroutput>fedora</computeroutput>, <computeroutput>JBoss</computeroutput>, <computeroutput>oVirt</computeroutput> or <computeroutput>GIMP</computeroutput> , as set by the <option>--brand</option> option for <prompt>$</prompt> <command>publican create</command>. If you do not specify a brand, <application>Publican</application> uses its default brand. Refer to <xref linkend="chap-Publican-Users_Guide-Branding" /> for more information.
cs_cz: stanoví <firstterm>grafickou úpravu</firstterm> dokumentu, na příklad <computeroutput>RedHat</computeroutput>, <computeroutput>fedora</computeroutput>, <computeroutput>JBoss</computeroutput>, <computeroutput>oVirt</computeroutput> nebo <computeroutput>GIMP</computeroutput> , nastavenou volbou <option>--brand</option> v <prompt>$</prompt> <command>publican create</command>. Nezadáte-li grafickou úpravu, <application>Publican</application> použije svou výchozí. Více informací viz <xref linkend="chap-Publican-Users_Guide-Branding" />.
fr_fr: définit le choix de l'<firstterm>estampille</firstterm> pour le document, par exemple, <computeroutput>RedHat</computeroutput>, <computeroutput>fedora</computeroutput>, <computeroutput>JBoss</computeroutput>, <computeroutput>oVirt</computeroutput> ou <computeroutput>GIMP</computeroutput>, tel que défini par l'option <option>--brand</option> de <prompt>$</prompt> <command>publican create</command>. Si vous ne précisez pas d'estampille, <application>Publican</application> utilise la charte graphique par défaut. Voyez le <xref linkend="chap-Publican-Users_Guide-Branding" /> pour plus d'informations.

source: filters output by computer <firstterm>architecture</firstterm>. For example, if you set <literal>arch: x86_64</literal> in the <filename>publican.cfg</filename> file, <application>Publican</application> will only include XML elements tagged with the equivalent attribute, such as <tag>&lt;para arch="x86_64"&gt;</tag>.
cs_cz: filtruje výstup dle počítačové <firstterm>architektury</firstterm>. Na příklad, nastavíte-li v souboru <filename>publican.cfg</filename> <literal>arch: x86_64</literal>, <application>Publican</application> zahrne pouze prvky XML opatřené stejným atributem, např. <sgmltag>&lt;para arch="x86_64"&gt;</sgmltag>.
fr_fr: filtre les sorties selon l'<firstterm>architecture</firstterm> de l'ordinateur. Par exemple, si vous définissez <literal>arch: x86_64</literal> dans le fichier <filename>publican.cfg</filename>, <application>Publican</application> n'incorporera que les éléments XML signés de l'attribut équivalent, comme <sgmltag>&lt;para arch="x86_64"&gt;</sgmltag>.

source: Use with caution
cs_cz: Používat opatrně
fr_fr: À utiliser avec précaution

source: As with conditional tagging more generally, <literal>arch</literal> can cause great difficulties when translating documents. Refer to <xref linkend="sect-Publican-Users_Guide-Conditional_tagging-Conditional_tagging_and_translation" /> for an explanation of the issues.
cs_cz: Tak jako obecněji podmíněné tagování může <literal>arch</literal> být velmi problematický z hlediska jazykových překladů dokumentů. Vysvětlení problematiky viz <xref linkend="sect-Publican-Users_Guide-Conditional_tagging-Conditional_tagging_and_translation" />.
fr_fr: Comme il en est, plus généralement, avec tout marquage conditionnel, <literal>arch</literal> peut créer de grosses difficultés lors de la traduction du document. Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Conditional_tagging-Conditional_tagging_and_translation" /> pour une explication à propos de ces problèmes.

source: arch set for root nodes
cs_cz: Arch nastavená pro kořenové uzly
fr_fr: arch au niveau nœud racine

source: If the root node of an XML file is excluded by the <parameter>arch</parameter> attribute, your document will not build, because empty files are not valid XML. For example, if <filename>Installation_and_configuration-PPC.xml</filename> contains a single chapter:
cs_cz: Je-li kořenový uzel souboru XML vyloučen atributem <parameter>arch</parameter>, váš dokument se nesestaví, neboť prázdné soubory nejsou validním XML. Na příklad obsahuje-li <filename>Installation_and_configuration-PPC.xml</filename> jedinou kapitolu:
fr_fr: Si le nœud racine d'un fichier XML est exclu à l'aide de l'attribut <parameter>arch</parameter>, la construction du document échouera, car les fichiers vides ne sont pas des XML valides. Par exemple, si <filename>Installation_and_configuration-PPC.xml</filename> ne contient qu'un seul chapitre :

source: &lt;?xml version='1.0' encoding='utf-8' ?&gt; &lt;!DOCTYPE chapter PUBLIC "-//OASIS//DTD DocBook XML V4.5//EN" "http://www.oasis-open.org/docbook/xml/4.5/docbookx.dtd" [ ]&gt; &lt;chapter id="chap-Installation_and_configuration_on_PowerPC" arch="PowerPC"&gt; &lt;title&gt;Installation and configuration on PowerPC&lt;/title&gt; [text of chapter] &lt;/chapter&gt;
fr_fr: &lt;?xml version='1.0' encoding='utf-8' ?&gt; &lt;!DOCTYPE chapter PUBLIC "-//OASIS//DTD DocBook XML V4.5//EN" "http://www.oasis-open.org/docbook/xml/4.5/docbookx.dtd" [ ]&gt; &lt;chapter id="chap-Installation_and_configuration_on_PowerPC" arch="PowerPC"&gt; &lt;title&gt;Installation and configuration on PowerPC&lt;/title&gt; [texte du chapitre] &lt;/chapter&gt;

source: and this chapter is included in <filename>User_Guide.xml</filename> with an <tag>&lt;xi:include&gt;</tag> tag, the document will not build with <prompt>$</prompt> <command>condition: x86</command> set in the <filename>publican.cfg</filename> file.
cs_cz: a tato kapitola je zahrnuta tagem <sgmltag>&lt;xi:include&gt;</sgmltag> v <filename>User_Guide.xml</filename>, dokument se nesestaví s podmínkou <prompt>$</prompt> <command>condition: x86</command> nastavenou v souboru <filename>publican.cfg</filename>.
fr_fr: et que ce chapitre est incorporé dans <filename>User_Guide.xml</filename> sous la balise <sgmltag>&lt;xi:include&gt;</sgmltag>, la construction du document échouera si la directive <prompt>$</prompt> <command>condition: x86</command> est définie dans le fichier <filename>publican.cfg</filename>.

source: To exclude this chapter, add the <parameter>arch</parameter> attribute to the <tag>&lt;xi:include&gt;</tag> tag in <filename>User_Guide.xml</filename>, not to the <tag>&lt;chapter&gt;</tag> tag in <filename>Installation_and_configuration-PPC.xml</filename>.
cs_cz: Chcete-li tuto kapitolu vyloučit, přidejte atribut <parameter>arch</parameter> do tagu <sgmltag>&lt;xi:include&gt;</sgmltag> v <filename>User_Guide.xml</filename>, nikoliv do tagu <sgmltag>&lt;chapter&gt;</sgmltag> v <filename>Installation_and_configuration-PPC.xml</filename>.
fr_fr: Pour exclure ce chapitre, ajoutez l'attribut <parameter>arch</parameter> sous la balise <sgmltag>&lt;xi:include&gt;</sgmltag> dans <filename>User_Guide.xml</filename>, et non sous <sgmltag>&lt;chapter&gt;</sgmltag> dans <filename>Installation_and_configuration-PPC.xml</filename>.

source: xrefs and the arch attribute
cs_cz: xref a atribut arch
fr_fr: Références croisées et l'attribut arch

source: If an <tag>&lt;xref&gt;</tag> points to content not included in the build due to the <parameter>arch</parameter> attribute, the build will fail. For example, with <literal>arch: x86</literal> set in the <filename>publican.cfg</filename> file, <prompt>$</prompt> <command>publican build --formats=pdf --langs=en-US</command> will fail if the book has the tag <tag>&lt;xref linkend="Itanium_installation"&gt;</tag> pointing to <tag>&lt;section id="Itanium_installation" arch="IA64"&gt;</tag>.
cs_cz: Ukazuje-li <sgmltag>&lt;xref&gt;</sgmltag> na obsah vyloučený ze sestavení kvůli atributu <parameter>arch</parameter>, sestavení selže. Na příklad, s nastavenou <literal>arch: x86</literal> v souboru <filename>publican.cfg</filename>, <prompt>$</prompt> <command>publican build --formats=pdf --langs=en-US</command> selže, obsahuje-li kniha tag <sgmltag>&lt;xref linkend="Itanium_installation"&gt;</sgmltag> ukazující na <sgmltag>&lt;section id="Itanium_installation" arch="IA64"&gt;</sgmltag>.
fr_fr: Si un <sgmltag>&lt;xref&gt;</sgmltag> pointe sur un contenu non incorporé lors de la construction à cause de l'attribut <parameter>arch</parameter>, la construction échoue. Par exemple, si <literal>arch: x86</literal> est défini dans le fichier <filename>publican.cfg</filename>, <prompt>$</prompt> <command>publican build --formats=pdf --langs=en-US</command> échoue si l'ouvrage comporte la balise <sgmltag>&lt;xref linkend="Itanium_installation"&gt;</sgmltag> pointant sur <sgmltag>&lt;section id="Itanium_installation" arch="IA64"&gt;</sgmltag>.

source: specifies a space-separated list of books used in a remote set. Refer to <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" /> for more information on distributed sets.
cs_cz: uvádí čárkou oddělený seznam knih používaných ve vzdálené sadě. Více informací o distribuovaných sadách viz <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />
fr_fr: définit une liste d'ouvrages séparés par une espace ; cette liste est utilisée pour regrouper un ensemble éclaté. Voyez la <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" /> pour plus d'informations à propos des ensembles distribués.

source: specifies the build target to use for building the desktop RPM package in <application>Brew</application>, Red Hat's internal build system. This parameter defaults to <literal>docs-5E</literal>. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" /> and <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" /> for more information on building RPM packages.
cs_cz: uvádí cíl sestavení, který se má použít v <application>Brew</application>, interním sestavovacím systému společnosti Red Hat, pro sestavení balíčku RPM pro stolní počítač. Výchozí hodnotou je <literal>docs-5E</literal>. Více informací o sestavování balíčků RPM viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" /> a <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" />.
fr_fr: définit <application>Brew</application>, système de construction interne de Red Hat, comme cible de construction à utiliser pour un paquet RPM sur bureau. Ce paramètre vaut <literal>docs-5E</literal> par défaut. Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document-The_publican_package_command" /> et à la <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" /> pour plus d'information à propos de la construction des paquets RPM.

source: specifies whether the contents of <tag>&lt;bridgehead&gt;</tag> elements (free-floating titles) should be included among other titles (such as section titles and chapter titles) in tables of contents. To enable this feature, set <literal>bridgehead_in_toc: 1</literal>. Otherwise, the parameter defaults to <literal>0</literal>, and <tag>&lt;bridgehead&gt;</tag>s are not included in tables of contents.
cs_cz: stanoví, zda texty prvků <sgmltag>&lt;bridgehead&gt;</sgmltag> (volně plující nadpisy) mají být zahrnuty k ostatním nadpisům v obsahu (jako např. nadpisům oddílů a kapitol). Chcete-li povolit tuto vlastnost, nastavte <literal>bridgehead_in_toc: 1</literal>. V opačném případě tento parametr má výchozí hodnotu <literal>0</literal> a prvky <sgmltag>&lt;bridgehead&gt;</sgmltag> nejsou do obsahu zahrnuty.
fr_fr: indique si les contenus des éléments <sgmltag>&lt;bridgehead&gt;</sgmltag> (intitulés flottants) doivent être incorporés dans la table des matières avec les autres intitulés (tels les titres de chapitre ou de section). Pour activer cette fonctionnalité, écrivez <literal>bridgehead_in_toc: 1</literal>. Autrement, la valeur du paramètre est <literal>0</literal> par défaut et les intitulés <sgmltag>&lt;bridgehead&gt;</sgmltag> ne sont pas incorporés dans la table des matières.

source: controls whether the first section should appear on a new page when rendered in HTML. To make the first section appear on a new HTML page, set this parameter to <literal>chunk_first: 1</literal>. Otherwise, the parameter defaults to <literal>0</literal>, and the first section appears on the same page of its chapter.
cs_cz: řídí, zda se má první oddíl při renderování v HTML umístit na novou stránku. Chcete-li umístit první oddíl na novou stránku HTML, nastavte tento parametr na <literal>chunk_first: 1</literal>. Jinak tento parametr má výchozí hodnotu <literal>0</literal> a první oddíly se zobrazí na stejné stránce jako jejich kapitola.
fr_fr: contrôle si, pour un rendu HTML, le premier paragraphe doit s'afficher sur une nouvelle page. Pour ce faire, définissez <literal>chunk_first: 1</literal> comme valeur du paramètre. Par défaut, le paramètre vaut <literal>0</literal> et le premier paragraphe est sur la même page que son chapitre.

source: controls the section depth at which <application>Publican</application> no longer splits sub-subsections onto a new page when rendering HTML. By default, this value is set to <literal>4</literal>.
cs_cz: řídí hloubku, v které <application>Publican</application> při renderování HTML již neumisťuje pododdíly na nové stránky. Výchozí hodnota je nastavena na <literal>4</literal>.
fr_fr: définit la profondeur de subdivision au delà de laquelle <application>Publican</application> ne dispose plus les sous-sections sur un nouvelle page en rendu HTML. Cette valeur est de <literal>4</literal> par défaut.

source: Controlling the section depth with chunk_section_depth
cs_cz: Řízení hloubky zanoření oddílů s chunk_section_depth
fr_fr: Contrôle de la profondeur de subdivision avec chunk_section_depth

source: no section split. All sections with their sub-sections appear on the same page of the chapter they belong. The page succession is chapter 1, chapter 2, chapter 3, …
cs_cz: bez oddělení oddílů. Kapitola a všechny její oddíly, vč. pododdílů, se umístí na jednu stránku. Řazení stránek je kapitola 1, kapitola 2, kapitola 3, &hellip;
fr_fr: pas de subdivision en paragraphes. Tous les paragraphes et leurs alinéas sont disposés sur la page du chapitre auquel ils appartiennent. La suite des pages est : chapitre 1, chapitre 2, chapitre 3, &hellip;

source: the split is at "level 1" section. Each level section one with its sub-sections, appear on a new page. The page succession is chapter 1, 1.2, 1.3, 1.4 … chapter 2, 2.1, 2.2, 2.3 …
cs_cz: oddělení nastává na oddílu "úroveň 1". Každý oddíl první úrovně se umístí, se svými pododdíly, na novou stránku. Řazení stránek je kapitola 1, 1.2, 1.3, 1.4 &hellip; kapitola 2, 2.1, 2.2, 2.3 &hellip;
fr_fr: la coupure est au niveau « 1 » de subdivision. Chaque paragraphe de niveau un et l'ensemble des sous-sections sont placés sur une nouvelle page. La suite de pages est chapitre 1, 1.2, 1.3, 1.4 &hellip; chapitre 2, 2.1, 2.2, 2.3 &hellip;

source: the split is at "level 2" section. The page succession is chapter 1, 1.2, 1.2.2, 1.2.3, 1.2.4 … 1.3, 1.3.2, 1.3.3 …
cs_cz: oddělení nastavá na oddílu "úroveň 2". Řazení stránek je kapitola 1, 1.2, 1.2.2, 1.2.3, 1.2.4 &hellip; 1.3, 1.3.2, 1.3.3 &hellip;
fr_fr: la coupure est au niveau « 2 » de subdivision. La succession des pages est chapitre 1, 1.2, 1.2.2, 1.2.3, 1.2.4 &hellip; 1.3, 1.3.2, 1.3.3 &hellip;

source: the split is at "level 3" section. The page succession is chapter 1, 1.2, 1.2.2, 1.2.2.2, 1.2.2.3, 1.2.2.4 … 1.3, 1.3.2, 1.3.2.2, 1.3.2.3 …
cs_cz: oddělení nastává na oddílu "úroveň 3". Řazení stránek je kapitola 1, 1.2, 1.2.2, 1.2.2.3, 1.2.2.4 &hellip; 1.3, 1.3.2, 1.3.2.2, 1.3.2.3 &hellip;
fr_fr: la coupure est au niveau « 3 » de subdivision. La succession des pages est chapitre 1, 1.2, 1.2.2, 1.2.2.2, 1.2.2.3, 1.2.2.4 &hellip; 1.3, 1.3.2, 1.3.2.2, 1.3.2.3 &hellip;

source: chunk_section_depth: 4 (default)
cs_cz: chunk_section_depth: 4 (výchozí)
fr_fr: chunk_section_depth: 4 (défaut)

source: the split is at "level 4" section. The page succession is chapter 1, 1.2, 1.2.2, 1.2.2.2, 1.2.2.2.2, 1.2.2.2.3, 1.2.2.2.4 … 1.2.3, 1.2.3.2, 1.2.3.2.2, 1.2.3.2.3 …
cs_cz: oddělení nastává na oddílu "úroveň 4". Řazení stránek je 1, 1.2, 1.2.2, 1.2.2.2, 1.2.2.2.2, 1.2.2.2.3, 1.2.2.2.4 &hellip; 1.2.3, 1.2.3.2, 1.2.3.2.2, 1.2.3.2.3 &hellip;
fr_fr: la coupure est au niveau « 4 » de subdivision. La succession des pages est chapitre 1, 1.2, 1.2.2, 1.2.2.2, 1.2.2.2.2, 1.2.2.2.3, 1.2.2.2.4 &hellip; 1.2.3, 1.2.3.2, 1.2.3.2.2, 1.2.3.2.3 &hellip;
