Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: sets the path to the <firstterm>Java archive</firstterm> (<firstterm>jar</firstterm>) files for <application>FOP</application>. <application>Publican</application> relies on Apache <application>FOP</application> — a Java application — to render documents as PDF files. The default path for <application>FOP</application>'s jar files on a computer with a Linux operating system is: <filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/ant</filename><filename>/ant-trax-1.7.0.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xmlgraphics-commons.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/batik-all.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis-ext.jar</filename>
cs_cz: nastaví cestu k souborům <firstterm>Java archive</firstterm> (<firstterm>jar</firstterm>) pro aplikaci <application>FOP</application>. <application>Publican</application> spoléhá při renderování dokumentů do souborů PDF na Apache <application>FOP</application> - applikaci Java. Výchozí cesta pro soubory jar aplikace <application>FOP</application> na počítači s operačním systémem Linux je: <filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/ant</filename><filename>/ant-trax-1.7.0.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xmlgraphics-commons.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/batik-all.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis-ext.jar</filename>
fr_fr: définit le chemin des fichiers <firstterm>archives Java</firstterm> (<firstterm>jar</firstterm>) pour <application>FOP</application>. <application>Publican</application> confie le rendu des documents sous forme de fichiers PDF à <application>FOP</application> — une application Java — de Apache. Le chemin par défaut pour les fichiers jar de <application>FOP</application> sur un ordinateur Linux est : <filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/ant</filename><filename>/ant-trax-1.7.0.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xmlgraphics-commons.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/batik-all.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis.jar:</filename><filename>/usr</filename><filename>/share</filename><filename>/java</filename><filename>/xml-commons-apis-ext.jar</filename>

source: sets the path to the <application>Publican</application> installation. The default location on a computer with a Linux operating system is <filename>/usr/share/publican</filename>. On a computer with a Windows operating system, the default location is <filename>%SystemDrive%/%ProgramFiles%/publican</filename> — most usually <filename>C:/Program Files/publican</filename>.
cs_cz: nastaví cestu k instalaci <application>Publicanu</application>. Výchozí umístění na počítači s operačním systémem Linux je <filename>/usr/share/publican</filename>. Na počítači s operačním systémem Windows je výchozí umístění <filename>%SystemDrive%/%ProgramFiles%/publican</filename> — nejčastěji tedy <filename>C:/Program Files/publican</filename>.
fr_fr: définit le chemin d'installation de <application>Publican</application>. L'emplacement par défaut sur un système Linux est <filename>/usr/share/publican</filename>. Sur un système Windows, l'emplacement par défaut est <filename>%SystemDrive%/%ProgramFiles%/publican</filename> — habituellement <filename>C:/Program Files/publican</filename>.

source: sets the path to the <application>Publican</application> <firstterm>common content</firstterm> files. These files provide default formatting, plus some boilerplate text and generic graphics. The default location on a computer with a Linux operating system is <filename>/usr/share/publican/Common_Content</filename>. On a computer with a Windows operating system, the default location is <filename>%SystemDrive%/%ProgramFiles%/publican/Common_Content</filename> — most usually <filename>C:/Program Files/publican/Common_Content</filename>.
cs_cz: nastaví cestu k souborům <firstterm>společného obsahu</firstterm> <application>Publicanu</application>. Tyto soubory poskytují výchozí formátování, plus některý předpřipravený text a obecnou grafiku. Výchozí umístění na počítači s operačním systémem Linux je <filename>/usr/share/publican/Common_Content</filename>. Výchozí umístění na počítači s operačním systémem Windows je <filename>%SystemDrive%/%ProgramFiles%/publican/Common_Content</filename> — obvykle tedy <filename>C:/Program Files/publican/Common_Content</filename>.
fr_fr: définit le chemin vers les fichiers <application>Publican</application> de <firstterm>contenu courant</firstterm>. Ces fichiers fournissent les formats par défaut, plus quelques textes de paragraphes et graphiques génériques standardisés. L'emplacement par défaut sur un ordinateur Linux est <filename>/usr/share/publican/Common_Content</filename>. Sur un ordinateur Windows, l'emplacement par défaut est <filename>%SystemDrive%/%ProgramFiles%/publican/Common_Content</filename> — habituellement <filename>C:/Program Files/publican/Common_Content</filename>.

source: specifies conditions on which to prune XML before transformation. Refer to <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" /> for more information.
cs_cz: uvádí podmínky, za kterých se redukuje (prune) XML před transformací. Více informací viz <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" />.
fr_fr: définit les possibilités d'allègement des XML avant transformation. Voyez la <xref linkend="sect-Publican-Users_Guide-Conditional_tagging" /> pour plus d'informations.

source: marks a document as confidential. When this parameter is set to <literal>1</literal>, <application>Publican</application> adds the text specified by the <parameter>confidential_text</parameter> parameter (by default, <literal>CONFIDENTIAL</literal>) to the foot of each HTML page and the head of every page in a PDF document. The default value is <literal>0</literal> (no header or footer).
cs_cz: označí dokument za utajovaný. Je-li tento parametr nastaven na <literal>1</literal>, přidá <application>Publican</application> do patičky každé stránky HTML a do hlavičky každé stránky v dokumentu PDF text uvedený v parametru <parameter>confidential_text</parameter> (ve výchozím stavu <literal>CONFIDENTIAL</literal>). Výchozí hodnotou je <literal>0</literal> (žádná hlavička ani patička).
fr_fr: marque un document comme étant confidentiel. Quand ce paramètre est fixé à la valeur <literal>1</literal>, <application>Publican</application> ajoute le texte défini par le paramètre <parameter>confidential_text</parameter> (par défaut, <literal>CONFIDENTIAL</literal>) en pied de chaque page d'un document au format HTML et en tête s'il est au format PDF. La valeur par défaut est <literal>0</literal> (aucun en-tête ou pied de page).

source: specifies the text to use when the <parameter>confidential</parameter> parameter is set to <literal>1</literal>. The default text is <literal>CONFIDENTIAL</literal>.
cs_cz: určuje text, který se použije, je-li parametr <parameter>confidential</parameter> nastaven na <literal>1</literal>. Výchozí text je <literal>CONFIDENTIAL</literal>.
fr_fr: définit le texte à utiliser quand le paramètre <parameter>confidential</parameter> est égal à <literal>1</literal>. Le texte par défaut est <literal>CONFIDENTIAL</literal>.

source: controls whether <application>Publican</application> should display debugging messages as it works. When set to its default of <literal>0</literal>, <application>Publican</application> does not display debugging messages. Change this value to <literal>1</literal> to view these messages.
cs_cz: řídí, zda má <application>Publican</application> zobrazovat ladící informace při své činnosti. Je-li nastaven na svou výchozí hodnotu <literal>0</literal>, <application>Publican</application> ladící informace nezobrazuje. Chcete-li tyto informace zobrazovat, změňte hodnotu na <literal>1</literal>.
fr_fr: contrôle si <application>Publican</application> doit afficher les messages de débogage en cours de travail. Si le paramètre est égal à sa valeur par défaut, soit <literal>0</literal>, <application>Publican</application> n'affiche pas de messages. Mettez cette valeur à <literal>1</literal> pour voir ces messages.

source: sets the default language for a <application>Publican</application>-managed website. Tables of contents for languages other than the default language will link to documents in the default language when translations are not available. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
cs_cz: nastaví výchozí jazyk pro webové stránky řízené <application>Publicanem</application>. Obsahy pro jiné jazyky než je výchozí jazyk budou odkazovat na dokumenty ve výchozím jazyku, nejsou-li k dispozici překlady. Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
fr_fr: définit la langue par défaut pour un site web géré avec <application>Publican</application>. Les tables des matières pour des langues autres que celles par défaut effectueront les liens vers les documents dans le langage par défaut tant que les traductions ne sont pas disponibles. Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.

source: provides a URL for the documentation team for this package. In HTML output, <application>Publican</application> links to this URL at the top right of each page, through the <filename>image_right.png</filename> image in the <filename>Common_Content/images</filename> directory for the brand. This parameter defaults to <literal>https://fedorahosted.org/publican</literal>
cs_cz: poskytuje URL pro dokumentační tým tohoto balíčku. Ve výstupu HTML odkazuje <application>Publican</application> na toto URL vpravo nahoře každé stránky, pomocí obrázku <filename>image_right.png</filename> v adresáři <filename>Common_Content/images</filename> grafické úpravy. Výchozí hodnotou parametru je <literal>https://fedorahosted.org/publican</literal>.
fr_fr: indique l'URL de l'équipe de documentation du paquet. Dans une sortie HTML, <application>Publican</application> met en place un lien vers cet URL en haut et à droite de chaque page, par l'intermédiaire de l'image <filename>image_right.png</filename> du répertoire <filename>Common_Content/images</filename> particulier à l'estampille. Par défaut, ce paramètre ouvre la page <literal>https://fedorahosted.org/publican</literal>.

source: specifies the document name. If set, this value overrides the content of the <tag>&lt;title&gt;</tag> tag in the <filename>Book_Info.xml</filename> file when you package a document. This value must contain only upper- and lower-case un-accented letters, digits, and the underscore and space characters (‘a–z’, ‘A–Z’, ‘0’–‘9’, and ‘_’ and ‘ ’).
cs_cz: určuje název dokumentu. Je-li nastaven, jeho hodnota při balení dokumentu potlačuje obsah tagu <sgmltag>&lt;title&gt;</sgmltag> v souboru <filename>Book_Info.xml</filename>. Hodnota musí obsahovat pouze velká a malá písmena bez diakritiky, číslice, podtržítka a mezery ((&lsquo;a&ndash;z&rsquo;, &lsquo;A&ndash;Z&rsquo;, &lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;, &lsquo;_&rsquo; a &lsquo;&nbsp;&rsquo;).
fr_fr: définit le nom du document. Si cette valeur est précisée, elle prend le pas sur l'indication de la balise <sgmltag>&lt;title&gt;</sgmltag> du fichier <filename>Book_Info.xml</filename> quand vous empaquetez un document. Cette valeur ne doit contenir que des lettres en majuscules ou minuscules sans accent, des chiffres et les caractères espace ou souligné (&lsquo;a&ndash;z&rsquo;, &lsquo;A&ndash;Z&rsquo;, &lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;, &lsquo;_&rsquo; et &lsquo;&nbsp;&rsquo;).

source: a package that a desktop package obsoletes.
cs_cz: balíček, který bude balíčkem pro stolní počítač označen za zastaralý.
fr_fr: un paquet déclaré obsolète dans un paquet pour ordinateur de bureau.

source: a package that the desktop package requires, for example, a documentation menu package. Refer to <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.
cs_cz: balíček, který je vyžadován balíčkem pro stolní počítač, na příklad balíček dokumentační nabídky. Viz <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.
fr_fr: un paquet requis par le paquet de tête, par exemple, un paquet de menu de documentation. Voyez la <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.

source: specifies the version of the DocBook XML <firstterm>Document Type Definition</firstterm> (DTD) on which this project is based. <application>Publican</application> defaults to version 4.5. The specification for DocBook XML DTD version 4.5 is available from <uri xlink:href="http://www.docbook.org/specs/docbook-4.5-spec.html" xmlns:xlink="http://www.w3.org/1999/xlink">http://www.docbook.org/specs/docbook-4.5-spec.html</uri>.
cs_cz: určuje verzi <firstterm>definici typu dokumentu</firstterm> (DTD) DocBook XML, na níž je projekt založen. <application>Publican</application> ve výchozím nastavení využívá verzi 4.5. Specifikace DocBook XML DTD verze 4.5 je dostupná na <ulink url="http://www.docbook.org/specs/docbook-4.5-spec.html" />.
fr_fr: définit la version du <firstterm>Document Type Definition</firstterm> (DTD) pour le XML de DocBook sur lequel ce projet se fonde. Par défaut, <application>Publican</application> utilise la version 4.5. Les caractéristiques de la version 4.5 du DTD du XML pour DocBook sont disponibles à la page <ulink url="http://www.docbook.org/specs/docbook-4.5-spec.html" />.

source: A different DTD might slow your build
cs_cz: Různé DTD mohou zpomalit sestavování
fr_fr: Un DTD différent peut ralentir la construction

source: When you install <application>Publican</application>, you also install a local copy of the DocBook XML DTD version 4.5 and accompanying <firstterm>Extensible Stylesheet Language</firstterm> (XSL). If you set a version of the DTD for which there is no local support, <application>Publican</application> must download the appropriate DTD and XSL from an online source every time that it builds the document. Building your document is delayed while this download takes place. The combined size of the required files is around 70 MB.
cs_cz: Při instalaci <application>Publicanu</application> rovněž instalujete místní kopii DocBook XML DTD verze 4.5 a přidružený <firstterm>rozšiřitelný stylový jazyk</firstterm> (XSL). Nastavíte-li verzi DTD, pro kterou neexistuje místní podpora, <application>Publican</application> musí příslušnou DTD a XSL stáhnout z online zdroje pokaždé, kdy je dokument sestavován. Sestavení dokumentu je tak zpožděno, neboť probíhá toto stahování. Celková velikost požadovaných souborů se pohybuje kolem 70&nbsp;MB.
fr_fr: Quand vous installez <application>Publican</application>, vous installez aussi une copie locale de la version 4.5 du DTD pour le XML DocBook, accompagnée des feuilles de style <firstterm>Extensible Stylesheet Language</firstterm> (XSL). Si vous définissez une version de DTD pour laquelle il n'y a pas de prise en charge locale, <application>Publican</application> doit télécharger le DTD et les XSL appropriés à partir d'une source en ligne chaque fois qu'il construit le document. La construction en est différée de la durée du téléchargement. La taille des fichiers nécessaires est de 70 Mio environ.

source: Override Type for DocType. Must be a complete string.
cs_cz: Potlačuje Typ pro DocType. Musí mít formu celého řetězce.
fr_fr: écrase le type de DocType. L'expression doit être une chaîne complète.

source: This parameter is only permitted in a brand.
cs_cz: Tento parametr je povolen pouze v grafické úpravě.
fr_fr: Ce paramètre n'est autorisé que dans une estampille.

source: Override URI for DocType. Must be a complete string.
cs_cz: Potlačuje URI pro DocType. Musí mít podobu celého řetězce.
fr_fr: écrase l'URI de DocType. L'expression doit être une chaîne complète.

source: sets the ID for an <application>Eclipse</application> help plugin. Every <application>Eclipse</application> help plugin must have a unique ID, and these generally follow Java package naming conventions — refer to <uri xlink:href="http://java.sun.com/docs/codeconv/html/CodeConventions.doc8.html" xmlns:xlink="http://www.w3.org/1999/xlink">http://java.sun.com/docs/codeconv/html/CodeConventions.doc8.html</uri>. By default, <application>Publican</application> sets the ID to <replaceable>org.product</replaceable>.<replaceable>docname</replaceable>. The ID that you set here also determines the directory name for this plugin in the <filename>plugin</filename> directory.
cs_cz: nastavuje ID pro zásuvný modul nápovědy <application>Eclipse</application>. Každý zásuvný modul <application>Eclipse</application> musí mít jedinečné ID, a ty obecně odpovídají úmluvám o přidělování názvů balíčkům Java - viz <ulink url="http://java.sun.com/docs/codeconv/html/CodeConventions.doc8.html" />. Ve výchozím nastavení nastaví <application>Publican</application> ID na <replaceable>org.product</replaceable>.<replaceable>docname</replaceable>. ID, které zde nastavíte, určuje rovněž název adresáře pro tento zásuvný modul v adresáři <filename>plugin</filename>.
fr_fr: définit l'identifiant du greffon d'aide <application>Eclipse</application>. Chaque greffon d'aide <application>Eclipse</application> doit posséder un identifiant unique ; en règle générale, il suit les conventions de nommage du paquet Java — voyez <ulink url="http://java.sun.com/docs/codeconv/html/CodeConventions.doc8.html" />. Par défaut, <application>Publican</application> définit l'identifiant par <replaceable>org.produit</replaceable>.<replaceable>nom_document</replaceable>. L'identifiant que vous définissez ici détermine également le nom du sous-répertoire pour ce greffon dans le répertoire <filename>plugin</filename>.

source: sets the name of an <application>Eclipse</application> help plugin. This is the human-readable name visible in the help list in <application>Eclipse</application>. This name does not need to be unique or to follow a special convention. By default, <application>Publican</application> sets the name to <replaceable>product</replaceable> <replaceable>docname</replaceable>.
cs_cz: nastavuje název zásuvného modulu nápovědy <application>Eclipse</application>. Jedná se o člověkem čitelný název, který bude zobrazen v seznamu nápovědy v <application>Eclipse</application>. Název nemusí být jedinečný nebo odpovídat zvláštní úmluvě. Ve výchozím nastavení nastaví <application>Publican</application> název na <replaceable>product</replaceable> <replaceable>docname</replaceable>.
fr_fr: définit le nom du greffon d'aide <application>Eclipse</application>. C'est le nom en clair visible dans la liste des aides <application>Eclipse</application>. Ce nom ne doit pas forcément être unique ou suivre des conventions particulières. Par défaut, <application>Publican</application> le définit à <replaceable>produit</replaceable> <replaceable>nom_document</replaceable>.

source: sets the provider name for an <application>Eclipse</application> help plugin. This should be your name, or the name of your project or organization. This name is presented to users and does not need to be unique or follow a special convention. By default, <application>Publican</application> sets the provider name to <replaceable>Publican</replaceable>-<replaceable>Publican version</replaceable>.
cs_cz: nastaví název poskytovatele zásuvného modulu nápovědy <application>Eclipse</application>. Zde by mělo být vaše jméno, nebo název vašeho projektu nebo organizace. Název je prezentován uživatelům a nemusí být jedinečný nebo odpovídat zvláštní úmluvě. Ve výchozím nastavení nastaví <application>Publican</application> název poskytovatele na <replaceable>Publican</replaceable>-<replaceable>verze Publicanu</replaceable>.
fr_fr: définit le nom du fournisseur du greffon d'aide <application>Eclipse</application>. Ce peut être votre nom, ou le nom du projet, ou le nom de votre société. Ce nom est affiché à l'intention des utilisateurs. Il n'a pas à être unique ou à se conformer à des conventions spéciales. Par défaut, <application>Publican</application> définit le nom du fournisseur <replaceable>Publican</replaceable>-<replaceable>version de Publican</replaceable>.

source: specifies the edition number for this document.
cs_cz: určuje číslo vydání tohoto dokumentu.
fr_fr: définit l'indice de modification de ce document.

source: The <tag>&lt;edition&gt;</tag> tag was required by versions of Publican prior to 2.0, which used it to generate the version of a documentation package. This tag is now completely optional and does not affect packaging in any way.
cs_cz: Tag <sgmltag>&lt;edition&gt;</sgmltag> byl vyžadován staršími verzemi Publicanu, než byla verze 2.0, které ho využívali k vygenerování verze dokumentačního balíčku. Tento tag je nyní zcela volitelný a neovlivňuje žádným způsobem balíčkování.
fr_fr: La balise <sgmltag>&lt;edition&gt;</sgmltag> était obligatoire dans les versions de Publican antérieures à la version 2.0 ; elle était utilisée pour définir la version d'un paquet de documentation. Cette balise est maintenant optionnelle et n'affecte en rien l'empaquetage.

source: the directory <application>Publican</application> will process extra files from. (Default: <literal>extras</literal>)
cs_cz: adresář, ze kterého bude <application>Publican</application> zpracovávat dodatečné soubory. (Výchozí: <literal>extras</literal>
fr_fr: le nom du répertoire duquel <application>Publican</application> extraira pour traitement les fichiers externes. (Par défault: <literal>extras</literal>)

source: specifies content that will be injected into the bottom of every page on the site.
cs_cz: uvádí obsah, který bude vložen do dolní části každé stránky webových stránek.
fr_fr: définit le contenu du pied de page pour chacune des pages du site.
