Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: Terms tagged with <tag>&lt;subject&gt;</tag> and placed within a <tag>&lt;subjectset&gt;</tag> are added to the <literal>Subject</literal> field of the properties of a PDF document and in the metadata of an ebook in EPUB format.
cs_cz: Termíny označené tagem <sgmltag>&lt;subject&gt;</sgmltag> a umístěné uvnitř <sgmltag>&lt;subjectset&gt;</sgmltag> jsou přidány do pole <literal>Subject</literal> vlastností dokumentu PDF a metadat e-knihy formátu EPUB.
fr_fr: Les termes à la suite de la balise <sgmltag>&lt;subject&gt;</sgmltag>, placés dans un <sgmltag>&lt;subjectset&gt;</sgmltag>, sont ajoutés au champ <literal>Subject</literal> des propriétés pour un document PDF et dans les métadonnées d'un livre électronique au format EPUB.

source: Consider using a <firstterm>controlled vocabulary</firstterm> when defining the subject of your document, for example, the <firstterm>Library of Congress Subject Headings</firstterm> (LCSH). Identify the chosen vocabulary with the <parameter>scheme</parameter> attibute in the <tag>&lt;subjectset&gt;</tag> tag, for example, <tag>&lt;subjectset scheme="libraryofcongress"&gt;</tag>. You can search for LCSH subject headings through the Library of Congress <citetitle>Authorities &amp; Vocabularies</citetitle> page: <uri xlink:href="http://id.loc.gov/authorities/search/" xmlns:xlink="http://www.w3.org/1999/xlink">http://id.loc.gov/authorities/search/</uri>.
cs_cz: Pro účely stanovení předmětu svého dokumentu zvažte použití <firstterm>řízeného slovníku</firstterm>, na příklad <firstterm>Předmětová hesla Kongresové knihovny</firstterm> (LCSH). Zvolený slovník identifikujte v tagu <sgmltag>&lt;subjectset&gt;</sgmltag> atributem <parameter>scheme</parameter>, na příklad <sgmltag>&lt;subjectset scheme="libraryofcongress"&gt;</sgmltag>. Vyhledávat v předmětových heslech LCSH lze na stránce <citetitle>Authorities &amp; Vocabularies</citetitle> Kongresové knihovny: <ulink url="http://id.loc.gov/authorities/search/" />.
fr_fr: Envisagez l'utilisation d'une <firstterm>terminologie normalisée</firstterm> pour la définition du sujet de l'ouvrage, par exemple, les <firstterm>Library of Congress Subject Headings</firstterm> (LCSH) (En-têtes de sujets de la bibliothèque du Congrès). Identifiez les termes choisis à l'aide de l'attribut <parameter>scheme</parameter> sous la balise <sgmltag>&lt;subjectset&gt;</sgmltag>, par exemple, <sgmltag>&lt;subjectset scheme="libraryofcongress"&gt;</sgmltag>. Vous trouverez les en-têtes de sujets LCSH dans la page <citetitle>Authorities &amp; Vocabularies</citetitle> (Autorités et terminologie) de la bibliothèque du Congrès : <ulink url="http://id.loc.gov/authorities/search/" />.

source: <tag>&lt;mediaobject role="cover" id="epub_cover"&gt;</tag>
cs_cz: <sgmltag>&lt;mediaobject role="cover" id="epub_cover"&gt;</sgmltag>
fr_fr: <sgmltag>&lt;mediaobject role="cover" id="epub_cover"&gt;</sgmltag>

source: Use a <tag>&lt;mediaobject&gt;</tag> tag with the <literal>role="cover"</literal> and <literal>id="epub_cover"</literal> attributes to set cover art for an ebook in EPUB format. For example:
cs_cz: Použijte tag <sgmltag>&lt;mediaobject&gt;</sgmltag> s atributy <literal>role="cover"</literal> a <literal>id="epub_cover"</literal>, abyste nastavili zpracování obálky pro e-knihu formátu EPUB. Na příklad:
fr_fr: Utilisez une balise <sgmltag>&lt;mediaobject&gt;</sgmltag> avec les attributs <literal>role="cover"</literal> ou <literal>id="epub_cover"</literal> pour définir une page de garde artistique pour un livre électronique au format EPUB. Par exemple :

source: As with all the other images in your document, place the cover images in the <filename>images</filename> subdirectory.
cs_cz: Tak jako v případě všech dalších obrázků ve vašem dokumentu umístěte obrázky určené pro obálku knihy v podadresáři <filename>images</filename>.
fr_fr: Comme pour toute autre image du document, placez les images de la page de garde dans le sous-répertoire <filename>images</filename>.

source: RPM packages, editions, impressions and versions
cs_cz: Balíčky RPM, vydání, přetisky a verze
fr_fr: Paquets RPM, éditions, impressions et versions

source: As noted above, the default <filename>Book_Info.xml</filename> used by <application>Publican</application> includes an <parameter>&lt;edition&gt;</parameter> tag.
cs_cz: Jak bylo poznamenáno výše, výchozí <filename>Book_Info.xml</filename> používaný <application>Publicanem</application> obsahuje tag <parameter>&lt;edition&gt;</parameter>.
fr_fr: Comme indiqué plus haut, le fichier <filename>Book_Info.xml</filename> par défaut utilisé par <application>Publican</application> inclut une balise <parameter>&lt;edition&gt;</parameter>.

source: If you distribute a book as an RPM package, the data placed within this tag sets the first two digits of the version number in the RPM file name.
cs_cz: Šíříte-li knihu jako balíček RPM, údaje umístěné v tomto tagu nastaví v názvu souboru RPM první dvě číslice čísla verze.
fr_fr: Si vous distribuez un livre sous forme d'un paquet RPM, les données placées sous cette balise définissent les deux premiers chiffres du numéro de version dans le nom du fichier RPM.

source: So, an edition of '1.0' becomes a version of '1.0'.
cs_cz: Proto se vydání (edition) '1.0' stává verzí '1.0'.
fr_fr: Ainsi, une édition « 1.0 » devient une version « 1.0 ».

source: <filename>Book_Info.xml</filename> also includes the <parameter>&lt;pubsnumber&gt;</parameter> tag. Any data placed within this tag changes the release number of RPM-packaged books.
cs_cz: <filename>Book_Info.xml</filename> obsahuje rovněž tag <parameter>&lt;pubsnumber&gt;</parameter>. Jakékoliv údaje umístěné v tomto tagu změní číslo vydání (release) knih zabalených do RPM.
fr_fr: <filename>Book_Info.xml</filename> comprend également une balise <parameter>&lt;pubsnumber&gt;</parameter>. Toute donnée placée sous cette balise modifie le numéro de parution des ouvrages empaquetés sous forme RPM.

source: A book with an edition of 1.0 and a pubsnumber of 5, would be version 1.0, release 5 (1.0-5).
cs_cz: Kniha s vydáním (edition) 1.0 a pubsnumber 5 by měla být verzí 1.0 vydáním (release) 5, zkráceně 1.0-5.
fr_fr: Un ouvrage édition « 1.0 » et publication « 5 », sera la version 1.0, parution 5 (1.0-5).

source: The edition and pubsnumber are not tied to the <parameter>&lt;productnumber&gt;</parameter> tag also found in <filename>Book_Info.xml</filename>: <parameter>&lt;productnumber&gt;</parameter> denotes the version number of the product being documented or otherwise written about.
cs_cz: Tagy edition a pubsnumber nejsou svázány s tagem <parameter>&lt;productnumber&gt;</parameter>, který lze najít v <filename>Book_Info.xml</filename> rovněž: <parameter>&lt;productnumber&gt;</parameter> představuje číslo verze produktu, který se v knize dokumentuje nebo se o něm jinak píše.
fr_fr: Les numéros d'édition et de parution ne sont pas liés à la balise <parameter>&lt;productnumber&gt;</parameter> également trouvée dans <filename>Book_Info.xml</filename> : <parameter>&lt;productnumber&gt;</parameter> marque le numéro de version du produit documenté ou auquel se rapporte le document.

source: It is entirely possible to have a 2nd edition of a book pertaining to a particular version of a product.
cs_cz: Je zcela možné mít 2. vydání knihy vztahující se ke konkrétní verzi produktu.
fr_fr: Il est parfaitement possible d'avoir une deuxième édition d'un ouvrage se rapportant à une même version d'un produit.

source: In bibliography, two copies of a book are the same edition if they are printed using substantially the same type-set master plates or pages. ('Substantially' offers some allowance for typo corrections and other inconsequential changes.)
cs_cz: V bibliografii jsou dvě kopie knihy stejné vydání, jsou-li vytištěny za použití podstatně stejných type-set master desek nebo stránek. ('Podstatně' nabízí určitou toleranci pro opravy překlepů a další nezávažné změny.)
fr_fr: En bibliographie, deux copies d'un ouvrage sont une même édition si elles sont imprimées en utilisant essentiellement les mêmes pages ou planches maîtresses de composition (« essentiellement » vise la possibilité de corriger les fautes d'orthographe ou autres modifications sans conséquence).

source: Book collectors routinely conflate 'first edition' with 'first print run', while bibliographers pay attention to the text commonly placed in the front matter of a book, which calls a 2nd print run off the same (or substantially the same) plates a '1st edition, 2nd impression' or '1st edition, 2nd printing'.
cs_cz: Sběratelé knih běžně spojují 'první vydání' s 'prvním výtiskem', zatímco bibliografičtí pracovníci se zajímají o text běžně umístěný na obálce knihy, kteří označují 2. výtisk stejné (nebo podstatně stejné) desky za '1. vydání, 2. přetisk' nebo '1. vydání, 2. výtisk'.
fr_fr: Les collectionneurs de livres confondent systématiquement « première édition » avec « première impression », alors que les bibliographes font attention à ce qui est écrit en en-tête de l'ouvrage et ils distinguent une deuxième impression des mêmes (ou essentiellement les mêmes) planches avec « 1ère édition, 2e impression » ou « Réimpression de la 1ère édition ».

source: We recommend following bibliographic practice in this regard. When using <application>Publican</application> to re-publish a book from 'substantially the same XML', increment the <parameter>&lt;pubsnumber&gt;</parameter> tag, not the <parameter>&lt;edition&gt;</parameter> tag. It functions as a near-equivalent to the impression or printing number of traditional publishing.
cs_cz: Doporučujeme v této záležitosti dodržovat bibliografickou praxi. Používáte-li <application>Publican</application> k nové publikaci knihy z 'podstatně stejného XML', navyšte tag <parameter>&lt;pubsnumber&gt;</parameter>, nikoliv tag <parameter>&lt;edition&gt;</parameter>. Funguje totiž jako blízká obdoba přetisku nebo čísla výtisku v tradičním nakladatelství.
fr_fr: Nous recommandons de suivre la pratique des bibliographes à ce propos. Si vous utilisez <application>Publican</application> pour publier à nouveau un ouvrage à partir d'un « XML substantiellement identique », incrémentez la balise <parameter>&lt;pubsnumber&gt;</parameter>, et non la balise <parameter>&lt;edition&gt;</parameter>. Ce fonctionnement est sensiblement équivalent aux décomptes des éditions traditionnelles.

source: As for changing the edition number, we recommend changing this in the same circumstances traditional publishers change the edition of a work: when it is revised and re-written significantly. What constitutes significant, and how much re-writing is needed to increment an edition number by a whole number and how much is needed to increment it by one-tenth of a whole number, is a matter of editorial discretion.
cs_cz: Ohledně změny čísla vydání (edition) doporučujeme ho měnit za stejných okolností, za kterých tradiční nakladatelé mění vydání díla: je-li revidováno nebo významně přepracováno. Co představuje významně, a jak vysoká musí být míra přepracování, aby se zvýšilo celé nebo jen desetinné číslo vydání (edition), se ponechává na uvážení redakce.
fr_fr: De même que pour changer le numéro d'édition, nous recommandons la méthode de la publication traditionnelle pour le changement d'édition d'un ouvrage : s'il est revu et ré-écrit de manière significative. La mesure du « significatif » ou la quantité de réécriture nécessaire pour incrémenter d'un entier le numéro d'édition d'une unité comparée à celle nécessaire pour ne l'augmenter que d'une fraction est laissée à l'initiative du rédacteur.

source: <filename>Author_Group.xml</filename> is not required but is the standard place to record author, editor, artist and other credit details. The following is an example <filename>Author_Group.xml</filename> file:
cs_cz: <filename>Author_Group.xml</filename> není povinný, ale je standardním místem pro záznam o autorovi, redaktorovi, umělcovi a dalších podrobností uznání. Zde je ukázka souboru <filename>Author_Group.xml</filename>:
fr_fr: <filename>Author_Group.xml</filename> n'est pas obligatoire mais c'est le bon endroit pour enregistrer l'auteur, l'éditeur, l'artiste et autres détails à mettre au crédit de quelqu'un. Voici un exemple de fichier <filename>Author_Group.xml</filename> :

source: <filename>Author_Group.xml</filename> does not have to contain all of the above information: include as much or as little as required.
cs_cz: <filename>Author_Group.xml</filename> nemusí obsahovat všechny výše uvedené informace: uvěďte co nejvíce nebo co nejméně je potřeba.
fr_fr: <filename>Author_Group.xml</filename> n'a pas à contenir la totalité des informations ci-dessus : incorporez-en plus ou moins selon nécessité.

source: Articles and chapters
cs_cz: Články a kapitoly
fr_fr: Articles et chapitres

source: DocBook articles cannot contain chapters. If you use the <option>--type=article</option> option with <prompt>$</prompt> <command>publican create</command>, <application>Publican</application> does not create a <filename>Chapter.xml</filename> file. Use sections to organize content within articles.
cs_cz: Články DocBook nemohou obsahovat kapitoly (chapter). Použijete-li v <prompt>$</prompt> <command>publican create</command> volbu <option>--type=article</option>, <application>Publican</application> nevytvoří soubor <filename>Chapter.xml</filename>. K organizaci obsahu svého článku použijte oddíly (section).
fr_fr: Les articles DocBook ne peuvent pas être subdivisés en chapitres. Si vous vous servez de l'option <option>--type=article</option> avec <prompt>$</prompt> <command>publican create</command>, <application>Publican</application> ne crée pas de fichier <filename>Chapter.xml</filename>. Utilisez les sections pour organiser le contenu des articles.

source: Refer to <citetitle>DocBook: The Definitive Guide</citetitle> by Norman Walsh and Leonard Muellner available at <uri xlink:href="http://www.docbook.org/tdg/en/html/docbook.html" xmlns:xlink="http://www.w3.org/1999/xlink">http://www.docbook.org/tdg/en/html/docbook.html</uri> for details of the different ways that sets, books, articles, parts, chapters, and sections interact. In particular, note that articles can be stand-alone documents, or can be incorporated into books.
cs_cz: Podrobnosti o různých způsobech interakce sad, knih, článků, částí, kapitol a oddílů viz <citetitle>DocBook: The Definitive Guide</citetitle> od Norman Walsh a Leonard Muellner, dostupný na <ulink url="http://www.docbook.org/tdg/en/html/docbook.html" />. Zejména si všimněte, že články lze napsat jako samostatně stojící dokumenty, nebo je lze začlenit do knih.
fr_fr: Reportez-vous à l'ouvrage <citetitle>DocBook: The Definitive Guide</citetitle> par Norman Walsh et Leonard Muellner disponible à l'adresse <ulink url="http://www.docbook.org/tdg/en/html/docbook.html" /> pour plus de détails sur les diverses manières dont collections, ouvrages, articles, parties, chapitres et paragraphes interagissent. En particulier, notez que les articles peuvent être des documents en soi ou bien peuvent être incorporés dans des ouvrages.

source: The <filename>Chapter.xml</filename> file is a template for creating chapter files. Chapter files contain the content that make up a book. The following is a chapter template (<filename>Chapter.xml</filename>) that is created by the <prompt>$</prompt> <command>publican create</command> command. Note the <filename>DOCTYPE</filename> is set to <filename>chapter</filename>:
cs_cz: Soubor <filename>Chapter.xml</filename> je šablona pro vytváření souborů kapitol. Soubory kapitol obsahují obsah, který tvoří knihu. Následuje šablona kapitoly (<filename>Chapter.xml</filename>) vytvořená příkazem <prompt>$</prompt> <command>publican create</command>. Všimněte si, že <filename>DOCTYPE</filename> je nastaven na <filename>chapter</filename>:
fr_fr: Le fichier <filename>Chapter.xml</filename> est un canevas de création des fichiers « chapitres ». Les fichiers chapitres sont le contenu constitutif d'un ouvrage. Voici un canevas de découpage en chapitres (<filename>Chapter.xml</filename>) créé par la commande <prompt>$</prompt> <command>publican create</command>. Notez que <filename>DOCTYPE</filename> est égal à <filename>chapter</filename> :

source: This chapter has two sections, <filename>Section 1 Test</filename> and <filename>Section 2 Test</filename>. Refer to <uri xlink:href="http://docbook.org/tdg/en/html/chapter.html" xmlns:xlink="http://www.w3.org/1999/xlink">http://docbook.org/tdg/en/html/chapter.html</uri> for further information about chapters.
cs_cz: Tato kapitola má dva oddíly, <filename>Section 1 Test</filename> and <filename>Section 2 Test</filename>. Další informace o kapitolách viz <ulink url="http://docbook.org/tdg/en/html/chapter.html" />
fr_fr: Ce chapitre comporte deux sections, <filename>Section 1 Test</filename> et <filename>Section 2 Test</filename>. Voyez la page <ulink url="http://docbook.org/tdg/en/html/chapter.html" /> pour plus d'informations à propos des chapitres.

source: The chapter file should be renamed to reflect the chapter subject. For example, a chapter on product installation could be named <filename>Installation.xml</filename>, whereas a chapter on setting up a piece of software would be better called <filename>Setup.xml</filename> or <filename>Configuration.xml</filename>.
cs_cz: Soubor kapitoly by měl být přejmenován tak, aby odrážel předmět kapitoly. Na příklad kapitola o instalaci produktu by mohla nést název <filename>Instalace.xml</filename>, zatímco kapitola o nastavení části softwaru by měla být nazvána <filename>Nastaveni.xml</filename> nebo <filename>Konfigurace.xml</filename>.
fr_fr: Le fichier « chapitre » peut être renommé pour refléter son objet. Ainsi, un chapitre à propos de l'installation d'un produit sera nommé <filename>Installation.xml</filename> par exemple, alors qu'un chapitre sur le paramétrage d'un logiciel sera plutôt appelé <filename>Setup.xml</filename> ou <filename>Configuration.xml</filename>.

source: <replaceable>Doc_Name</replaceable>.xml
cs_cz: <replaceable>Nazev_Dok</replaceable>.xml
fr_fr: <replaceable>Nom_document</replaceable>.xml

source: The <filename><replaceable>Doc_Name</replaceable>.xml</filename> file contains <literal>xi:include</literal> directives to include the other necessary XML files for the document, including chapters or sections contained in other XML files. For example, a book's <filename><replaceable>Doc_Name</replaceable>.xml</filename> file brings together chapters that are contained in separate XML files.
cs_cz: Soubor <filename><replaceable>Nazev_Dok</replaceable>.xml</filename> obsahuje direktivy <literal>xi:include</literal>, které připojí další soubory XML nezbytné pro dokument, včetně kapitol nebo oddílů obsažených v jiných XML souborech. Na příklad soubor knihy <filename><replaceable>Nazev_Dok</replaceable>.xml</filename> shromažďuje kapitoly, které jsou obsaženy v oddělených souborech XML.
fr_fr: Le fichier <filename><replaceable>Nom_document</replaceable>.xml</filename> contient des directives <literal>xi:include</literal> pour incorporer les autres fichiers XML constitutifs du document, y compris des chapitres ou des sections contenues dans d'autres fichiers XML. Ainsi, un fichier <filename><replaceable>Nom_document</replaceable>.xml</filename> d'ouvrage rassemble les chapitres contenus dans plusieurs fichiers XML distincts.

source: The following is an example <filename><replaceable>Doc_Name</replaceable>.xml</filename> file that describes a DocBook book — note the <parameter>DOCTYPE</parameter> is set to <literal>book</literal>.
cs_cz: Níže je uveden příklad souboru <filename><replaceable>Nazev_Dok</replaceable>.xml</filename>, který popisuje knihu DocBook — všimněte si, že <parameter>DOCTYPE</parameter> je nastaven na <literal>book</literal>.
fr_fr: Voici un exemple de fichier <filename><replaceable>Nom_document</replaceable>.xml</filename> décrivant un livre DocBook — notez que le paramètre <parameter>DOCTYPE</parameter> est égal à <literal>book</literal>.

source: A DocBook book
cs_cz: Kniha DocBook
fr_fr: Un livre DocBook

source: This example loads the <filename>Book_Info.xml</filename>, <filename>Preface.xml</filename>, <filename>Chapter.xml</filename>, and <filename>Appendix.xml</filename> XML files.
cs_cz: Tento příklad načítá soubory XML <filename>Book_Info.xml</filename>, <filename>Preface.xml</filename>, <filename>Chapter.xml</filename> a <filename>Appendix.xml</filename>.
fr_fr: Cet exemple charge les fichiers XML <filename>Book_Info.xml</filename>, <filename>Preface.xml</filename>, <filename>Chapter.xml</filename> et <filename>Appendix.xml</filename>.

source: The order in which chapters are listed matters. When this example book is built, <filename>Book_Info.xml</filename> will precede <filename>Preface.xml</filename> which will precede <filename>Chapter.xml</filename>, and so on.
cs_cz: Na pořadí, ve kterém jsou kapitoly seřazeny, záleží. Při sestavování této ukázkové knihy předchází <filename>Book_Info.xml</filename> před <filename>Preface.xml</filename>, který předchází před <filename>Chapter.xml</filename> atd.
fr_fr: L'ordre dans lequel les chapitres sont énumérés a de l'importance. Quand cet exemple de livre est construit, <filename>Book_Info.xml</filename> doit précéder <filename>Preface.xml</filename>, qui lui-même doit précéder <filename>Chapter.xml</filename>, etc.

source: The <filename><replaceable>Doc_Name</replaceable>.xml</filename> file is not limited to using <literal>xi:include</literal> directives. You can create documents with a single XML file. The following is an example of a book created using a single XML file:
cs_cz: Soubor <filename><replaceable>Nazev_Dok</replaceable>.xml</filename> není nijak omezen, co se týče použití direktiv <literal>xi:include</literal>. Lze vytvořit dokument jen s jedním souborem XML. Následuje příklad knihy vytvořené jediným souborem XML.
fr_fr: Le fichier <filename><replaceable>Nom_document</replaceable>.xml</filename> n'est pas limité à l'utilisation de directives <literal>xi:include</literal>. Vous pouvez créer des documents avec un seul fichier XML. Voici un exemple d'ouvrage créé avec un seul fichier XML :

source: <replaceable>Doc_Name</replaceable>.ent
cs_cz: <replaceable>Nazev_Dok</replaceable>.ent
fr_fr: <replaceable>Nom_document</replaceable>.ent
