Repository: jwulf/publican
Catalog: Users_Guide/*/Files_*_the_Book_Directory.po
Languages: cs_cz, fr_fr

source: controls the section depth at which <application>Publican</application> will generate a table of contents. At the default value of <literal>0</literal>, <application>Publican</application> will generate tables of contents at the start of the document and in parts, chapters, and appendixes, but not in sections. If (for example) the value is set to <literal>1</literal>, tables of contents also appear in each "level 1" section, such as sections 1.1, 1.2, 2.1, and 2.2. If set to <literal>2</literal>, tables of contents also appear in "level 2" sections, such as sections 1.1.1, 1.1.2, and 1.2.1.
cs_cz: řídí hloubku oddílů, u nichž <application>Publican</application> vygeneruje obsah. Při výchozí hodnotě <literal>0</literal> vygeneruje <application>Publican</application> obsah na začátku dokumentu a v částech, kapitolách a přílohách, nikoliv však v oddílech. Je-li na příklad hodnota nastavena na <literal>1</literal>, obsahy se objeví rovněž v každém oddílu "úroveň 1", tedy oddílech 1.1, 1.2, 2.1 a 2.2. Je-li nastavena na <literal>2</literal>, obsahy se budou rovněž nacházet v oddílech "úroveň 2", např. 1.1.1, 1.1.2 a 1.2.1.
fr_fr: contrôle la profondeur de subdivision avec laquelle <application>Publican</application> créera la table des matières. La valeur par défaut étant <literal>0</literal>, <application>Publican</application> génère des tables des matières en début de document et la divise en parties, chapitres et annexes, mais pas en paragraphes. Si (par exemple) la valeur est fixée à <literal>1</literal>, apparaissent également dans la table des matières les sections de « niveau 1 », comme les paragraphes 1.1, 1.2, 2.1 et 2.2. Si elle fixée à <literal>2</literal>, sont mentionnées les sections de « niveau 2 », comme les paragraphes 1.1.1, 1.1.2 et 1.2.1.

source: Setting the section depth at which tables of contents appear
cs_cz: Nastavení hloubky oddílů, ve které se vytvoří obsah
fr_fr: Définition de la profondeur de subdivision de la table des matières

source: generate_section_toc_level: 0 (default)
fr_fr: generate_section_toc_level: 0 (défaut)

source: <application>Publican</application> will generate tables of contents at the start of the document and in parts, chapters, and appendixes, but not in sections.
cs_cz: <application>Publican</application> vytvoří obsahy na začátku dokumentu a v částech, kapitolách a přílohách, nikoliv však v oddílech.
fr_fr: <application>Publican</application> génère une table des matières en début de document divisée en parties, chapitres et annexes, mais pas en paragraphes.

source: <application>Publican</application> will generate tables of contents also at the start of each "level 1" section, such as sections 1.1, 1.2 … 2.1, 2.2 …
cs_cz: <application>Publican</application> vytvoří obsahy také na začátku každého oddílu "úroveň 1", jako např. oddílu 1.1, 1.2 &hellip; 2.1, 2.2 &hellip;
fr_fr: <application>Publican</application> génère une table des matières également en début de chaque section de « niveau 1 », comme les paragraphes 1.1, 1.2 &hellip; 2.1, 2.2 &hellip;

source: <application>Publican</application> will generate tables of contents also at the start of each "level 2" section, such as as sections 1.1.1, 1.1.2. 1.1.3 … 1.2.1., 1.2.2, 1.2.3 …
cs_cz: <application>Publican</application> vytvoří obsahy také na začátku každého oddílu "úroveň 2", tedy např. 1.1.1, 1.1.2. 1.1.3 &hellip; 1.2.1., 1.2.2, 1.2.3 &hellip;
fr_fr: <application>Publican</application> génère une table des matières également en début de chaque section de « niveau 2 », comme les paragraphes 1.1.1, 1.1.2, 1.1.3 &hellip; 1.2.1, 1.2.2; 1.2.3 &hellip;

source: specifies translations to ignore as comma-separated XML language codes; for example, <literal>es-ES,it-IT</literal>. If you build or package a book for a language filtered by this parameter, <application>Publican</application> ignores any translations that exist for this language, and builds or packages the book in the language of the original XML instead. Refer to <xref linkend="sect-Publican-Users_Guide-Preparing_a_document_for_translation" />, and to <xref linkend="appe-Publican-Users_Guide-Language_codes" />.
cs_cz: uvádí překlady, v podobě čárkou oddělených XML kódů jazyků, které budou ignorovány, na příklad <literal>es-ES,it-IT</literal>. Sestavíte-li nebo zabalíte-li knihu v jazyku filtrovaném tímto parametrem, <application>Publican</application> pro tento jazyk ignoruje všechny existující překlady a na místo toho sestaví nebo zabalí knihu v jazyku originálního XML. Viz <xref linkend="sect-Publican-Users_Guide-Preparing_a_document_for_translation" /> a <xref linkend="appe-Publican-Users_Guide-Language_codes" />.
fr_fr: indique les langues à ignorer lors de la traduction sous forme de codes de langue XML séparés par des virgules : par exemple, <literal>es-ES,it-IT</literal>. Si vous construisez ou empaquetez un ouvrage pour une langue filtrée avec ce paramètre, <application>Publican</application> ignore toute traduction existante pour cette langue et, à la place, construit ou empaquette l'ouvrage dans la langue originelle du XML. Voyez la <xref linkend="sect-Publican-Users_Guide-Preparing_a_document_for_translation" /> et l'<xref linkend="appe-Publican-Users_Guide-Language_codes" />.

source: <parameter>img_dir</parameter>
fr_fr: <parameter>tmp_dir</parameter>

source: the directory <application>Publican</application> will process images from. (Default: <literal>images</literal>)
cs_cz: adresář, ze kterého bude <application>Publican</application> zpracovávat obrazové soubory. (Výchozí: <literal>images</literal>
fr_fr: Le répertoire dont <application>Publican</application> extraira les images pour traitement. (Par défault: <literal>images</literal>)

source: overrides the default Info file. Specifies where <application>Publican</application> looks for info fields. Use the full filename without the path.
cs_cz: potlačí výchozí soubor Info. Uvádí, kde bude <application>Publican</application> hledat informační pole. Použijte celý název bez cesty.
fr_fr: écrase le fichier Info par défaut. Ce fichier indique là où <application>Publican</application> doit rechercher les champs des informations. Paramétrez l'option avec le nom complet du fichier sans le chemin.

source: specifies the license this package uses. By default, <application>Publican</application> selects the GNU Free Documentation License (GFDL). Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
cs_cz: uvádí licenci, kterou použije balíček. Ve výchozím nastavení <application>Publican</application> zvolí GNU Free Documentation License (GDFL). Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
fr_fr: précise la licence utilisée pour le paquet. Par défaut, <application>Publican</application> choisit la « GNU Free Documentation License (GFDL) ». Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.

source: specifies the name of the XML file in your document that contains the root XML node <tag>&lt;article&gt;</tag>, <tag>&lt;book&gt;</tag>, or <tag>&lt;set&gt;</tag>, and the name of the corresponding <filename>.ent</filename> file that contains the document's entities. For example, if you set <literal>mainfile: master</literal>, <application>Publican</application> looks for the root XML node in <filename>master.xml</filename> and the document entities in <filename>master.ent</filename>.
cs_cz: uvádí název souboru XML v dokumentu, který obsahuje kořenový uzel XML <sgmltag>&lt;article&gt;</sgmltag>, <sgmltag>&lt;book&gt;</sgmltag> nebo <sgmltag>&lt;set&gt;</sgmltag>, a název příslušného souboru <filename>.ent</filename>, který obsahuje entity dokumentu. Na příklad nastavíte-li <literal>mainfile: master</literal>, <application>Publican</application> hledá kořenový uzel XML v <filename>master.xml</filename> a entity dokumentu v <filename>master.ent</filename>.
fr_fr: définit le nom du fichier XML du document contenant le nœud racine XML avec la balise <sgmltag>&lt;article&gt;</sgmltag>, <sgmltag>&lt;book&gt;</sgmltag> ou <sgmltag>&lt;set&gt;</sgmltag>, ainsi que le nom du fichier <filename>.ent</filename> correspondant contenant les entités du document. Par exemple, si vous indiquez <literal>mainfile: master</literal>, <application>Publican</application> recherche le nœud racine XML dans <filename>master.xml</filename> et les entités du document dans <filename>master.ent</filename>.

source: If <parameter>mainfile</parameter> is not set, <application>Publican</application> looks for the root XML node in a file that matches the <tag>&lt;title&gt;</tag> of the document set in the <filename>Article_Info.xml</filename>, <filename>Book_Info.xml</filename>, or <filename>Set_Info.xml</filename> file, and looks for the document entities in a file with a corresponding name.
cs_cz: Není-li <parameter>mainfile</parameter> nastaven, <application>Publican</application> hledá kořenový uzel XML v souboru, který odpovídá tagu <sgmltag>&lt;title&gt;</sgmltag> dokumentu nastaveném v <filename>Article_Info.xml</filename>, <filename>Book_Info.xml</filename> nebo <filename>Set_Info.xml</filename>, a entity v souboru s odpovídajícím názvem.
fr_fr: Si le paramètre <parameter>mainfile</parameter> n'est pas renseigné, <application>Publican</application> recherche le nœud racine XML dans un fichier, dont le nom correspond à la valeur donnée à la balise <sgmltag>&lt;title&gt;</sgmltag> pour le document, dans <filename>Article_Info.xml</filename>, <filename>Book_Info.xml</filename> ou <filename>Set_Info.xml</filename> ; il recherche les entités du document dans un fichier avec le nom correspondant.

source: the desktop menu category (as defined by a corresponding <filename>.menu</filename> file) in which a document should appear when installed from a desktop RPM package. Refer to <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.
cs_cz: kategorie nabídky pro stolní počítač (definovaná příslušným souborem <filename>.menu</filename>), do které se umístí dokument, je-li nainstalován z balíčku RPM pro stolní počítač. Viz <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.
fr_fr: la catégorie de « menu de bureau » (définie par le fichier <filename>.menu</filename> correspondant) dans laquelle un document doit s'afficher quand il est installé avec un paquet RPM de bureau. Voyez la <xref linkend="sect-Publican-Users_Guide-Desktop_menu_entries_for_documents" />.

source: specifies the operating system for which to build packages. <application>Publican</application> appends the value that you provide here to the RPM packages that it builds. For example, <literal>.fc15</literal> for Fedora 15. The default value is <literal>.el5</literal>, which signifies Red Hat Enterprise Linux 5 and operating systems derived from it. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" /> and <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" />.
cs_cz: uvádí operační systém, pro který se sestaví balíček. <application>Publican</application> připojí hodnotu, kterou zde uvedete, k balíčkům RPM, které sestavuje. Na příklad <literal>.fc15</literal> pro Fedoru&nbsp;15. Výchozí hodnotou je <literal>.el5</literal>, která označuje Red Hat Enterprise Linux 5 a z něho odvozené operační systémy. Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" /> a <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" />.
fr_fr: définit le système d'exploitation pour lequel construire des paquets. <application>Publican</application> ajoute la valeur fournie ici aux paquets RPM qu'il construit. Par exemple, <literal>.fc15</literal> pour Fedora&nbsp;15. La valeur par défaut est <literal>.el5</literal>, qui signifie « Red Hat Enterprise Linux 5 » et systèmes d'exploitation dérivés. Voyez la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" /> et la <xref linkend="sect-Publican-Users_Guide-Packaging_a_brand" />.

source: provides a URL for the product to which this document applies. In HTML output, <application>Publican</application> links to this URL at the top left of each page, through the <filename>image_left.png</filename> image in the <filename>Common_Content/images</filename> directory for the brand. This parameter defaults to <literal>https://fedorahosted.org/publican</literal>.
cs_cz: poskytuje URL k produktu, ke kterému se dokument vztahuje. Ve výstupu HTML umístí <application>Publican</application> odkaz na toto URL do levé horní části každé stránky, prostřednictvím obrazového souboru <filename>image_left.png</filename> v adresáři <filename>Common_Content/images</filename> grafické úpravy. Výchozí hodnotou tohoto parametru je <literal>https://fedorahosted.org/publican</literal>.
fr_fr: indique un URL pour le produit auquel ce document s'applique. Dans une sortie HTML, <application>Publican</application> établit un lien sur cet URL, à gauche en tête de chaque page, par l'intermédiaire de l'image <filename>image_left.png</filename> du répertoire <filename>Common_Content/images</filename> de l'estampille. Par défaut, ce paramètre renvoie à <literal>https://fedorahosted.org/publican</literal>.

source: specifies the product to which this documentation applies. If set, this value overrides the content of the <tag>&lt;productname&gt;</tag> tag in the <filename>Book_Info.xml</filename> file when you package a document. This value must include only contain upper- and lower-case un-accented letters, digits, and the underscore and space characters (‘a–z’, ‘A–Z’, ‘0’–‘9’, and ‘_’ and ‘ ’).
cs_cz: uvádí produkt, ke kterému se dokument vztahuje. Je-li nastaven, hodnota při balení dokumentu potlačuje obsah tagu <sgmltag>&lt;productname&gt;</sgmltag> v souboru <filename>Book_Info.xml</filename>. Hodnota musí obsahovat pouze malá a velká písmena bez diakritiky, číslice, podtržítka a mezery (&lsquo;a&ndash;z&rsquo;, &lsquo;A&ndash;Z&rsquo;, &lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;, &lsquo;_&rsquo; a &lsquo;&nbsp;&rsquo;).
fr_fr: désigne le produit auquel cette documentation s'applique. Si elle est définie, cette valeur prend le pas sur le contenu désigné par la balise <sgmltag>&lt;productname&gt;</sgmltag> du fichier <filename>Book_Info.xml</filename> quand vous empaquetez un document. Cette valeur ne doit comporter que des lettres non accentuées, minuscules ou majuscules, des chiffres et les caractères souligné et espace (&lsquo;a&ndash;z&rsquo;, &lsquo;A&ndash;Z&rsquo;, &lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;, &lsquo;_&rsquo; et &lsquo;&nbsp;&rsquo;).

source: specifies the release number of this package. If set, this value overrides the value of <tag>&lt;pubsnumber&gt;</tag> in the <filename>Book_Info.xml</filename> file when you package a document. This value must include only digits (‘0’–‘9’).
cs_cz: uvádí číslo vydání balíčku. Je-li nastaven, hodnota při balení dokumentu potlačuje hodnotu <sgmltag>&lt;pubsnumber&gt;</sgmltag> v souboru <filename>Book_Info.xml</filename>. Hodnota smí obsahovat pouze číslice (&lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;).
fr_fr: définit le numéro de parution de ce paquet. Si définie, cette valeur écrase celle de <sgmltag>&lt;pubsnumber&gt;</sgmltag> dans le fichier <filename>Book_Info.xml</filename> quand vous empaquetez un document. Cette valeur ne doit comporter que des chiffres (&lsquo;0&rsquo;&ndash;&lsquo;9&rsquo;).

source: specifies the repository from which to fetch remote books that form part of a distributed set. Refer to <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.
cs_cz: uvádí repozitář, ze kterého stáhnout knihy, které tvoří součást distribuované sady, na dálku. Viz <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.
fr_fr: définit le dépôt à partir duquel extraire les ouvrages éclatés faisant partie d'un ensemble distribué. Voyez la <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.

source: <parameter>rev_dir</parameter>
fr_fr: <parameter>rev_file</parameter>

source: override the default Revision History file direction. By default <application>Publican</application> assumes the Revision History is sorted in descending order, newest versions at teh top, if you wish to change this and have the oldest revisions at the top, then set this parameter to <literal>asc</literal> or <literal>ascending</literal>.
cs_cz: potlačuje výchozí směr řazení souboru Revision History (historie revizí). Ve výchozím nastavení předpokládá <application>Publican</application>, že Revision History je řazen sestupně, nové verze nejdříve, přejete-li si toto změnit a mít nejdříve nejstarší verze, nastavte pak tento parametr na <literal>asc</literal> nebo <literal>ascending</literal>.
fr_fr: inverse le sens par défaut du fichier d'historique de révision. Par défaut, <application>Publican</application> suppose que l'historique de révision est trié dans l'ordre décroissant, les versions les plus récentes en haut. Si vous souhaitez modifier cet ordre et avoir les révisions les plus anciennes en début, fixez ce paramètre à la valeur <literal>asc</literal> ou <literal>ascending</literal>.

source: override the default Revision History file. Specifies where <application>Publican</application> looks for revision fields. Use the full filename without the path. When combined with the <application>Publican</application> action add_revision, it enables you to build a book without a <filename>Revision_History.xml</filename>.
cs_cz: potlačuje výchozí soubor Revision History. Uvádí, kde má <application>Publican</application> hledat pole revizí. Použijte celý název bez cesty. Společně s akcí add_revision <application>Publicanu</application> vám umožňuje sestavit knihu bez <filename>Revision_History.xml</filename>.
fr_fr: écrase le fichier « Revision History » par défaut. Il définit l'emplacement où <application>Publican</application> doit rechercher les champs des révisions. Utilisez le nom complet du fichier sans chemin. Combiné à l'action de « add_revision » de <application>Publican</application>, il permet de construire un ouvrage sans fichier <filename>Revision_History.xml</filename>.

source: specifies the version control (or <firstterm>source code management</firstterm>) system used in the repository in that stores the remote books in a distributed set. At present, <application>Publican</application> can use only <application>Subversion</application> (SVN), and therefore uses <literal>SVN</literal> as its default setting. Refer to <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.
cs_cz: uvádí systém pro správu verzí (též <firstterm>source code management</firstterm>) používaný v repozitáři, do kterého jsou ukládány vzdálené knihy v distribuované sadě. V současnosti dokáže <application>Publican</application> pracovat pouze se <application>Subversion</application> (SVN), a proto jako výchozí hodnotu používá <literal>SVN</literal>. Viz <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.
fr_fr: définit le système de contrôle de version (ou de <firstterm>gestion du code source</firstterm>) utilisé dans le dépôt qui stocke les ouvrages distants dans un ensemble distribué. Actuellement, <application>Publican</application> ne peut utiliser que <application>Subversion</application> (SVN), et donc utilise <literal>SVN</literal> comme réglage par défaut. Reportez-vous à la <xref linkend="sect-Publican-Users_Guide-Using_sets-Distributed_sets" />.

source: controls whether to display DocBook <tag>&lt;remark&gt;</tag>s in transformed output. By default, this value is set to <literal>0</literal>, which causes <application>Publican</application> to hide remarks. Set this value to <literal>1</literal> to display remarks. In <application>Publican</application>'s <literal>common</literal> brand, displayed remarks are highlighted in magenta.
cs_cz: řídí, zda se mají v převedeném výstupu zobrazit poznámky typu <sgmltag>&lt;remark&gt;</sgmltag> DocBook. Jako výchozí je tato hodnota nastavena na <literal>0</literal>, která způsobí, že <application>Publican</application> poznámky nezobrazí. Chcete-li poznámky zobrazit, nastavte ji na <literal>1</literal>. V grafickém stylu <literal>common</literal> <application>Publicanu</application> jsou poznámky zvýrazněny purpurovou barvou.
fr_fr: contrôle l'affichage des textes sous balise <sgmltag>&lt;remark&gt;</sgmltag> de Docbook dans la sortie du traitement. Par défaut, cette valeur est égale à <literal>0</literal> ; <application>Publican</application> dissimule donc les remarques. Fixez cette valeur à <literal>1</literal> pour les afficher. Avec l'estampille <literal>common</literal> de <application>Publican</application>, les remarques affichées sont surlignées en magenta.

source: override the default sort weighting for books in a <application>Publican</application> website. Books are displayed on the website in descending sort order. For example, a book with sort order 10 appears before a book with sort order 5. By default, this value is set to 50.
cs_cz: potlačuje výchozí vážené řazení knih ve webové stránce <application>Publicanu</application>. Knihy jsou zobrazeny na webové stránce v sestupném pořadí. Na příklad kniha s vahou řazení 10 se zobrazí před knihou s vahou 5. Ve výchozím nastavení je tato hodnota nastavena na 50.
fr_fr: redéfinit le poids par défaut des ouvrages pour leur tri dans un site Web <application>Publican</application>. Les ouvrages s'affichent sur le site Web par poids décroissant. Ainsi, un ouvrage avec un poids de tri 10 apparaît avant un ouvrage de poids 5. Par défaut, cette valeur est égale à 50.

source: specifies the URL at which to find tarballs of source files. This parameter provides the <literal>Source:</literal> field in the header of an RPM spec file. Refer to <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
cs_cz: uvádí URL, na kterém lze nalézt tarové archivy zdrojových souborů. Tento parametr poskytuje pole <literal>Source:</literal> v hlavičce souboru spec RPM. Viz <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.
fr_fr: définit l'URL à laquelle trouver les archives « tar » des fichiers sources. Ce paramètre renseigne le champ <literal>Source:</literal> dans l'en-tête du fichier spec RPM. Voyez la <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />.

source: specifies the directory for <application>Publican</application> output. By default, this is set to <literal>tmp</literal>, which creates a directory named <filename>tmp</filename> inside the directory that holds your article or book.
cs_cz: uvádí adresář pro výstup <application>Publicanu</application>. Ve výchozím nastavení má hodnotu <literal>tmp</literal>, který vytvoří adresář s názvem <filename>tmp</filename> uvnitř adresáře, ve kterém se nachází váš článek nebo kniha.
fr_fr: définit le répertoire des sorties de <application>Publican</application>. Par défaut, le nom de ce répertoire est <literal>tmp</literal> ; il est créé à l'intérieur du répertoire de l'ouvrage ou de l'article.

source: specifies the path to <application>Publican</application> templates. By default, this is set to <filename>/usr/share/publican/templates</filename>.
cs_cz: uvádí cestu k šablonám <application>Publicanu</application>. Ve výchozím nastavení má hodnotu <filename>/usr/share/publican/templates</filename>.
fr_fr: définit le chemin des modèles <application>Publican</application>. Par défaut : <filename>/usr/share/publican/templates</filename>.
