Repository: jwulf/publican
Catalog: Users_Guide/*/Packaging_a_brand.po
Languages: cs_cz, fr_fr

source: Packaging a brand
cs_cz: Balení grafické úpravy
fr_fr: Empaquetage d'une marque

source: After you create a brand (as described in <xref linkend="sect-Publican-Users_Guide-Creating_a_brand" />), <application>Publican</application> can help you to distribute the brand to members of your documentation project as <firstterm>RPM packages</firstterm>. RPM packages are used to distribute software to computers with Linux operating systems that use the <application>RPM Package Manager</application>. These operating systems include Red Hat Enterprise Linux, Fedora, Mandriva Linux, SUSE Linux Enterprise, openSUSE, Turbolinux, and Yellow Dog Linux, to name just a few.
cs_cz: Poté, co vytvoříte grafickou úpravu (popsáno v <xref linkend="sect-Publican-Users_Guide-Creating_a_brand" />), <application>Publican</application> vám může pomoci s jejím rozšířením mezi členy vašeho dokumentačního projektu, jako <firstterm>balíček RPM</firstterm>. Balíčky RPM jsou používány k šíření softwaru na počítače s operačními systémy Linux, které používají <application>Správce balíčků RPM</application>. Mezi těmito operačními systémy jsou Red Hat Enterprise Linux, Fedora, Mandriva Linux, SUSE Linux Enterprise, openSUSE, Turbolinux, Yellow Dog Linux, a další.

source: <application>Publican</application> can produce both <firstterm>source RPM packages</firstterm> (<firstterm>SRPM packages</firstterm>) and <firstterm>binary RPM packages</firstterm>. As part of this process, it also creates the <firstterm>spec file</firstterm> — the file that contains the details of how a package is configured and installed.
cs_cz: <application>Publican</application> může vytvářet jak <firstterm>zdrojové balíčky RPM</firstterm> (<firstterm>balíčky SRPM</firstterm>), tak <firstterm>binární balíčky RPM</firstterm>. Jako součást tohoto procesu vytváří také <firstterm>soubor spec</firstterm> — soubor, který obsahuje podrobnosti o tom, jak je balíček konfigurován a instalován.
fr_fr: <application>Publican</application> produit à la fois des <firstterm>paquets RPM source</firstterm> (<firstterm>paquets SRPM</firstterm>) et des <firstterm>paquets RPM binaires</firstterm>. Faisant partie du processus, il crée également le <firstterm>fichier spec</firstterm> — fichier contenant les précisions sur la manière d'installer et configurer le paquet.

source: SRPM packages contain the source code used to generate software rather than the software itself. To use an SRPM package, a computer must <firstterm>compile</firstterm> the source code into software. SRPM packages of <application>Publican</application> brands contain the configuration files, XML files, and image files that define the brand in its original language, plus the PO files that generate the Common Content files in translated languages. You cannot install documentation directly from SRPM packages with current versions of the <application>RPM Package Manager</application>.
cs_cz: Balíčky SRPM obsahují místo samotného softwaru zdrojový kód, ze kterého se software generuje. Aby se dal balíček SRPM použít, počítač musí zdrojový kód <firstterm>přeložit</firstterm> do softwaru. Balíčky SRPM grafických úprav <application>Publicanu</application> obsahují konfigurační soubory, soubory XML a obrazové soubory, které definují grafickou úpravu ve svém původním jazyce, plus soubory PO, které generují soubory Common Content u přeložených jazyků. Nelze instalovat dokumentaci přímo z balíčků SRPM se současnými verzemi <application>Správce balíčků RPM</application>.
fr_fr: Les paquets SRPM contiennent le code source utilisé pour créer le logiciel au lieu du logiciel lui-même. Pour utiliser un paquet SRPM, l'ordinateur doit <firstterm>compiler</firstterm> le code source en logiciel. Les paquets SRPM des marques <application>Publican</application> contiennent les fichiers de configuration, des fichiers XML et des fichiers image qui définissent la marque dans sa langue d'origine, plus des fichiers PO qui génèrent les fichiers « Common Content » dans les langues traduites. Vous ne pouvez pas installer directement une documentation à partir de paquets SRPM avec des versions actuelles du <application>Gestionnaire de paquets RPM</application>.

source: Conversely, binary RPM packages contain software — in this case, a <application>Publican</application> brand — that is ready to copy to a location in the computer's file system and use immediately. The contents of the binary RPM package do not need to be compiled by the computer onto which they are installed, and therefore, the computer does not need to have <application>Publican</application> installed.
cs_cz: Naopak binární balíčky RPM obsahují software — v tomto případě grafickou úpravu <application>Publicanu</application> — ten je připraven ke zkopírování do místa v souborovém systému počítače a okamžitému použití. Obsah binárního balíčku RPM se nemusí překládat počítačem, na kterém jsou instalovány, a proto tento počítač nemusí mít nainstalován ani <application>Publican</application>.
fr_fr: À l'opposé, des paquets RPM binaires contiennent un logiciel — soit dans notre cas, une marque <application>Publican</application> — prêt à être copié à un certain emplacement dans le système de fichiers du l'ordinateur ; il est utilisable immédiatement. Le contenu du paquet RPM binaire n'a pas besoin d'être compilé par l'ordinateur sur lequel il est installé. Donc, il n'est pas nécessaire d'avoir installé <application>Publican</application>.

source: To package a brand, use the <prompt>$</prompt> <command>publican package</command> command in the brand directory. When used without any further options, <application>Publican</application> produces an SRPM package. The options for packaging a brand are as follows:
cs_cz: Chcete-li zabalit grafickou úpravu, použijte příkaz <prompt>$</prompt> <command>publican package</command> v adresáři grafické úpravy. Je-li příkaz použit bez dalších voleb, <application>Publican</application> vytvoří balíček SRPM. Volby pro zabalení grafické úpravy jsou tyto:

source: specifies that <application>Publican</application> should build the package as a binary RPM package.
cs_cz: uvádí, aby <application>Publican</application> sestavil balíček jako binární balíček RPM.
fr_fr: demande à <application>Publican</application> de construire le paquet en tant que paquet RPM binaire.

source: specifies that <application>Publican</application> should push the completed package to <application>Brew</application>. <application>Brew</application> is the build system used internally by Red Hat; this option is meaningless outside Red Hat.
cs_cz: uvádí, aby <application>Publican</application> odeslal dokončený balíček do <application>Brew</application>. <application>Brew</application> je sestavovací systém, který je interně používán ve společnosti Red Hat; tato volba nemá význam mimo Red Hat.
fr_fr: indique que <application>Publican</application> doit charger le paquet complété sur <application>Brew</application>. <application>Brew</application> est le système de construction utilisé en interne par Red Hat ; cette option est sans signification en dehors de Red Hat.

source: when used together with the <option>--brew</option> option, specifies that a SRPM package should be built as a <firstterm>scratch build</firstterm> when sent to <application>Brew</application>. Scratch builds are used to verify that a SRPM package is structured correctly, without updating the package database to use the resulting package.
cs_cz: spolu s volbou <option>--brew</option> stanoví, aby byl balíček SRPM po odeslání do <application>Brew</application> sestaven jako <firstterm>náčrt sestavení</firstterm>. Náčrty (scratch) sestavení se využívají k ověření, zda je balíček SRPM správně strukturován, bez oznámení databázi balíčků, aby výsledný balíček používala.
fr_fr: utilisée conjointement avec l'option <option>--brew</option>, indique que le paquet SRPM doit avoir été construit <firstterm>à partir de zéro</firstterm> lorsqu'il est envoyé à <application>Brew</application>. Les reconstructions complètes, sans mise à jour de la base de données du paquet à utiliser pour le paquet résultant, s'utilisent pour s'assurer que le paquet SRPM est correctement structuré.

source: The <option>--lang</option>, <option>--desktop</option> and <option>--short_sighted</option> options that apply when you package books (described in <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" />) are meaningless when you package brands. In particular, note that although the <option>--lang</option> option is mandatory when you package a book, you do not need to use it when you package a brand.
cs_cz: Volby <option>--lang</option>, <option>--desktop</option> a <option>--short_sighted</option>, které se uplatňují při balení knih (popsáno v <xref linkend="sect-Publican-Users_Guide-Packaging_a_document" /> nemají smysl pro balení grafických úprav. Zejména si všimněte, že ačkoliv volba <option>--lang</option> je povinná pro balení knihy, pro balení grafické úpravy ji nepotřebujete.

source: By default, <application>Publican</application> brand packages are named:
cs_cz: Ve výchozím nastavení má název grafické úpravy vytvořené v <application>Publicanu</application> podobu:
fr_fr: Par défaut, les paquets des marques <application>Publican</application> sont nommés :

source: <filename>publican-<replaceable>brand</replaceable>-<replaceable>version</replaceable>-<replaceable>release</replaceable>.<replaceable>build_target</replaceable>.noarch.<replaceable>file_extension</replaceable></filename>.
cs_cz: <filename>publican-<replaceable>grafuprava</replaceable>-<replaceable>verze</replaceable>-<replaceable>vydani</replaceable>.<replaceable>cil_sestaveni</replaceable>.noarch.<replaceable>pripona_souboru</replaceable></filename>.
fr_fr: <filename>publican-<replaceable>marque</replaceable>-<replaceable>version</replaceable>-<replaceable>parution</replaceable>.<replaceable>cible_construction</replaceable>.noarch.<replaceable>extension</replaceable></filename>.

source: <application>Publican</application> uses the information in the <filename>publican.cfg</filename> file to supply the various parameters in the file name. Refer to <xref linkend="sect-Publican-Users_Guide-Files_in_the_brand_directory-The_publican.cfg_file" /> for details of configuring this file. Additionally:
cs_cz: <application>Publican</application> využívá pro získání parametrů do názvu souboru informace ze souboru <filename>publican.cfg</filename>. Podrobnosti o konfiguraci tohoto souboru viz <xref linkend="sect-Publican-Users_Guide-Files_in_the_brand_directory-The_publican.cfg_file" />. Dále:

source: SRPM packages have the file extension <literal>.src.rpm</literal> but binary RPM packages have the file extension <literal>.rpm</literal>
cs_cz: Balíčky SRPM mají příponu souboru <literal>.src.rpm</literal>, ale binární balíčky RPM mají příponu <literal>.rpm</literal>
fr_fr: les paquets SRPM ont l'extension de fichier <literal>.src.rpm</literal>, alors que celle des paquets RPM binaires est <literal>.rpm</literal>;

source: binary RPM packages include <literal><replaceable>build_target</replaceable>.noarch</literal> before the file extension, where <replaceable>[build_target]</replaceable> represents the operating system and version that the package is built for as set by the <parameter>os_ver</parameter> parameter in the <filename>publican.cfg</filename> file. The <literal>noarch</literal> element specifies that the package can be installed on any system, regardless of the system architecture.
cs_cz: binární balíčky RPM mají před příponou souboru <literal><replaceable>cil_sestaveni</replaceable>.noarch</literal>, kde <replaceable>[cil_sestaveni]</replaceable> zastupuje operační systém a verzi, pro který je balíček sestaven, dle nastavení parametru <parameter>os_ver</parameter> v souboru <filename>publican.cfg</filename>. Prvek <literal>noarch</literal> uvádí, že balíček lze nainstalovat na kterýkoliv systém bez ohledu na jeho architekturu.
fr_fr: les paquets RPM binaires ont l'indication <literal><replaceable>cible_construction</replaceable>.noarch</literal> avant l'extension ; <replaceable>[cible_construction]</replaceable> désigne le système d'exploitation et la version pour laquelle le paquet a été construit telle que définie par le paramètre <parameter>os_ver</parameter> dans le fichier <filename>publican.cfg</filename>. L'élément <literal>noarch</literal> indique que le paquet peut être installé sur n'importe quel système, quelle que soit l'architecture du système.
