Repository: jwulf/publican
Catalog: Users_Guide/*/Websites_structure_rpm.po
Languages: fr_fr

source: Creating the website structure
fr_fr: Création de la structure du site Web

source: Warning — This procedure replaces files
fr_fr: Attention — cette procédure remplace des fichiers

source: When you create the website structure, <application>Publican</application> places files in the <filename>/var/www/html/docs</filename> directory. Existing files in this directory might be overwritten by this procedure.
fr_fr: Quand vous créez une structure de site Web, <application>Publican</application> place des fichiers dans le répertoire <filename>/var/www/html/docs</filename>. Les fichiers existants dans ce répertoire peuvent être écrasés par cette procédure.

source: Perform the following steps on your webserver.
fr_fr: Parcourez les étapes suivantes sur le serveur Web.

source: Log into the webserver.
fr_fr: Connectez-vous au serveur Web.

source: Install <application>Publican</application> and its web components package. For example, on a webserver with a Fedora operating system, run:
fr_fr: Installez <application>Publican</application>. Par exemple, sur un serveur avec Fedora comme système d'exploitation, exécutez :

source: With root privileges, edit the <filename>/etc/publican-website.cfg</filename> file to specify the name of the site, the web host, and optionally, search parameters, default language, dump file settings, and web style for the site:
fr_fr: Avec les privilèges d'administrateur, modifiez le fichier <filename>/etc/publican-website.cfg</filename> pour définir le nom du site, l'hôte Web et, facultativement, les paramètres de recherche, la langue par défaut, les réglages du fichier de vidage pour le site et le style du site :

source: Specify the title with the <parameter>title</parameter> parameter, for example:
fr_fr: Définissez l'intitulé avec le paramètre <parameter>title</parameter>, par exemple :

source: title: "Foomaster Documentation"
fr_fr: title: "Documentation de Foomaster"

source: Normally, visitors to your website do not see this title because the site's JavaScript redirects them to a homepage. However, this title is likely to be found and indexed by search engines.
fr_fr: Normalement, les visiteurs du site Web ne voient pas ce titre parce que le JavaScript du site les redirige vers la page d'accueil. Toutefois, cet intitulé sera vraisemblablement retrouvé et indexé par les moteurs de recherche.

source: Specify the web host with the <parameter>host</parameter> parameter as a full URL, including the protocol (for example, <literal>http://</literal>). For example:
fr_fr: Définissez l'hôte Web à l'aide du paramètre <parameter>host</parameter> sous forme d'un URL complet, en précisant le protocole (par exemple, <literal>http://</literal>). Par exemple :

source: <application>Publican</application> uses the value set for <parameter>host</parameter> to construct the URLs in the XML <filename>Sitemap</filename> that it creates for search engine crawlers, and to limit searches submitted through the search box in the navigation menu to results on your site only.
fr_fr: <application>Publican</application> utilise la valeur définie pour <parameter>host</parameter> pour construire les URL dans le fichier XML <filename>Sitemap</filename> qu'il crée pour les moteurs d'indexation et pour limiter aux résultats de votre seul site les recherches opérées par l'intermédiaire de la boîte ad-hoc dans le menu de navigation.

source: Optionally, construct a search engine query to use with the search box in the navigation menu and specify the entire content of a HTML <tag>&lt;form&gt;</tag> with the <parameter>search</parameter> parameter. If you do not specify a custom web search, <application>Publican</application> creates a Google search limited to the host that you specified in the <parameter>host</parameter> parameter.
fr_fr: Facultativement, construisez une requête de moteur de recherche à utiliser avec la boîte ad-hoc dans le menu de navigation et définissez-en le contenu complet d'une <sgmltag>&lt;form&gt;</sgmltag> HTML avec le paramètre <parameter>search</parameter>. Si vous ne définissez pas une recherche Web personnalisée, <application>Publican</application> crée une recherche Google limitée à l'hôte que vous avez défini au paramètre <parameter>host</parameter>.

source: For example, to construct a Yahoo! search limited to <literal>docs.example.com</literal>, set:
fr_fr: Par exemple, pour construire une recherche Yahoo! limitée à <literal>docs.example.com</literal>, écrivez :

source: Refer to the documentation of your chosen search engine for details of how to construct custom searches.
fr_fr: Reportez-vous à la documentation de votre moteur de recherche préféré pour des précisions sur la manière de construire des recherches personnalisées.

source: If you set <literal>value="###Search###"</literal> in the code for a submit button, <application>Publican</application> uses the word <literal>Search</literal> on the button, localized into any language that <application>Publican</application> supports.
fr_fr: Si vous définissez <literal>value="###Search###"</literal> dans le code pour un bouton de soumission, <application>Publican</application> utilise le mot <literal>Search</literal> dans le bouton, traduit dans toute langue que <application>Publican</application> prend en charge.

source: Important — the search parameter is not validated
fr_fr: Important — le paramètre search n'est pas validé

source: <application>Publican</application> does not validate the <parameter>search</parameter> parameter, but builds the value of this parameter into the navigation menu exactly as you specify it. Be especially careful when you use this feature.
fr_fr: <application>Publican</application> ne valide pas le paramètre <parameter>search</parameter>, mais construit la valeur de ce paramètre dans le menu de navigation exactement comme vous l'avez défini. Soyez spécialement attentif quand vous utilisez cette fonctionnalité.

source: Optionally, set the default language of the website. <application>Publican</application> creates a separate, translatable navigation menu for each language in which you publish documentation. However, if a document is not available in a particular language, <application>Publican</application> links visitors to the untranslated version of that document. To specify the default, untranslated language for the site, set <parameter>def_lang</parameter> with a language code. For example:
fr_fr: Facultativement, définir la langue par défaut du site Web. <application>Publican</application> crée un menu de navigation séparé, traduisible pour chaque langue dans laquelle vous publiez la documentation. Mais, si un document n'est pas disponible dans une langue donnée, <application>Publican</application> liera les visiteurs à la version non traduite du document. Pour définir la langue par défaut non traduite du site, fixez la valeur de <parameter>def_lang</parameter> avec le code de la langue. Par exemple :

source: With <parameter>def_lang</parameter> set to <literal>fr-FR</literal>, visitors viewing the navigation menu in (for example) Spanish are presented with a link to the original French version of the document if the document has not yet been translated into Spanish.
fr_fr: Si <parameter>def_lang</parameter> est défini égal à <literal>fr-FR</literal>, les visiteurs visionnant le menu de navigation en espagnol (par exemple) seront reliés à la version française originale du document si celui-ci n'a pas encore été traduit en castillan.

source: Optionally, configure a <firstterm>dump file</firstterm> for the website. <application>Publican</application> can output an XML file that provides complete site content details for delivery of other services, such as web feeds or customised search pages. The file is updated whenever a book is installed or removed from the site, or the <prompt>$</prompt> <command>publican update_site</command> command is run. Configure the <parameter>dump</parameter>, <parameter>dump_file</parameter>, and <parameter>zip_dump</parameter> parameters as follows:
fr_fr: Facultativement, configurez un <firstterm>fichier de vidage</firstterm> pour le site. <application>Publican</application> peut émettre en sortie un fichier XML donnant des détails complets sur le contenu du site à livrer à d'autres services, comme des sources Web ou des pages de recherche personnalisées. Le fichier est mis à jour chaque fois qu'un ouvrage est installé ou enlevé du site, ou bien que la commande <prompt>$</prompt> <command>publican update_site</command> est lancée. Configurez les paramètres <parameter>dump</parameter>, <parameter>dump_file</parameter> et <parameter>zip_dump</parameter> ainsi :

source: Set <literal>dump: 1</literal> to enable the dump file function. This parameter defaults to <literal>0</literal> (off).
fr_fr: Définissez <literal>dump: 1</literal> pour activer la fonction fichier de vidage. Ce paramètre est fixé par défaut à <literal>0</literal> (off).

source: Set <literal>dump_file: <replaceable>name</replaceable></literal> to specify the name of the dump file and the directory in which <application>Publican</application> stores it. This parameter defaults to <literal>/var/www/html/DUMP.xml</literal>.
fr_fr: Définissez <literal>dump_file: <replaceable>nom</replaceable></literal> pour préciser le nom du fichier de vidage et le répertoire dans lequel <application>Publican</application> doit le placer. Par défaut, ce paramètre est <literal>/var/www/html/DUMP.xml</literal>.

source: Set <literal>zip_dump: 1</literal> to specify that <application>Publican</application> should create a zipped version of the XML file together with the XML version. This parameter defaults to <literal>0</literal> (off).
fr_fr: Définissez <literal>zip_dump: 1</literal> pour indiquer que <application>Publican</application> doit créer une version compressée du fichier XML en même temps qu'une version normale. Par défaut, ce paramètre est égal à <literal>0</literal> (off).

source: Refer to <xref linkend="appe-Publican-Users_Guide-Contents_of_the_website_dump_file" /> for a description of the contents of the dump file.
fr_fr: Voyez l'<xref linkend="appe-Publican-Users_Guide-Contents_of_the_website_dump_file" /> pour la description du contenu d'un fichier de vidage.

source: Optionally, specify the web style with the <parameter>web_style</parameter>.
fr_fr: Facultativement, définissez le style Web avec le paramètre <parameter>web_style</parameter>.

source: The website resembles those produced by Publican 2, with a list of products displayed in a navigation pane at the left of the page. (Default)
fr_fr: Le site Web est du type de ceux produits par Publican&nbsp;2, avec une liste de produits affichée dans un panneau de navigation sur la gauche de la page. (Défaut)

source: The website includes a breadcrumb-like navigation bar across the top of the documentation.
fr_fr: Le site Web comporte une barre de navigation de type « émietté » en haut de la documentation.

source: The web style set for your site must match the web style set for your content. For example, if you set <literal>web_style: 2</literal> for your website, you need to have <literal>web_style: 2</literal> set in each of the books that you want to install on the site. Consider setting this parameter in the <filename>defaults.cfg</filename> or <filename>overrides.cfg</filename> files of the brands that you intend to use with this site.
fr_fr: Le style Web défini pour votre site doit correspondre au style Web défini pour le contenu. Par exemple, si vous précisez <literal>web_style:&nbsp;2</literal> pour le site Web, vous devez avoir <literal>web_style:&nbsp;2</literal> pour chacun des ouvrages que vous souhaitez incorporer au site. Envisagez de paramétrer cette valeur dans le fichier <filename>defaults.cfg</filename> ou <filename>overrides.cfg</filename> de l'estampille que vous avez l'intention d'utiliser pour ce site.

source: Optionally, specify that the site tables of contents will be updated manually with the <parameter>manual_toc_update</parameter> parameter, for example:
fr_fr: En option, précisez que la table des matières du site sera mise à jour manuellement avec le paramètre <parameter>manual_toc_update</parameter>, par exemple :

source: Normally, <application>Publican</application> updates the site's tables of contents every time a documentation package is added or removed. On a site with a large number of documents on it (more than a few hundred), or where documents are updated very frequently (dozens of updates per week), this process is very demanding on a server. On a large or busy site, we recommend that you set this parameter and then periodically update the tables of contents with the <prompt>$</prompt> <command>publican update_site</command> command.
fr_fr: Normalement, <application>Publican</application> met à jour les tables des matières d'un site chaque fois qu'un paquet de documentation est ajouté ou supprimé. Sur un site avec un grand nombre de documents (plus d'une centaine), ou bien si les documents sont mis à jour très fréquemment (des dizaines de mises à jour par semaine), ce processus est très gourmand pour un serveur. Sur un site important ou occupé, nous recommandons d'activer ce paramètre et de mettre à jour périodiquement les tables des matières avec la commande <prompt>$</prompt> <command>publican update_site</command>.

source: Optionally, override the default JavaScript for the site with the <parameter>toc_js</parameter> parameter, for example:
fr_fr: Facultativement, écrasez le JavaScript par défaut pour le site en utilisant le paramètre <parameter>toc_js</parameter>, par exemple :

source: This file will be symlinked as <parameter>toc_path</parameter>/toc.js with the <prompt>$</prompt> <command>publican update_site</command> command. This path should be relative to the <parameter>toc_path</parameter> parameter.
fr_fr: Ce fichier fera l'objet d'un lien symbolique sur <parameter>toc_path</parameter>/toc.js avec la commande <prompt>$</prompt> <command>publican update_site</command>. Le chemin doit être relatif au paramètre <parameter>toc_path</parameter>.

source: Create an empty file named <filename>site_overrides.css</filename>. If you want to use site-specific styles to override those provided by <filename>interactive.css</filename>, you can add a <filename>site_overrides.css</filename> to the document that provides the site <firstterm>home page</firstterm> — refer to <xref linkend="sect-Publican-Users_Guide-Creating_installing_and_updating_the_home_page" />. If you do not want to use site-specific styles, the empty file you add here will prevent 404 errors on your server. On a Linux system, run:
fr_fr: Créez un fichier vide nommé <filename>site_overrides.css</filename>. Si vous souhaitez utiliser des styles propres à un site en sorte qu'ils prennent le pas sur ceux de <filename>interactive.css</filename>, vous pouvez ajouter un fichier <filename>site_overrides.css</filename> au document définissant la <firstterm>page d'accueil</firstterm> — voyez la <xref linkend="sect-Publican-Users_Guide-Creating_installing_and_updating_the_home_page" />. Si vous ne voulez pas utiliser de style propre au site, le fichier vide ajouté ici prévient l'apparition d'erreurs 404 sur le serveur. Sur un système Linux, exécutez :

source: To make <application>Publican</application> refresh the site structure at any time, run:
fr_fr: Pour faire en sorte que <application>Publican</application> rafraîchisse la structure du site, lancez quand bon vous semble :
