Repository: jwulf/publican
Catalog: Users_Guide/*/Websites_product_version_manual.po
Languages: cs_cz, fr_fr

source: Creating, installing, and updating product pages and version pages
cs_cz: Vytvoření, instalace a aktualizace stránek produktu a verze
fr_fr: Création, installation et mise à jour des pages du produit et des pages des versions

source: <application>Publican</application>-generated product pages and version pages are the localizable pages that provide a general overview of a product or version respectively. Visitors access these pages by clicking on a product or version in the navigation menu. The pages are structured as DocBook <tag>&lt;article&gt;</tag>s with an extra <parameter>web_type: product</parameter> or <parameter>web_type: version</parameter> parameter in their <filename>publican.cfg</filename> files. In their structure and presentation, product pages and version pages are the same as any other article that you produce with <application>Publican</application>. To create a product page or version page:
cs_cz: Stránky produktu nebo stránky verze vytvořené v <application>Publicanu</application> jsou lokalizovatelné stránky, které poskytují obecný přehled o produktu nebo verzi. Návštěvníci navštíví tyto stránky kliknutím na produkt nebo verzi v navigační nabídce. Stránky mají strukturu <tag>&lt;article&gt;</tag> z DocBook se zvláštním parametrem <parameter>web_type: product</parameter> či <parameter>web_type: version</parameter> ve svých souborech <filename>publican.cfg</filename>. Svou strukturou a vzhledem jsou stránky produktu či verze zcela stejné jako kterýkoliv jiný článek, který vytvoříte pomocí <application>Publican</application>. Chcete-li vytvořit stránku produktu či stránku verze:
fr_fr: Les pages du produit créées par <application>Publican</application> et les pages des versions sont des pages adaptables à la langue du lecteur ; elles donnent une vue générale du produit ou de la version. Les visiteurs ont accès à ces pages en cliquant sur un produit ou une version dans le menu de navigation. Les pages sont structurées de la même manière que des <sgmltag>&lt;article&gt;</sgmltag> DocBook avec des paramètres <parameter>web_type:&nbsp;product</parameter> ou <parameter>web_type:&nbsp;version</parameter> supplémentaires dans leurs fichiers <filename>publican.cfg</filename>. Dans leur structure ou présentation, les pages du produit ou des versions sont identiques à celles de n'importe quel autre article que vous auriez créé avec <application>Publican</application>. Pour créer une page de produit ou une page de version :

source: Change into a convenient directory and run the following <prompt>$</prompt> <command>publican create</command> command:
cs_cz: Přejděte do vhodného adresáře a spusťte následující příkaz <prompt>$</prompt> <command>publican create</command>:
fr_fr: Placez-vous dans un répertoire adéquat et exécutez la commande <prompt>$</prompt> <command>publican create</command> comme ceci :

source: <prompt>$</prompt> <command>publican create --type Article --name <replaceable>page_name</replaceable></command>
cs_cz: <prompt>$</prompt> <command>publican create --type Article --name <replaceable>nazev_stranky</replaceable></command>
fr_fr: <prompt>$</prompt> <command>publican create --type Article --name <replaceable>nom_page</replaceable></command>

source: For example, a product page might be:
cs_cz: Na příklad stránka produktu by mohla být vytvořena takto:
fr_fr: Par exemple, une page de produit peut être :

source: or a version page might be:
cs_cz: nebo stránka verze takto:
fr_fr: et une page version :

source: Change into the article directory:
cs_cz: Přejděte do adresáře článku:
fr_fr: Placez-vous dans le répertoire de l'article :

source: <prompt>$</prompt> <command>cd <replaceable>page_name</replaceable></command>
cs_cz: <prompt>$</prompt> <command>cd <replaceable>nazev_stranky</replaceable></command>
fr_fr: <prompt>$</prompt> <command>cd <replaceable>nom_page</replaceable></command>

source: For example:
cs_cz: Na příklad:
fr_fr: Par exemple :

source: Unlink the <filename>Article_Info.xml</filename> file from your root XML file.
cs_cz: V kořenovém souboru XML odstraňte odkaz na soubor <filename>Article_Info.xml</filename>.
fr_fr: Enlevez le lien avec le fichier <filename>Article_Info.xml</filename> dans votre fichier racine XML.

source: Little of the content of the <filename>Article_Info.xml</filename> file is likely to be useful for product pages or version pages. Therefore, edit the root XML file of your page to remove the <tag>&lt;xi:include&gt;</tag> tag that links to <filename>Article_Info.xml</filename>. <application>Publican</application> still uses the information in <filename>Article_Info.xml</filename> for packaging, but does not include it on the page itself.
cs_cz: Pravděpodobně pouze málo z obsahu souboru <filename>Article_Info.xml</filename> bude k užitku pro stránky produktu nebo verze. Proto upravte kořenový soubor XML stránky odstraněním tagu <tag>&lt;xi:include&gt;</tag> odkazujícího na <filename>Article_Info.xml</filename>. <application>Publican</application> stále využívá informace z <filename>Article_Info.xml</filename> pro vytváření balíčků, ale nezahrne ho do samotné stránky.
fr_fr: Pratiquement rien du contenu du fichier <filename>Article_Info.xml</filename> n'est susceptible d'avoir une utilité pour les pages produit ou version. Ainsi, modifiez le fichier racine XML de votre page d'accueil pour supprimer la balise <sgmltag>&lt;xi:include&gt;</sgmltag> liant à <filename>Article_Info.xml</filename>. <application>Publican</application> utilise toujours des informations situées dans <filename>Article_Info.xml</filename> pour l'empaquetage, mais il ne les incorpore pas dans la page elle-même.

source: Edit the <filename>publican.cfg</filename> file.
cs_cz: Upravte soubor <filename>publican.cfg</filename>.
fr_fr: Modifiez le fichier <filename>publican.cfg</filename>.

source: At the very least, you must add the <parameter>web_type</parameter> parameter and set it to <literal>product</literal> or <literal>version</literal>:
cs_cz: Alespoň jako nejnutnější musíte přidat parametr <parameter>web_type</parameter> a nastavit ho na hodnotu <literal>product</literal> nebo <literal>version</literal>:
fr_fr: Tout à fait à la fin, vous devez ajouter le paramètre <parameter>web_type</parameter> et lui donner la valeur <literal>product</literal> ou <literal>version</literal> :

source: or
cs_cz: nebo
fr_fr: ou

source: The <parameter>web_type</parameter> parameter instructs <application>Publican</application> to process this document differently from product documentation. This is the only mandatory change to the <filename>publican.cfg</filename> file. Other optional changes to the <filename>publican.cfg</filename> file that are frequently useful for product pages or version pages include:
cs_cz: Parametr <parameter>web_type</parameter> přinutí <application>Publican</application> zpracovat tento dokument jinak než dokumentaci produktu. Jedná se o jedinou povinnou úpravu souboru <filename>publican.cfg</filename>. Dalšími, volitelnými změnami tohoto souboru, které jsou často užitečné pro stránky produktu nebo stránky verze, jsou tyto:
fr_fr: Le paramètre <parameter>web_type:&nbsp;home</parameter> indique à <application>Publican</application> de traiter le document différemment d'une documentation de produit. C'est le seul changement obligatoire dans le fichier <filename>publican.cfg</filename>. Voici d'autres modifications facultatives pour <filename>publican.cfg</filename>, souvent utiles pour les pages du produit ou les pages des versions :

source: To style your home page to match your documents, add:
cs_cz: Chcete-li nastylizovat stránku shodně s vašimi dokumenty, přidejte:
fr_fr: Pour harmoniser le style de la page d'accueil avec vos documents, ajoutez :

source: brand: <replaceable>name_of_brand</replaceable>
cs_cz: brand: <replaceable>nazev_grafupravy</replaceable>
fr_fr: brand: <replaceable>nom_estampille</replaceable>

source: If the <tag>&lt;title&gt;</tag> or the <tag>&lt;product&gt;</tag> that you set in the <filename>Article_Info</filename> file included anything other than basic, unaccented Latin characters, set the <parameter>docname</parameter> and <parameter>product</parameter> as necessary.
cs_cz: Měl-li by <tag>&lt;title&gt;</tag> nebo <tag>&lt;product&gt;</tag>, který jste nastavili v souboru <filename>Article_Info</filename>, obsahovat cokoliv jiného než základní latinské znaky bez diakritiky, nastavte <parameter>docname</parameter> či <parameter>product</parameter>, jak je nezbytné.
fr_fr: Dans les balises <sgmltag>&lt;title&gt;</sgmltag> ou <sgmltag>&lt;product&gt;</sgmltag> définies dans le fichier <filename>Article_Info</filename> ne comportant rien d'autre que des caractères latins de base sans accents, définissez les paramètres <parameter>docname</parameter> et <parameter>product</parameter> comme il convient.

source: Edit the content of the <filename><replaceable>page_name</replaceable>.xml</filename> file (for example, <filename>FooMaster.xml</filename>) as you would any other DocBook document.
cs_cz: Upravte obsah souboru <filename><replaceable>nazev_stranky</replaceable>.xml</filename> (na příklad <filename>FooMaster.xml</filename>) tak, jako u kteréhokoliv jiného dokumentu napsaného v DocBook.
fr_fr: Modifiez le contenu du fichier <filename><replaceable>nom_page</replaceable>.xml</filename> (par exemple, <filename>Foomaster.xml</filename>) comme vous le feriez pour tout autre document DocBook.

source: If you remove the <tag>&lt;xi:include&gt;</tag> that links to <filename>Article_Info.xml</filename>, specify a title for your page in the following format:
cs_cz: Odstraníte-li <tag>&lt;xi:include&gt;</tag>, který odkazuje na <filename>Article_Info.xml</filename>, uveďte název stránky v tomto formátu:
fr_fr: Si vous supprimez la balise <sgmltag>&lt;xi:include&gt;</sgmltag> liant à <filename>Article_Info.xml</filename>, donnez un titre à votre page avec le format :

source: &lt;title role="producttitle"&gt;FooMaster Documentation&lt;/title&gt;
cs_cz: &lt;title role="producttitle"&gt;Dokumentace FooMaster&lt;/title&gt;
fr_fr: &lt;title role="producttitle"&gt;Documentation de FooMaster&lt;/title&gt;

source: If you publish documentation in more than one language, create a set of POT files and a set of PO files for each language with the <prompt>$</prompt> <command>publican update_pot</command> and <command>publican update_po</command> commands.
cs_cz: Uveřejňujete-li dokumentaci ve více než jednom jazyce, vytvořte řadu souborů POT a PO pro každý jazyk příkazy <prompt>$</prompt> <command>publican update_pot</command> a <command>publican update_po</command>.
fr_fr: Si vous publiez la documentation en plus d'une langue, créez un ensemble de fichiers POT et des ensembles de fichiers PO pour chaque langue avec les commandes <prompt>$</prompt> <command>publican update_pot</command> et <command>publican update_po</command>.

source: Build the product page or version page in single-page HTML format with the <option>--embedtoc</option> option and install it in your website structure. For example:
cs_cz: Sestavte stránku produktu nebo stránku verze ve formátu jednostránkového HTML s volbou <option>--embedtoc</option> a nainstalujte ji do struktury webových stránek. Na příklad:
fr_fr: Construisez la page du produit ou la page de version au format HTML page unique avec l'option <option>--embedtoc</option> et installez-la dans la structure du site Web. Par exemple :

source: <prompt>$</prompt> <command>publican build --publish --formats html-single --embedtoc --langs all</command> <prompt>$</prompt> <command>publican install_book --site_config ~/docsite/foomaster.cfg --lang <replaceable>Language_Code</replaceable></command>
cs_cz: <prompt>$</prompt> <command>publican build --publish --formats html-single --embedtoc --langs all</command> <prompt>$</prompt> <command>publican install_book --site_config ~/docsite/foomaster.cfg --lang <replaceable>Kod_Jazyka</replaceable></command>
fr_fr: <prompt>$</prompt> <command>publican build --publish --formats html-single --embedtoc --langs all</command> <prompt>$</prompt> <command>publican install_book --site_config ~/docsite/foomaster.cfg --lang <replaceable>Code_langue</replaceable></command>

source: Note that you can build all languages at the same time, but must install the product page or version page for each language with a separate <prompt>$</prompt> <command>publican install_book</command> command.
cs_cz: Všimněte si, že lze sestavit všechny jazyky najednou, ale nainstalovat stránku produktu či verze v každém jazyce musíte jednotlivě příkazem <prompt>$</prompt> <command>publican install_book</command>.
fr_fr: Notez que vous pouvez construire toutes les langues simultanément, mais vous devez installer la page du produit ou la page de version pour chaque langue à l'aide d'une commande <prompt>$</prompt> <command>publican install_book</command> distincte.
