Repository: jwulf/publican
Catalog: datadir/Common_Content/common/*/Conventions.po
Languages: fr_fr

source: Document Conventions
fr_fr: Conventions d'écriture

source: This manual uses several conventions to highlight certain words and phrases and draw attention to specific pieces of information.
fr_fr: Ce manuel utilise plusieurs conventions pour souligner l'importance de certains mots ou expressions, mais aussi en vue d'attirer l'attention sur certains passages d'informations précis.

source: Typographic Conventions
fr_fr: Conventions typographiques

source: Four typographic conventions are used to call attention to specific words and phrases. These conventions, and the circumstances they apply to, are as follows.
fr_fr: Quatre conventions typographiques sont utilisées pour attirer l'attention sur certains mots et expressions. Ces conventions, et les circonstances dans lesquelles elles s'appliquent, sont les suivantes.

source: <literal>Mono-spaced Bold</literal>
fr_fr: <literal>Caractères gras à espacement fixe</literal>

source: Used to highlight system input, including shell commands, file names and paths. Also used to highlight keys and key combinations. For example:
fr_fr: Utilisés pour faire ressortir certaines entrées système, y compris les commandes pour l'interpréteur, les noms de fichiers et les chemins d'accès. Également utilisés pour mettre en valeur les touches et les combinaisons de touches. Par exemple :

source: To see the contents of the file <filename>my_next_bestselling_novel</filename> in your current working directory, enter the <command>cat my_next_bestselling_novel</command> command at the shell prompt and press <keycap>Enter</keycap> to execute the command.
fr_fr: Pour consulter le contenu du fichier <filename>mon_nouvel_ouvrage_littéraire</filename>, situé dans votre dossier de travail actuel, saisissez la commande <command>cat mon_nouvel_ouvrage_littéraire</command> à l'invite du terminal et appuyez sur <keycap>Entrée</keycap> pour exécuter la commande.

source: The above includes a file name, a shell command and a key, all presented in mono-spaced bold and all distinguishable thanks to context.
fr_fr: L'exemple ci-dessus contient un nom de fichier, une commande d'interpréteur et la désignation d'une touche de clavier, tous présentés sous forme de caractères gras à espacement fixe et tous bien distincts grâce au contexte.

source: Key combinations can be distinguished from an individual key by the plus sign that connects each part of a key combination. For example:
fr_fr: Les combinaisons de touches se distinguent d'une touche insolée par le signe « plus », qui relie les différents éléments de la combinaison. Par exemple :

source: Press <keycap>Enter</keycap> to execute the command.
fr_fr: Appuyez sur <keycap>Entrée</keycap> pour exécuter la commande.

source: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo> to switch to a virtual terminal.
fr_fr: Appuyez sur <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo> pour basculer sur un terminal virtuel.

source: The first example highlights a particular key to press. The second example highlights a key combination: a set of three keys pressed simultaneously.
fr_fr: Le premier exemple met en valeur une touche particulière sur laquelle il convient d'appuyer. Le second exemple affiche une combinaison de touches : un ensemble de trois touches à presser simultanément.

source: If source code is discussed, class names, methods, functions, variable names and returned values mentioned within a paragraph will be presented as above, in <literal>mono-spaced bold</literal>. For example:
fr_fr: Si l'on traite de code source, noms de classes, méthodes, fonctions, noms de variables et valeurs de retour mentionnés dans un paragraphe sont présentés comme ci-dessus, en <literal>caractères gras à espacement fixe</literal>. Par exemple :

source: File-related classes include <classname>filesystem</classname> for file systems, <classname>file</classname> for files, and <classname>dir</classname> for directories. Each class has its own associated set of permissions.
fr_fr: Les classes se rapportant aux fichiers comprennent : <classname>filesystem</classname> pour des systèmes de fichiers, <classname>file</classname> pour les fichiers et <classname>dir</classname> pour les dossiers. Chaque classe possède son propre ensemble de droits d'accès associés.

source: <application>Proportional Bold</application>
fr_fr: <application>Caractères gras proportionnels</application>

source: This denotes words or phrases encountered on a system, including application names; dialog-box text; labeled buttons; check-box and radio-button labels; menu titles and submenu titles. For example:
fr_fr: Cette convention est destinée à mettre en valeur des mots ou des phrases rencontrés sur un système, comprenant des noms d'application, des textes de boîtes de dialogue, des étiquettes de boutons, de cases à cocher et de boutons radio, des intitulés de menus et de sous-menus. Par exemple :

source: Choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> from the main menu bar to launch <application>Mouse Preferences</application>. In the <guilabel>Buttons</guilabel> tab, select the <guilabel>Left-handed mouse</guilabel> check box and click <guibutton>Close</guibutton> to switch the primary mouse button from the left to the right (making the mouse suitable for use in the left hand).
fr_fr: Sélectionnez <menuchoice><guimenu>Système</guimenu><guisubmenu>Préférences</guisubmenu><guimenuitem>Souris</guimenuitem></menuchoice> à partir de la barre du menu principal pour lancer <application>Préférences de la souris</application>. Dans l'onglet <guilabel>Boutons</guilabel>, cochez la case <guilabel>Pour gaucher</guilabel>, puis cliquez sur <guibutton>Fermer</guibutton> pour faire passer le bouton principal de la souris de gauche à droite (ce qui permet l'utilisation de la souris avec la main gauche).

source: To insert a special character into a <application>gedit</application> file, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> from the main menu bar. Next, choose <menuchoice><guimenu>Search</guimenu><guimenuitem>Find…</guimenuitem></menuchoice> from the <application>Character Map</application> menu bar, type the name of the character in the <guilabel>Search</guilabel> field and click <guibutton>Next</guibutton>. The character you sought will be highlighted in the <guilabel>Character Table</guilabel>. Double-click this highlighted character to place it in the <guilabel>Text to copy</guilabel> field and then click the <guibutton>Copy</guibutton> button. Now switch back to your document and choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> from the <application>gedit</application> menu bar.
fr_fr: Pour insérer un caractère spécial dans un fichier <application>gedit</application>, choisissez <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessoires</guisubmenu><guimenuitem>Table des caractères</guimenuitem></menuchoice> depuis la barre du menu principal. Ensuite, choisissez <menuchoice><guimenu>Recherche</guimenu><guimenuitem>Trouver…</guimenuitem></menuchoice> depuis la barre du menu <application>Table des caractères</application>, saisissez le nom du caractère dans le champ <guilabel>Recherche</guilabel> puis cliquez sur <guibutton>Suivant</guibutton>. Le caractère recherché sera surligné dans la <guilabel>Table des caractères</guilabel>. Double-cliquez sur le caractère surligné pour le placer dans le champ <guilabel>Texte à copier</guilabel>, puis cliquez sur le bouton <guibutton>Copier</guibutton>. Vous pouvez désormais revenir à votre document et choisir <menuchoice><guimenu>Modifier</guimenu><guimenuitem>Coller</guimenuitem></menuchoice> depuis la barre du menu <application>gedit</application>.

source: The above text includes application names; system-wide menu names and items; application-specific menu names; and buttons and text found within a GUI interface, all presented in proportional bold and all distinguishable by context.
fr_fr: Le texte ci-dessus contient des noms d'applications, des noms de menus et d'autres éléments relatifs à l'ensemble du système, des boutons et textes que l'on trouve dans une interface graphique. Présentés sous la forme gras proportionnel, ils sont tous facilement identifiables dans le contexte.

source: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> or <application><replaceable>Proportional Bold Italic</replaceable></application>
fr_fr: <command><replaceable>Italique gras à espacement fixe </replaceable></command> ou <application><replaceable>Italique gras proportionnel</replaceable></application>

source: Whether mono-spaced bold or proportional bold, the addition of italics indicates replaceable or variable text. Italics denotes text you do not input literally or displayed text that changes depending on circumstance. For example:
fr_fr: Qu'ils soient en caractères gras à espacement fixe ou en caractères gras proportionnels, l'ajout de l'italique indique la présence de texte remplaçable ou variable. Les caractères en italique indiquent la présence de texte que vous ne saisissez pas littéralement ou de texte affiché qui change en fonction des circonstances. Par exemple :

source: To connect to a remote machine using ssh, type <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> at a shell prompt. If the remote machine is <filename>example.com</filename> and your username on that machine is john, type <command>ssh john@example.com</command>.
fr_fr: Pour se connecter à une machine distante en utilisant ssh, saisissez <command>ssh <replaceable>nom_utilisateur</replaceable>@<replaceable>nom.domaine</replaceable></command> après l'invite de commande de la console. Si la machine distante est <filename>exemple.com</filename> et que votre nom d'utilisateur sur cette machine est john, saisissez <command>ssh john@example.com</command>.

source: The <command>mount -o remount <replaceable>file-system</replaceable></command> command remounts the named file system. For example, to remount the <filename>/home</filename> file system, the command is <command>mount -o remount /home</command>.
fr_fr: La commande <command>mount -o remount <replaceable>système_de_fichiers</replaceable></command> monte le système de fichiers nommé. Ainsi, pour monter à nouveau le système de fichiers <filename>/home</filename>, la commande est <command>mount -o remount /home</command>.

source: To see the version of a currently installed package, use the <command>rpm -q <replaceable>package</replaceable></command> command. It will return a result as follows: <command><replaceable>package-version-release</replaceable></command>.
fr_fr: Pour connaître la version d'un paquet actuellement installé, utilisez la commande <command>rpm -q <replaceable>paquet</replaceable></command>. Elle renvoie le résultat suivant : <command><replaceable>version_parution_paquet</replaceable></command>.

source: Note the words in bold italics above: username, domain.name, file-system, package, version and release. Each word is a placeholder, either for text you enter when issuing a command or for text displayed by the system.
fr_fr: Notez les mots en gras italique ci-dessus : nom_utilisateur, nom.domaine, système_de_fichiers, paquet, version ou parution. Chaque mot est un paramètre substituable, soit pour le texte à saisir lors de l'émission de la commande, soit pour celui affiché par le système.

source: Aside from standard usage for presenting the title of a work, italics denotes the first use of a new and important term. For example:
fr_fr: Mise à part l'utilisation habituelle pour la présentation du titre d'un ouvrage, les caractères italiques indiquent une première utilisation d'un terme nouveau et important. Ainsi :

source: Publican is a <firstterm>DocBook</firstterm> publishing system.
fr_fr: Publican est un système de publication <firstterm>DocBook</firstterm>.

source: Pull-quote Conventions
fr_fr: Conventions pour extraits

source: Terminal output and source code listings are set off visually from the surrounding text.
fr_fr: Les sorties de terminal et les extraits de code source ressortent visuellement par rapport au texte avoisinant.

source: Output sent to a terminal is set in <computeroutput>mono-spaced roman</computeroutput> and presented thus:
fr_fr: Les sorties envoyées sur un terminal sont en caractères <computeroutput>romains à espacement fixe</computeroutput> et présentées ainsi :

source: Source-code listings are also set in <computeroutput>mono-spaced roman</computeroutput> but add syntax highlighting as follows:
fr_fr: Les extraits de code source sont également présentés en <computeroutput>romains à espacement fixe</computeroutput>, mais avec une coloration syntaxique, ainsi :

source: Notes and Warnings
fr_fr: Notes et avertissements

source: Finally, we use three visual styles to draw attention to information that might otherwise be overlooked.
fr_fr: Enfin, nous utilisons trois styles visuels pour attirer l'attention sur des informations qui, autrement, auraient pu passer inaperçues :

source: Notes are tips, shortcuts or alternative approaches to the task at hand. Ignoring a note should have no negative consequences, but you might miss out on a trick that makes your life easier.
fr_fr: Les « Notes » soulignent des astuces, des raccourcis ou des approches autres par rapport à la tâche à entreprendre. L'ignorer ne devrait pas avoir de conséquences négatives, mais vous pourriez passer à côté d'un truc qui vous aurait simplifié la vie.

source: Important boxes detail things that are easily missed: configuration changes that only apply to the current session, or services that need restarting before an update will apply. Ignoring a box labeled “Important” will not cause data loss but may cause irritation and frustration.
fr_fr: Les boîtes « Important » détaillent des éléments qui pourraient être facilement négligés : des modifications de configurations qui ne s'appliquent qu'à la session en cours ou des services ayant besoin d'être redémarrés pour que la mise à jour s'applique. Si vous ignorez une boîte étiquetée « Important », vous ne perdrez aucune donnée, mais cela pourrait être source de frustration et d'irritation.

source: Warnings should not be ignored. Ignoring warnings will most likely cause data loss.
fr_fr: Un « Avertissement » ne doit pas être ignoré. Ne pas tenir compte des avertissements entraînera vraisemblablement des pertes de données.
